{"id":1272,"date":"2010-12-20T07:44:52","date_gmt":"2010-12-20T13:44:52","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/the_man_behind_gaplogo.php"},"modified":"2010-12-20T07:44:52","modified_gmt":"2010-12-20T13:44:52","slug":"the_man_behind_gaplogo","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/the_man_behind_gaplogo.php","title":{"rendered":"The Man Behind @GapLogo"},"content":{"rendered":"<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/gaplogo_interview.gif\" alt=\"GapLogo Interview\" \/><\/p>\n<p>With the end of the year closer and the need for closure looming like a pre-new year resolution, I had the opportunity to provide you all with closure on at least one loose end: Who is <a href=\"http:\/\/twitter.com\/gaplogo\" target=\"_blank\" rel=\"noopener noreferrer\">@GapLogo<\/a>? That snarky, sneaky, prolific fake Twitter account that served as the emcee for <a href=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/follow-up_gapgate.php\" target=\"_blank\" rel=\"noopener noreferrer\">Gapgate<\/a>. Even though we are not the first to reveal its identity &mdash; <a href=\"http:\/\/instagr.am\/p\/JB_k\/\" target=\"_blank\" rel=\"noopener noreferrer\">SwissMiss had him for lunch over at her studio<\/a> and then tweeted his real Twitter account &mdash; we are happy to bring a tell-all (not that there is much to tell as you&#8217;ll see, but still&hellip;) interview with the man behind @GapLogo: <a href=\"http:\/\/www.lawrence-richards.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Alex Lawrence-Richards<\/a>.<\/p><!--more--><p><span class=\"red\"><strong>Armin Vit:<\/strong> In a nutshell: Who are you?<\/span><\/p>\n<p><span class=\"blue\"><strong>Alex Lawrence-Richards:<\/strong><\/span> I&#8217;m an unassuming graphic designer living and working in New York City (I live in Williamsburg currently). I moved out here about 4 years ago after graduating from the University of Iowa to follow a dream and a girl. I worked for a big agency for a couple years and after that I started my own boutique design shop, focused on growing my freelance work into a full-time business.<\/p>\n<p><span class=\"red\"><strong>AV:<\/strong> Probably everyone is wondering this: Why? What prompted you to start the fake Twitter account?<\/span><\/p>\n<p><span class=\"blue\"><strong>A L-R:<\/strong><\/span> I saw a friend tweet about the new logo the day it was rolled out on Gap&#8217;s website. As you all remember there was hardly any fanfare about it so I checked out Gap&#8217;s site, chuckled to myself and went about my day. The next morning on a whim I checked to see if the name GapLogo was taken on Twitter, it wasn&#8217;t and so I registered the account and then began in earnest just tweeting out defending &#8220;my&#8221; design aesthetic as the logo. I did this mostly for myself, just to see what would happen. Would people care? Would they think what I was saying was funny?<\/p>\n<p><span class=\"red\"><strong>AV:<\/strong> Did you think your alter ego was going to be so popular and so well embraced by The Twitter when you started?<\/span><\/p>\n<p><span class=\"blue\"><strong>A L-R:<\/strong><\/span>I had no idea the reaction would be so&#8230; strong, both towards the logo and my alter ego. The reaction was pretty hilarious among the &#8220;Twitterverse&#8221;. Half the people thought I was some sort of sanctioned social media campaign and were aghast when I took to snarkily responding to their tweets about the new logo. The other half got the joke and seemed to appreciate the commentary. It was interesting because there were so many angles to this whole saga. You had the design angle, the public relations (or lack thereof) angle and then the response from the general public. It was a comedy of errors on many different levels.<\/p>\n<p><span class=\"red\"><strong>AV:<\/strong> During the three or five days of Gapgate, how much time did you devote to @GapLogo?<\/span><\/p>\n<p><span class=\"blue\"><strong>A L-R:<\/strong><\/span>The first couple of days I probably spent a good 4-5 hours over the course of the day tweeting, @-replying and trying to come up with funny things to tweet. I&#8217;d be walking my dog or running errands and I&#8217;d get an idea for a tweet and scribble it down and let it percolate in my head. A day or two in things got really crazy &#8212; I got interviewed by Alissa Walker from Fast Company (the only person I actually revealed myself to during most of Gapgate), and then the whole thing began getting picked up by traditional media outlets. I saw stories about the new branding and my satirical account on of Forbes, The Wall Street Journal, Time, The New York Times, etc., which was a little nuts. Even my mom heard about the logo and satirical Twitter account.<\/p>\n<p><span class=\"red\"><strong>AV:<\/strong> You are still Tweeting heavily through @GapLogo, almost like a father figure to all the latest hated logos to be recently designed. Why keep at it?<\/span><\/p>\n<p><span class=\"blue\"><strong>A L-R:<\/strong><\/span>Lately it&#8217;s been to see if I could revive the magic of the account, but it&#8217;s pretty clear that it&#8217;s time to say goodbye. By now most people have gotten tired of the account &#8212; myself included. It&#8217;s served its purpose and probably over-stayed its welcome. It was a good run and it seems to have inspired other funny design-related Twitter accounts and focused a laser beam on the whole spec work\/crowd sourcing issue but for me, excluding this interview, I think it&#8217;s time to fade back into the shadows.<\/p>\n<p><span class=\"red\"><strong>AV:<\/strong> There was the @itunes10icon before you, then there was the Sears logo account which I can&#8217;t find anymore, and, most recently @ComedyCentralC. The latter two have been mostly lame. What makes for a good fake logo Twitter account?<\/span><\/p>\n<p><span class=\"blue\"><strong>A L-R:<\/strong><\/span>I think it requires a good balance of knowing a bit about your subject (in this case Gap\/design\/logos\/trainwrecks), your audience and being funny! I was also lucky that the backlash to the logo was so strong, not just by design folks but their customers and casual observers &#8212; something I&#8217;m sure Gap wasn&#8217;t expecting and that perfect storm helped make the satirical Twitter account that much more funny and relevant for those few days. I was able to feed off that as well as Gap&#8217;s own missteps in dealing with the bad PR (crowdsourcing, waffling on whether or not the logo was a permanent change or a stopgap, etc.). It gave me more content to poke fun of Gap with.<\/p>\n<p><span class=\"red\"><strong>AV:<\/strong> Thanks for your time Alex. If that is your real name.<\/span><\/p>","protected":false},"excerpt":{"rendered":"<img src=\"https:\/\/www.underconsideration.com\/brandnew\/images\/excerpt_empty.gif\" alt=\"Excerpt Empty\" \/>","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[10,26,88],"tags":[348],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/1272"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=1272"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/1272\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=1272"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=1272"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=1272"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}