{"id":2251,"date":"2012-12-12T05:32:56","date_gmt":"2012-12-12T11:32:56","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/follow-up_university_of_california.php"},"modified":"2012-12-12T05:32:56","modified_gmt":"2012-12-12T11:32:56","slug":"follow_up_university_of_california","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/follow_up_university_of_california.php","title":{"rendered":"Follow-up: University of California"},"content":{"rendered":"<p>Although I prefer to never deviate from the format of our posts on Brand New &mdash; critiques of Before\/After or New logos\/identities &mdash; and keep things simple there is a bunch of stupidity going on right now about the recently released logo and identity for the University of California (UC) that deserves a response. (Read my original review <a href=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/ic_uc_we_all_c_for_california.php\" target=\"_blank\" rel=\"noopener noreferrer\">here<\/a>.) To summarize: <a href=\"http:\/\/www.change.org\/petitions\/university-of-california-stop-the-new-uc-logo\" target=\"_blank\" rel=\"noopener noreferrer\">A petition on Change.org<\/a>, currently boasting over 50,000 supporters, is demanding that UC either keep the seal as its main logo or design a new logo to replace the new logo. Parallel to the petition, various news outlets (online and in print) have written about the petition and mostly skewed the conversation as to how bad this logo is; some going as far as calling it &#8220;<a href=\"http:\/\/www.thesfegotist.com\/news\/local\/2012\/december\/11\/university-california-debuts-one-worst-logo-rebrands-history\" target=\"_blank\" rel=\"noopener noreferrer\">one of the worst logo rebrands in history<\/a>&#8220;. You can find all the relevant links in the aptly titled Facebook page, <a href=\"http:\/\/www.facebook.com\/StopTheUCLogoChange\" target=\"_blank\" rel=\"noopener noreferrer\">Stop the UC Logo Change<\/a>. If you only read this paragraph and happen to be either in favor of the petition or have signed the petition and further expanded your thoughts and put them in writing of why this logo is so bad, here is what you need to know: shut up. Seriously. Shut. Up.<\/p><!--more--><p>I wish I had the time to devote the rest of this week to write a response to each and every single supporter who has left a comment in the Change.org petition, because each one is more asinine than the next. I get the feeling all these people are auditioning for <em>Best Week Ever<\/em> to see who can come up with the least substantial criticism while going &#8220;Am I right? Am I right?&#8221; For example:<\/p>\n<blockquote>\nI don&#8217;t want the symbolic representation of my university to look like the logo of something found in the toddler section of Toys R&#8217; Us. &mdash; Jessica Pena<br \/><br \/>The &#8220;redesigned&#8221; one looks like something somebody made in PowerPoint in 5 minutes. &mdash; Nimish Pratha<br \/><br \/>I graduated from a prestigious university, not a summer camp for preteens. &mdash; Elena Radicati<br \/><br \/>I don&#8217;t want the UC logo looking like a flushing toilet. &mdash; Terrance Bei\n<\/blockquote>\n<p>So, is the logo really that bad? No. It&#8217;s not. Is it, then, good? Yes. Or at least it&#8217;s more good than it is bad. It&#8217;s not a logo that makes me stand up and do the wave. It&#8217;s a &#8220;U&#8221; that its top is shaped like a book and its bottom contains a &#8220;C&#8221; (that only sometimes is used with a gradient). It&#8217;s not groundbreaking. But it&#8217;s not as offensive as people are making it out to be. There is this palpable degree of indignation in the petition that would make you think the logo showed labrador puppies wearing Klu Klux Klan hats speared with swastika-shaped ninja stars:<\/p>\n<blockquote>\nTo have this as a symbol for our campus is an insult. &mdash; John Lee<br \/><br \/>The new choice of symbol is disrespectful to all of the amazing work, progress, and learning that takes place in the walls of the UC.&mdash; Alexey Drobizhev<br \/><br \/>I refuse to identify myself and my affiliation with such a great institution as the UC system through a badly-designed overlaying of more-or-less random shapes.&mdash; Amanda Lim<br \/><br \/>I honestly think that this logo will cause people to think badly, consciously or unconsciously, of the UC system. &mdash; Nimish Pratha<br \/><br \/>There is class and honor in being a student in the UC system and this logo is classless. &mdash; Jennifer Costley <br \/><br \/>This heavily devalues my university as well as my bachelor &amp; master&#8217;s degrees. &mdash; Katherine Hsueh [<em>Ed.&#8217;s Note: this is probably the absolute stupidest comment and reflective of the kind of thinking that permeates all the supporters<\/em>]\n<\/blockquote>\n<p>It really baffles me that, all of a sudden, one day, all these people decided to pay attention to the logo of the university system that manages their own specific university, which have logos of their own &mdash; which, by the way, are nothing to be graphically proud of &mdash; and that there is a sudden admiration of this system&#8217;s seal. I have never seen so many people so passionate about a seal. A seal that looks exactly like a hundred other university seals.<\/p>\n<blockquote>\nThe old seal represents the status of the University of California as a world class center for science and academia &mdash; Alexey Drobizhev<br \/><br \/>The current logo represents prestige, tradition, and a high level of academia.&mdash; Shannon Melser<br \/><br \/>The old logo evokes the timeless elegance and dignity of a revered educational institution.&mdash; Nimish Pratha<br \/><br \/>If they change this logo, we are taking away what has been <em>unique<\/em> to only us for a very long time. &mdash; Wendy Chavez [<em>Ed.&#8217;s Note: Emphasis mine as launchpad for below.<\/em>]\n<\/blockquote>\n<p>Really? <a href=\"https:\/\/www.google.com\/search?hl=en&#038;lr=lang_en&#038;q=university+seal&#038;bav=on.2,or.r_gc.r_pw.r_qf.&#038;bvm=bv.1354675689,d.aWM&#038;bpcl=39650382&#038;biw=1297&#038;bih=877&#038;um=1&#038;ie=UTF-8&#038;tbm=isch&#038;source=og&#038;sa=N&#038;tab=wi&#038;ei=TfvHUPvEOYS3qgGMyYG4Cw\" target=\"_blank\" rel=\"noopener noreferrer\">Google-image those suckers<\/a> and tell me anyone of those (or UC&#8217;s) are the ultimate identifier for a school and worth being derisive and disrespectful of both the people that run the school and to the design team behind the logo. Who wants another star-book-tree-type-in-a-circle piece of unreadable crap that meant something to someone a hundred years ago? Move on. A logo doesn&#8217;t have to be the equivalent of a book trilogy and tell all its story through a circular device. A logo, actually, is nothing. It&#8217;s useless. It derives meaning from what it represents. I&#8217;ve said this before: The Nike swoosh logo is shit. It&#8217;s a clunky checkmark. People think it&#8217;s great but it&#8217;s not. It&#8217;s the amazing athletes and their stories that Nike has associated with over the decades. It&#8217;s the quality products. It&#8217;s the great ads. It&#8217;s not the logo. If all these UC students think that this logo defines them then they have no self-worth. Their actions and their words define the logo. And, right now, what these people are saying and doing, reflects that UC is a bunch of cry-babies. Shut up. Let professionals do their work.<\/p>\n<p>To be perfectly honest, I don&#8217;t care if this logo withers and dies or if it survives and prospers. I have no vested interested in it. And I don&#8217;t know the designers behind it. What I do care about, deeply, is the danger this mob mentality poses to the practice of logo and identity design, which is, no way, a democratic process: People in leadership positions make these decisions; it&#8217;s their responsibility to get buy-in from whatever number of people they feel is required to push their decision forward &mdash; sometimes it&#8217;s five people, sometimes it&#8217;s endless focus groups. But the process and the final decision is between client and designer. Not between mob and online petitions. Do you feel left out and that your voice doesn&#8217;t count? Too bad. Then make yourself be part of the process and work your way to influence those decisions that so infuriate you and understand the process and hear the conversations that lead to specific decisions. Otherwise it&#8217;s just noise.<\/p>\n<p>After this long rant, my point is this&hellip;<\/p>\n<p>&mdash; &mdash;<\/p>\n<p>To:<br \/>\nUniversity of California, The Regents Office<br \/>\nJason Simon, Director, Marketing Communications of the University of California<\/p>\n<p>You have hired a group of designers to do a job. You interviewed and vetted them. You gave them the go-ahead to embark on a redesign from within. (You can&#8217;t imagine how angrier the backlash would have been had you hired an outside branding firm and paid them money). You saw the work evolve and slowly enter the visual landscape of your university system. This is a decent logo deployed through an attractive and smart identity system. Trust me. I literally see hundreds of identities each year. I know shit when I see it. I know gold when I see it. This is neither. This is simply good, solid work that will require time to implement and to be accepted as part of the visual vocabulary of your communication. Also trust me when I say this: In six months time no one, and I mean no one, not even Mr. Reaz Rahman, starter of the petition, will remember what all the fuss was about. Trust the decisions you have made. Don&#8217;t succumb to the mob. They do not &mdash; DO NOT &mdash; know better than you. If you are asking yourself, &#8220;But 50,000 people can&#8217;t all be wrong.&#8221; Read their comments, not a single person has identified what makes the seal so effective or proven how the new logo will bring the school to ashes. And keep in mind your overall constituency of &#8220;220,000 students and more than 170,000 faculty and staff, with more than 1.5 million alumni&#8221; &mdash; 50,000 is only a fraction.<\/p>\n<p>Sincerely,<br \/>\nArmin Vit<br \/>Someone who would hate to see a decent logo die because someone didn&#8217;t like the way it looked. Funny story: You know what Nike founder Phil Knight said when he was presented (and proceeded to select) the swoosh logo? &#8220;I don&#8217;t love it. But it will grow on me.&#8221; Give the logo a chance and make good institutional decisions and put out great students who are proud of where they earned their degree. THAT&#8217;S what will define if your logo is good or not.<\/p>","protected":false},"excerpt":{"rendered":"<script type=\"text\/javascript\" src=\"swfobject.js\"><\/script>\n<script type=\"text\/javascript\">\n\t<!--\n\tfunction pollSystemObj()\n\t{\n\t\tvar now = new Date();\n\t\tvar hour = now.getHours();\n\t\tvar minute = now.getMinutes();\n\t\tvar second = now.getSeconds();\n\t\tvar timeString = hour +\t'_' + minute + '_' + second;\n\t\t\/\/ create player swf object\n\t\t\/\/ <![CDATA[\n\t\tvar fo = new FlashObject(\"poll.swf?xml=poll_121212_config_01.xml&#038;xyz=poll_121212_votes_01.xml&#038;timeString\", \"poll\", \"574\", \"235\", 7);\n\t\tfo.write(\"pollDiv1\");\n\t\t\/\/ ]]&gt;\n\t}\n\t-->\n<\/script>\n<!--START DATA TABLE-->\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/images\/divider_voting_start.gif\" alt=\"Voting Begins\" \/>\n<table class=\"table\" cellspacing=\"0\">\n\t<tr valign=\"top\">\n        <!--VOTE CONCEPT-->\n\t\t<td class=\"table_col\">\n\t\t\t<div id = \"pollDiv1\" style=\"width:100%;height:100%\"><\/div>\n\t\t<\/td>\n\t<\/tr>\n<\/table>\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/images\/divider_voting_end.gif\" alt=\"Voting Ends\" \/>","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[29,10,26],"tags":[819],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/2251"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=2251"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/2251\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=2251"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=2251"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=2251"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}