{"id":2292,"date":"2013-01-18T05:18:41","date_gmt":"2013-01-18T11:18:41","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/my_kind_of_american_exceptionalism.php"},"modified":"2013-01-18T05:18:41","modified_gmt":"2013-01-18T11:18:41","slug":"my_kind_of_american_exceptionalism","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/my_kind_of_american_exceptionalism.php","title":{"rendered":"My Kind of American Exceptionalism"},"content":{"rendered":"<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/american_airlines_2013_logo.png\" alt=\"American Airlines Logo, Before and After\" \/><\/p><\/p>\n<p>Flying used to mean something.<\/p>\n<p>And before <a href=\"http:\/\/en.wikipedia.org\/wiki\/People_Express_Airlines\" target=\"_blank\" rel=\"noopener noreferrer\">People Express Airlines<\/a> remade air travel into the equivalent of a bus ride, before the mediascape overinformed us about every possible destination, before the <a href=\"http:\/\/en.wikipedia.org\/wiki\/Security_theater\" target=\"_blank\" rel=\"noopener noreferrer\">security theater<\/a> of X-rayed shoes, and before the global financial crisis, the experience of flying actually delivered on that promise.<\/p>\n<p>But now, air travel can be a miserable experience. Especially if you fly coach. And especially if you fly American Airlines.<\/p>\n<p style=\"margin-left:20px;margin-right:20px;\">[<em>Ed.&#8217;s Note: This is the first time I hand over a &#8220;large&#8221; review to anyone. Mark Kingsley, a good friend and annoyingly astute observer, asked if he could do it, saying he was &#8220;totally excited&#8221; about the work. His point of view on this is likely the last thing you expected to hear from Brand New. Enjoy. &mdash; Armin Vit<\/em>]<\/p><!--more--><p>I&#8217;ve been flying since the late 1970s, from coach on EasyJet to first class on Singapore, from the great American enemies of the 20th Century (Moscow, Berlin, Tokyo) to the great centers of sensuality (Paris, Rome, Cancun). And in that time, American ranked towards the bottom of my personal list of crappy airlines, just above SABENA (which jokingly stands for Such A Bloody Experience, Never Again).<\/p>\n<p>American&#8217;s fleet is old. Passenger seats shake loose and unbolt in <a href=\"http:\/\/abcnews.go.com\/Travel\/second-set-american-airlines-seats-becomes-loose\/story?id=17364171\" target=\"_blank\" rel=\"noopener noreferrer\">mid-flight<\/a>. Their employees are completely disgruntled (and happy to kvetch to any random passenger). Their boarding process is painfully <a href=\"http:\/\/www.aa.com\/i18n\/urls\/boarding.jsp\" target=\"_blank\" rel=\"noopener noreferrer\">byzantine<\/a> (beginning with First Class and uniformed military; then Business Class, AAdvantage Executive Platinum and oneworld Emerald; followed by AAdvantage Platinum and oneworld Sapphire; then PriorityAAccess, oneworld Ruby and what they classify as Group 1; then Group 2; Group 3; and finally Group 4). The food sucks. Famous <a href=\"http:\/\/www.nytimes.com\/2012\/09\/30\/opinion\/sunday\/a-trans-atlantic-trip-turns-kafkaesque.html?_r=0\" target=\"_blank\" rel=\"noopener noreferrer\">novelists<\/a>, <a href=\"http:\/\/www.foxnews.com\/travel\/2013\/01\/15\/anthony-bourdain-launches-twitter-rant-following-american-airlines-flight\/\" target=\"_blank\" rel=\"noopener noreferrer\">chefs<\/a>, <a href=\"http:\/\/www.airlinequality.com\/Forum\/am_aa.htm\" target=\"_blank\" rel=\"noopener noreferrer\">customers<\/a> and <a href=\"http:\/\/www.slate.com\/articles\/business\/moneybox\/2012\/10\/american_airlines_delays_the_airline_that_can_t_get_its_passengers_to_their_destinations_on_time_manage_its_workers_or_even_keep_its_seats_bolted_down_.single.html\" target=\"_blank\" rel=\"noopener noreferrer\">journalists<\/a> scold them in public. <\/p>\n<p>And they&#8217;re bankrupt.<\/p>\n<p>Sounds like a perfect building opportunity.<\/p>\n<p>On top of that, they have an iconic logo, dating from 1968 and designed by the beloved and equally iconic <a href=\"http:\/\/www.vignelli.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Massimo Vignelli<\/a>.<\/p>\n<p>Sounds like a perfect branding opportunity.<\/p>\n<p>Oh what an opportunity this was. It&#8217;s been years since such an iconic company went through a rebrand, and perhaps even longer since such a rebrand came burdened with so many cultural and mythic repercussions.<\/p>\n<p>When he made his historic solo Atlantic flight, Charles Lindbergh was an employee of Robertson Aircraft Corporation, one of the many companies which merged in 1934 to become American Airlines. And from there, American frequently was on the cutting edge of employee training (the first flight attendant training facility), information technology (the SABRE system), customer service (Super Saver discounts and the AAdvantage travel awards program), and aeronautic technology. <\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/american_airlines_2013_logo_history.jpg\" alt=\"American Airlines Logo, Livery, and Identity\" \/><\/p>\n<p class=\"caption\">The history of the American Airlines logo, from left: 1934, 1945, 1962, 1968.<\/p>\n<p>American had the rich history typical of strong brands, as well as a rich cultural mythology. <\/p>\n<p>To rebrand American Airlines was an opportunity to put one of those mythic dents in the universe. This was more than just an airline, this was America itself. As in America, the country that invented aviation. <\/p>\n<p>American is generally how Americans travel between American cities. And in the &#8220;Olympic villages&#8221; of international airport tarmacs, this was the opportunity to dress the American team. Beyond the outer client-facing symbolism, American also had the opportunity to acknowledge their internal audience and signal positive change for employees as well, through technology upgrades, additional training and increased hiring.<\/p>\n<p>So ultimately, after an intense selection process, <a href=\"http:\/\/www.futurebrand.com\/news\/aa\/\" target=\"_blank\" rel=\"noopener noreferrer\">FutureBrand<\/a> was awarded that very opportunity. And they brought their AA-game.<\/p>\n<blockquote>&#8220;Our new logo and livery are designed to reflect the passion for progress and the soaring spirit, which is uniquely American,&#8221; said Virasb Vahidi, American&#8217;s Chief Commercial Officer. &#8220;Our core colors &#8212; red, white and blue &#8212; have been updated to reflect a more vibrant and welcoming spirit. The new tail, with stripes flying proudly, is a bold reflection of American&#8217;s origin and name. And our new flight symbol, an updated eagle, incorporates the many icons that people have come to associate with American, including the &#8216;A&#8217; and the star.&#8221;<br \/>&mdash; <a href=\"http:\/\/aa.mediaroom.com\/index.php?s=43&#038;item=3617\" target=\"_blank\" rel=\"noopener noreferrer\">Press Release<\/a><\/blockquote>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/american_airlines_2013_logo_icon_detail.png\" alt=\"American Airlines Logo, Livery, and Identity\" \/><\/p>\n<p>The result is astounding &mdash; <a href=\"http:\/\/www.aa.com\/newamerican\/\" target=\"_blank\" rel=\"noopener noreferrer\">see the Becoming a New American launch site<\/a>. The mark, known internally as the Flight Symbol, deftly manages to honor American&#8217;s design history and, at the same time, convey a stark, confident modernity which stands among the best symbols anywhere. It does much with very little, in a straightforward way which feels so American. That is&hellip; American in the way we like to think America can be.<\/p>\n<p>This arrangement of three simple shapes conveys in the most light-handed way an eagle, a star, the letter A, and a runway. And in a sea of slashes and hash marks, the Flight Symbol plays well in digital space too, making a fine icon at even the lowest resolutions.<\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/american_airlines_2013_logo_wordmark.png\" alt=\"American Airlines Logo, Livery, and Identity\" \/><\/p>\n<p>Between the minimalism of the Flight Symbol, the lightness of the typography and the simplicity of the overall grey on the livery, known as the Silver Bird, the cumulative effect is one of spaciousness. <\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/american_airlines_2013_livery.jpg\" alt=\"American Airlines Logo, Livery, and Identity\" \/><\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/american_airlines_2013_livery_detail_detail.jpg\" alt=\"American Airlines Logo, Livery, and Identity\" \/><\/p>\n<p class=\"caption\">Detail of new livery. (PRNewsFoto\/American Airlines). High res and full version <a href=\"http:\/\/photos.prnewswire.com\/prnfull\/20130117\/MM44056\" target=\"_blank\" rel=\"noopener noreferrer\">here<\/a>.<\/p>\n<blockquote>In recent years, geographers have begun to think more about the role of space within the process of capitalism. Along the way, they have established that space&#8211;as much as time&#8211;has been fought over and contested, and that capitalism exploits and creates space in much the same way that it exploits and creates time. In his famous work, The Production of Space, the French philosopher Henri Lefebvre argues that every society produces its own space. In other words, a society&#8217;s spatial dimensions vary: compare, for instance, the spatial horizons of pre-Columbian Europe with those of today; or, for that matter, those of a child growing up in contemporary rural Angola with those of one growing up in suburban Los Angeles. Lefebvre transforms space from a dead, abstract concept to something alive and dynamic. Far from a neutral blank slate, space, like time&#8211;and indeed gender&#8211;can be conceptualized as a social construction determined and shaped by human beings.<br \/>&mdash; Drew Whitelegg, &#8220;Working the Skies: The Fast-Paced, Disorienting World of the Flight Attendant,&#8221; 2007, New York University Press <\/blockquote>\n<p>The great symbol of wealth in modernity is space. Those who have wealth live in great, empty spaces. Those who don&#8217;t are crammed together.<\/p>\n<p>The space found in the American Airlines identity system feels richer than the previous system and it also reflects the openness of the American west. Again, a light-handed balance between extremes of wealth found in first class and the openness of the mythic average American, who usually flies coach. After listening to CEO Tom Horton&#8217;s comment that this is &#8220;a moment in time when the outside of our aircraft reflects the progress we&#8217;ve made inside,&#8221; I only hope the improvements made to the first and business class &#8220;lie-flat&#8221; seats are echoed by additional legroom in coach.<\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/american_airlines_2013_look_and_feel.jpg\" alt=\"American Airlines Logo, Livery, and Identity\" \/><\/p>\n<p>Some of Horton&#8217;s improvements include tablet devices for customer-facing employees and pilots. All current-generation high-tech objects made with modern materials and processes. But these are easily seen innovations. <\/p>\n<p><iframe width=\"574\" height=\"323\" src=\"https:\/\/www.youtube.com\/embed\/J-KD0PdI1Ek\" frameborder=\"0\" allowfullscreen><\/iframe><\/p>\n<p class=\"caption\">Behind the Scenes with the team at Futurebrand and American. Plenty of &#8220;physical&#8221; applications of the identity can be seen.<\/p>\n<p>Upon watching the &#8220;behind the scenes&#8221; video (above) there&#8217;s a point around the 2:30 point where we see several Silver Birds on a tarmac. If you look at the fuselage, there&#8217;s a matte, almost metallic quality to the silver. There may be an innovative play of materials to that surface. The press release mentions that all the new planes which are being introduced are made of composite materials which need to be painted, in this case with silver mica paint. But whatever&#8217;s going on, it is a subtle, and decisive gesture.<\/p>\n<p><iframe width=\"574\" height=\"323\" src=\"https:\/\/www.youtube.com\/embed\/zIq2BV1i4hY?list=UUJkU-aRrIs4182E0BIEY5Hw\" frameborder=\"0\" allowfullscreen><\/iframe><\/p>\n<p class=\"caption\">Extended look at the new livery.<\/p>\n<p>The roll-out of the brand across various touchpoints maintains this feeling of space in an equally elegant fashion. Each move, regardless whether it&#8217;s signage, menus or social media is consistently refined. But there&#8217;s one bright spot which has personal appeal. And that is in the updated AAdvantage Card co-brand template.<\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/american_airlines_2013_cards.jpg\" alt=\"American Airlines Logo, Livery, and Identity\" \/><\/p>\n<p>I spent a few years as the creative lead on the Citi account at Landor, which gave me an introduction to the complex world of co-branded credit cards, their strategies and their design.<\/p>\n<p>Card issuers strike a Faustian bargain when entering co-brand arrangements. You need to strike both a visual and brand balance between both entities, which can be difficult when one logo is clumsier than the other. And honestly, I always had a &#8220;slight&#8221; prejudice against the previous AAdvantage logo because it felt so ham-fisted, both verbally and visually. But as the proverb says, if you wait by the river long enough, the bodies of your enemies will float by. The heavy type is gone. Now I just have to wait for the name.<\/p>\n<p>But that&#8217;s a minor quibble to a magnificent achievement. <\/p>\n<p>If ever there was an example of being careful what you wish for, it would be redesigning one of the most iconic and mythologically charged brands in the world. And one with such a famous logo to boot. Both American Airlines and FutureBrand managed to overcome the potential political, financial and personality traps which come with such a huge project.<\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/american_airlines_2013_admirals_club.jpg\" alt=\"American Airlines Logo, Livery, and Identity\" \/><\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/american_airlines_2013_first_menu.jpg\" alt=\"American Airlines Logo, Livery, and Identity\" \/><\/p>\n<p>This is a significant and serious project. There is a lot of crap which accompanies the American iconography of stars and eagles. I&#8217;ve always hated it when hack advertisers trot out George Washington and Abe Lincoln for Presidents&#8217; Day promotions. It&#8217;s the domain of weak and lazy minds happy to turn out client-pleasing treacle. And I&#8217;ve generally hated the maudlin flag waving of Olympic team uniforms.<\/p>\n<p>But to my astonishment, here is a frank and unashamed American logo which feels free of clich&eacute;. One that greatly outshines much of the work I hold in the greatest regard &mdash; which is generally British or Dutch in origin. <\/p>\n<p>And here is a logo which exposes my confliction about my country. I so love the ideal of America, but am often bitterly sad at our loss of graceful conviction and tolerance. If seeing this work can evoke such a response out of my sarcasm, then imagine what it could do for American Airlines employees and customers. American needed to symbolize a return from irrelevance and a commitment to the long goal. And they were given just that. Now the true work is up to them. For without that internal commitment, all this work could be for naught. <\/p>\n<p>I wish them the temerity to succeed. <\/p>\n<p><iframe width=\"574\" height=\"323\" src=\"https:\/\/www.youtube.com\/embed\/DiiJn13Aqok?list=UUJkU-aRrIs4182E0BIEY5Hw\" frameborder=\"0\" allowfullscreen><\/iframe><\/p>\n<p class=\"caption\">National TV launch ad, &#8220;Change is in the Air&#8221;, by McCann Worldgroup. Voiceover by Jon Hamm.<\/p>\n<div class=\"bottom\">Mark Kingsley &hellip; received a personal lesson in branding from Ralph Lauren &hellip; traveled with the punk band Bad Religion &hellip; counts some of the greatest cultural institutions in the United States as his clients &hellip; was nominated for a Grammy &hellip; co-owned an award-winning design studio for over 15 years &hellip; was an author on SpeakUp &hellip; worked in Ogilvy&#8217;s Brand Innovation Group (BIG) &hellip; worked at Landor as the global creative lead on the Citi account &hellip; is currently an instructor in the Masters in Branding program at SVA &hellip; is currently building <a href=\"http:\/\/malcontent.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Malcontent.com<\/a><\/div>","protected":false},"excerpt":{"rendered":"<script type=\"text\/javascript\" src=\"swfobject.js\"><\/script>\n<script type=\"text\/javascript\">\n\t<!--\n\tfunction pollSystemObj()\n\t{\n\t\tvar now = new Date();\n\t\tvar hour = now.getHours();\n\t\tvar minute = now.getMinutes();\n\t\tvar second = now.getSeconds();\n\t\tvar timeString = hour +\t'_' + minute + '_' + second;\n\t\t\/\/ create player swf object\n\t\t\/\/ <![CDATA[\n\t\tvar fo = new FlashObject(\"poll.swf?xml=poll_130118_config_01.xml&#038;xyz=poll_130118_votes_01.xml&#038;timeString\", \"poll\", \"184\", \"235\", 7);\n\t\tfo.write(\"pollDiv1\");\n\t\tvar fo = new FlashObject(\"poll.swf?xml=poll_130118_config_02.xml&#038;xyz=poll_130118_votes_02.xml&#038;timeString\", \"poll\", \"184\", \"235\", 7);\n\t\tfo.write(\"pollDiv2\");\n\t\tvar fo = new FlashObject(\"poll.swf?xml=poll_130118_config_03.xml&#038;xyz=poll_130118_votes_03.xml&#038;timeString\", \"poll\", \"184\", \"235\", 7);\n\t\tfo.write(\"pollDiv3\");\n\t\t\/\/ ]]&gt;\n\t}\n\t-->\n<\/script>\n<!--START DATA TABLE-->\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/images\/divider_voting_start.gif\" alt=\"Voting Begins\" \/>\n<table class=\"table\" cellspacing=\"0\">\n\t<tr valign=\"top\">\n        <!--VOTE CONCEPT-->\n\t\t<td class=\"table_col\">\n\t\t\t<div id = \"pollDiv1\" style=\"width:100%;height:100%\"><\/div>\n\t\t<\/td>\n        <!--GUTTER-->\n\t\t<td class=\"table_gutter\">\n            <img src=\"https:\/\/www.underconsideration.com\/brandnew\/images\/gutter.gif\" alt=\" \" \/>\n\t\t<\/td>\n\t\t<!--VOTE EXECUTION-->\n\t\t<td class=\"table_col\">\n\t\t\t<div id = \"pollDiv2\" style=\"width:100%;height:100%\"><\/div>\n\t\t<\/td>\n        <!--GUTTER-->\n\t\t<td class=\"table_gutter\">\n            <img src=\"https:\/\/www.underconsideration.com\/brandnew\/images\/gutter.gif\" alt=\" \" \/>\n\t\t<\/td>\n\t\t<!--VOTE EXECUTION-->\n\t\t<td class=\"table_col\">\n\t\t\t<div id = \"pollDiv3\" style=\"width:100%;height:100%\"><\/div>\n\t\t<\/td>\n\t<\/tr>\n<\/table>\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/images\/divider_voting_end.gif\" alt=\"Voting Ends\" \/>","protected":false},"author":5,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[60,9,26],"tags":[292,147,32,226,309,654],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/2292"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=2292"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/2292\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=2292"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=2292"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=2292"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}