{"id":2294,"date":"2013-01-18T10:58:07","date_gmt":"2013-01-18T16:58:07","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/american_airlines_a_second_opinion.php"},"modified":"2013-01-18T10:58:07","modified_gmt":"2013-01-18T16:58:07","slug":"american_airlines_a_second_opinion","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/american_airlines_a_second_opinion.php","title":{"rendered":"American Airlines, a Second Opinion"},"content":{"rendered":"<p>Due to popular demand &mdash; flattered, thanks folks &mdash; and to the reality that it&#8217;s very hard to hold back my opinion on such a significant redesign I feel both the need and urge to provide a second opinion to Mark Kingsley&#8217;s <a href=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/my_kind_of_american_exceptionalism.php\" target=\"_blank\" rel=\"noopener noreferrer\">refreshingly optimistic view<\/a> of the American Airlines identity. Although by no means I share his same enthusiasm or praise for the work I will preemptively state that I do not feel this is the design crime deserving of capital punishment that many designers were either expecting or have made it out to be. In few words: it could have been worse. In far more words: read on.<\/p><!--more--><p>I&#8217;m as much a fan of Massimo Vignelli as anyone and I believe in what he stands for and appreciate the strictness and spareness with which he and his Unimark brethren approached identity design but, let&#8217;s face it, that approach holds little value post-2010 and, graphically, things are starting to look dated. Whether you like it or not the clients commissioning large identity projects and the consumers paying for the service or product these companies represent do not care about the neutrality of Helvetica or the equity of a specific drawing of an eagle. Clients and consumers want things that look like they were designed today, not 40 years ago. The American Airlines logo last updated by Vignelli in 1968 looks exactly like a logo and identity designed in 196fucking8. That&#8217;s a very, very, very long time ago. Aesthetic values have changed and so have expectations of what things should look and feel like. This is not me trying to make an excuse for the shitstorm of gradient-, shadow-, and bevel-based logos that we&#8217;ve seen rain down on us at a large, corporate scale since 2003 when the same firm that redesigned American Airlines redesigned UPS. I hate to say it but can you really imagine Paul Rand&#8217;s UPS logo still used today? It would be anachronistic. I still relish the identities that can communicate without the need for unnecessary patinas like Fiji Airways and Starbucks. They give me hope that it&#8217;s still possible to communicate in simple ways. But as I have been saying for the past five years or so, this new, highly polished aesthetic is the direction we are headed and we have to move beyond our preconceptions and accept those logos and identities that make appropriate use of it. American Airlines&#8217; new &#8220;Flight Symbol&#8221; is one of them.<\/p>\n<p>I genuinely think there is merit to the icon. It&#8217;s an interesting abstraction of an eagle in full flight &mdash; as opposed to the old eagle which looked as if it were landing or going in to grab an armadillo off the road &mdash; and it also looks like an airplane&#8217;s wing. The &#8220;A&#8221; and star referenced in the press release are a stretch, but I can see them if I squint. This is far from my favorite icon of all time but I don&#8217;t think it&#8217;s as bad as people want it to be simply because it replaces an icon that history books have told us is great. My main concern would be that the new icon resembles <a href=\"http:\/\/www.airfrance.us\/\" target=\"_blank\" rel=\"noopener noreferrer\">Air France<\/a> and to a (much) lesser degree <a href=\"http:\/\/www.britishairways.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">British Airways<\/a> in the sense that all three are a single, diagonal-wave-ish stroke. But to play my own devil advocate these two iconic airline brands serve as travel ambassadors for their respective countries and, perhaps, American Airlines could one day stand in that same role. Doubtful. But stranger things have happened.<\/p>\n<p>The bigger tragedy in this redesign is the typography that accompanies the icon. It looks like an Adobe InDesign document that couldn&#8217;t load the fonts. At best it looks like a default system font and at worst like a pedestrian attempt at corporate typography. Those &#8220;e&#8221;s and &#8220;c&#8221; just kill me. There is something really annoying about them. It&#8217;s probably just a matter of personal taste.<\/p>\n<p>The livery has gotten a lot of discussion with the most active complaint being the tail and its overly American design. Guess what, folks? It&#8217;s AMERICAN Airlines. If they want to wave the American flag in your face and blow your nose with it they are the one airline that can do it and have a damn good excuse for it. I actually like it because it&#8217;s an interesting abstraction of the flag&#8217;s stripes and gives the airline a bolder visual device to be recognized by. Perhaps it will be used more in print collateral or advertising. It has potential. My own critique on the livery is that the icon becomes very hard to read with the head of the eagle disappearing into the fuselage, a problem enhanced by the relatively small size of the icon vis-&agrave;-vis the size of the plane.<\/p>\n<p>Overall, this is an appropriate evolution. It&#8217;s not terrible, it&#8217;s not great. It was needed. And Futurebrand delivered within what I can guess was only an extremely demanding and high stakes context.<\/p>\n<p>Comments on this post are closed. Please refer to the <a href=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/my_kind_of_american_exceptionalism.php\" target=\"_blank\" rel=\"noopener noreferrer\">main American Airlines post for discussion<\/a>.<\/p>","protected":false},"excerpt":{"rendered":"<img src=\"https:\/\/www.underconsideration.com\/brandnew\/images\/excerpt_empty.gif\" alt=\"Excerpt Empty\" \/>","protected":false},"author":1,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[60,9,26],"tags":[],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/2294"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=2294"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/2294\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=2294"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=2294"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=2294"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}