{"id":2555,"date":"2013-07-01T07:30:03","date_gmt":"2013-07-01T12:30:03","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/brand_new_the_build_is_complete.php"},"modified":"2013-07-01T07:30:03","modified_gmt":"2013-07-01T12:30:03","slug":"brand_new_the_build_is_complete","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/brand_new_the_build_is_complete.php","title":{"rendered":"Brand New: The Build is Complete"},"content":{"rendered":"<p>Welcome to the new and (presumably) improved Brand New! Over the past five months &mdash; on and off depending on other projects &mdash; I have been gnawing at this reboot which has, more often than not, kicked my ass and is definitely one of the hardest websites I have built and implemented through Movable Type. The result might look &#8220;simple&#8221; so you&#8217;ll have to trust me that the mechanisms behind it are complex and built with sweat and tears. So, what&#8217;s new?<\/p>\n<p><strong>Responsive Design<\/strong><br \/>This was one of the main challenges, getting the site to look nice and balanced across different screen sizes. There are a couple details that are not perfect but this thing is responsive and it kicks ass in doing so.<\/p>\n<p><strong>3-tiered Content<\/strong><br \/>The main driver for the redesign was wanting to establish a better hierarchy between the content we generate. Now there are three main sections: <br \/>\n<a href=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/column\/reviewed\/\">Reviewed<\/a>, with full stories and opinions.<br \/>\n<a href=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/column\/noted\/\">Noted<\/a>, with the basic facts and minimal opinion. (Replaces &#8220;B-Sides&#8221;).<br \/>\n<a href=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/column\/linked\/\">Linked<\/a>, with minor descriptions to outside sources. (Replaces and improves &#8220;In Brief&#8221;).<\/p>\n<p><strong>Typography<\/strong><br \/> Finally got rid of Arial. In its place, a modestly better type family from a sort of well known type foundry: <a href=\"http:\/\/www.typography.com\/fonts\/font_overview.php\" target=\"_blank\" rel=\"noopener noreferrer\">Ideal Sans by Hoefler &amp; Frere-Jones<\/a>. Obviously, that&#8217;s sarcasm. I am ecstatic to be using such a beautiful type family and delighted that H&amp;F-J have let us jump early on their upcoming web font service. In a supporting role, we&#8217;ve cast <a href=\"http:\/\/www.typography.com\/fonts\/font_overview.php?productLineID=100034&#038;path=head\" target=\"_blank\" rel=\"noopener noreferrer\">Sentinel<\/a> for quotes and captions.<\/p>\n<p><strong>Poll (with one small bug)<\/strong><br \/> The polls are now functional in mobile devices. Previously they were Flash-based so iOS didn&#8217;t render them. The poll box is &#8220;sticky&#8221; meaning it will follow you as you scroll. When resizing the window to iPad size, the poll moves under the post. BUG: If your browser is narrow and then you widen it, the poll will not be sticky. For now, I will let it be like this and if it becomes a nuisance for many, I&#8217;ll try to fix it. Also, don&#8217;t go crazy with narrowing and widening the browser because it will break the poll box&#8217;s position.<\/p>\n<p><strong>Transition<\/strong><br \/>Right now, the home page will look odd as we only have a few posts published in the new structure and it&#8217;s retrofitting old posts into the new look &mdash; the last Friday Likes and last B-Side (now Noted) are in the new structure so that you can see how those shape out. Additionally, some posts will not be showing correctly in the archives (mainly you will not see a thumbnail image) we are in the process of generating all these thumbnail images by hand, and there is over 2,000 entries. We also have to assign them to the proper &#8220;column&#8221; and right now the main problem are the old entries that would now fall under &#8220;Review&#8221;, we also have to manually update all of them. All entries should be up and running soon.<\/p>\n<p><strong>Posts Previous to New Design<\/strong><br \/> All posts created up until this relaunch will not be retrofitted to meet the new design, so images will not resize and will more often than not appear to be too small for the layout. Flash polls and results will be maintained and accessible. So just caught them some slack.<\/p>\n<p><strong>RSS Feed<\/strong><br \/> There will be a single RSS feed now, with all the content. No more breaking apart. So Reviewed, Noted, and Linked streams will all come in. So just make sure you have the main feed <a href=\"http:\/\/feeds.feedburner.com\/ucllc\/brandnew\">link<\/a>.<\/p>\n<p><strong>Social Media and Whatnot<\/strong><br \/> We&#8217;ve gotten many requests for a dedicated Facebook page. <a href=\"https:\/\/www.facebook.com\/BrandNewByUCllc\" target=\"_blank\" rel=\"noopener noreferrer\">So here it is<\/a>. Our main @UCllc Twitter remains and there is also a link in the top nav to go to our Pinterest board of Brand New highlights.<\/p>\n<p><strong>Post Titles<\/strong><br \/> This may seem like a weird and repetitive thing (I&#8217;ll explain) but from now on the titles of the posts will be &#8220;New logo and identity by XXX for XXX&#8221; or &#8220;New logo and packaging by XXX for XXX&#8221; because I have found that even though we are the most visited site on logo changes, we rarely come up in the top five Google search results for queries like &#8220;New Whatever Logo&#8221; because my titles are always some cheap pun or non-descriptive text, so they don&#8217;t generate the best search engine results. I did add a sub-title field so I can keep my puns coming.<\/p>\n<p><strong>Job Board<\/strong><br \/> We&#8217;ve under-promoted and under-used our partnership with Coroflot and their amazing job board. That changes. In the Linked column we will post (giving them more exposure) any new jobs posted through Brand New and the listing of the latest five jobs will always be in the dark box at the end of each post. Plus, Coroflot has redesigned their job board listings for partners and it looks\/works awesome. Check it out <a href=\"https:\/\/www.underconsideration.com\/brandnew\/job-board.php\">here<\/a>.<\/p>\n<p><strong>Awards and Conference Updates<\/strong><br \/> In the same dark box, we will be putting the latest status of the Brand New Awards and Brand New Conference so that you always know what&#8217;s going on or coming up. We will still post announcements that will show up in the Reviewed column.<\/p>\n<p class=\"end\"><strong>That&#8217;s it<\/strong><br \/>Hope you enjoy the new site. Feedback is always welcome. I try to accommodate all useful requests. And thanks for your continued readership.<\/p>\n<p class=\"gray_60\">Opening image: The Robert Runyon Photograph Collection, [image number 00199], courtesy of The Center for American History, The University of Texas at Austin. From the <a href=\"http:\/\/memory.loc.gov\/\" target=\"_blank\" rel=\"noopener noreferrer\">Library of Congress<\/a>.<\/p>","protected":false},"excerpt":{"rendered":"Welcome to the new and (presumably) improved Brand New! Over the past five months &mdash; on and off depending on other projects &mdash; I have been gnawing at this reboot which has, more often than not, kicked my ass and&#8230;","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[23],"tags":[],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/2555"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=2555"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/2555\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=2555"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=2555"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=2555"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}