{"id":2584,"date":"2013-07-17T07:30:02","date_gmt":"2013-07-17T12:30:02","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/logos_for_the_2020_summer_olympics_candidate_cities.php"},"modified":"2013-07-17T07:30:02","modified_gmt":"2013-07-17T12:30:02","slug":"logos_for_the_2020_summer_olympics_candidate_cities","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/logos_for_the_2020_summer_olympics_candidate_cities.php","title":{"rendered":"Logos for the 2020 Summer Olympics Candidate Cities"},"content":{"rendered":"<p>The XXXII Olympic Summer Games in 2020 will be hosted by one of three candidate cities: Madrid, Istanbul, or Tokyo, following the 2016 games in Rio De Janeiro. The three candidates were selected by the International Olympic Committee out of a group that also included non-selected applicant cities Baku, Doha, and Rome (which withdrew its bid shortly before the applicant files were due). The International Olympic Committee will elect the host city on 7 September 2013. Here is a look at the logos of each of the hopefuls (and not so hopefuls).<\/p><!--more--><figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/2020_bid_cities_All.png\" alt=\"Logos for the 2020 Summer Olympics Candidate Cities\" \/>\n<\/figure>\n<h1 class=\"red_100 rb_mar_large rb_pad_small rb_5_r100\">2020 Candidate Cities<\/h1>\n<br \/><br \/>\n<p><strong>Madrid \/ Design by <a href=\"http:\/\/www.tapsa.es\" target=\"_Blank\" rel=\"noopener noreferrer\">Tapsa<\/a> and original designed\/concept by: Luis Peiret<\/strong><\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/2020_bid_cities_Madrid.png\" alt=\"Logos for the 2020 Summer Olympics Candidate Cities\" \/>\n<figcaption>Official candidate city logo, redesigned based on Luis Pereit&#8217;s original submission (below).<\/figcaption>\n<\/figure>\n<p>The year 2020 will mark Madrid&#8217;s third consecutive attempt for the summer games&#8211;but this third time is not the aesthetic charm. The final mark, which was released in January of 2012, is the bastardized child of the Spanish Olympic Committee&#8217;s marketing plan to open source the mark design through a national competition. <\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/2020_bid_cities_Madrid_Luis.png\" alt=\"Logos for the 2020 Summer Olympics Candidate Cities\" \/>\n<figcaption>Original design by Luis Pereit, selected as winner from a competition.<\/figcaption>\n<\/figure>\n<p>Luis Peiret&#8217;s playful and abstract representation of the Puerta de Alcala (above) &#8212; in which the five arches of the Puerta de Alcala represent the five continents &#8212; was selected. It was a handsome and strong mark that clearly and strongly stated the personality and fortitude of Spain, but was then heavily modified. The final &#8220;20020&#8221; mark is an example of &#8220;design by committee&#8221; and the failures that come with such additional involvement. The fresh cut to the base of the logo gives a nice crown-like shape to the overall mark; however, this is the only nice thing I have to say. <\/p>\n<p>The legibility of the original &#8220;M20&#8221; script was completely discredited upon manipulation and severely criticized by the country as a whole, being mocked via the Twitter hashtag #Madrid20020. The alterations continued with the removal of the original color gradients&#8211;doing away with black entirely&#8211;switching instead to flat colors and the color purple, thus misrepresenting the five Olympic colors. The final and possibly most embarrassing error was the misspelling of Madrid with the addition of an accent over the &#8220;i.&#8221;<\/p>\n<p>Let this be a clear lesson in the power of intellectual property to young designers and design students: own your work. Thankfully, the Spanish can breathe a sigh of relief since this is just the bid and won&#8217;t represent the final games in &#8220;20020&#8221; if they come to Spain.<\/p>\n<br \/><br \/>\n<p><strong>Istanbul \/ Design by N\/A<\/strong><\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/2020_bid_cities_Istanbul.png\" alt=\"Logos for the 2020 Summer Olympics Candidate Cities\" \/>\n<figcaption>Candidate city logo.<\/figcaption>\n<\/figure>\n<p>This will be Istanbul&#8217;s fifth attempt to bring the Olympic Games to Turkey, having previously submitted four different bids (2000, 2004, 2008, and 2012), two of which have led to Olympic candidacy (2004 and 2008) though ultimately failing to be awarded the Games. <\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/2020_bid_cities_Istanbul_Pattern.png\" alt=\"Logos for the 2020 Summer Olympics Candidate Cities\" \/>\n<figcaption><em>Applicant<\/em> city logo. Confusing, no?!<\/figcaption>\n<\/figure>\n<p>Istanbul was awarded the candidacy to host the 2020 Games in May of 2012, winning this honor thanks to an untraditional &#8220;pattern mark.&#8221; The simply-complicated, mono-weight pattern is a fresh point of view for branding the Games. Its heavily horizontal orientation is something that has never been seen in and Olympian mark&#8211;I appreciate that. The pattern mark had massive potential to expand however with the announcement of Istanbul&#8217;s candidacy, the Turkish IOC released an online vote in which the public can choose between five Tulip marks, each nearly as disappointing as the other.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/2020_bid_cities_Istanbul_Five.png\" alt=\"Logos for the 2020 Summer Olympics Candidate Cities\" \/>\n<figcaption>Logos that were made available for public vote.<\/figcaption>\n<\/figure>\n<p>The final mark that was selected for Istanbul&#8217;s candidacy is a painterly version of a tulip&#8211;a traditional symbol for the city&#8211;that contains elements of Istanbul&#8217;s skyline which revolve around the Maiden&#8217;s Tower. Conceptually, the upper orange portion of the mark not only symbolizes a sunset over the city but also the European side of Istanbul, while the lower potion, which is separated by the Bosporus, represents the Asian side and the city as a whole with traditional turquoise symbolizing Turkish culture&#8211;the turquoise gem having origins in Turkey.<\/p>\n<p>However conceptually sound, the mark&#8217;s aesthetics do not mix well. The paint-like texture of the tulip clashes with the realistic, vector based cityscape. The designer should have limited him\/herself to concentrating on one cohesive look. The mark feels even further disconnected through its accompanying modern and disproportional typeface. The kerning is quite silly and rushed, providing a disappointing base for the mark. <\/p>\n<p>Another mark that was clearly designed and then convoluted by an indecisive committee.<\/p>\n<br \/><br \/>\n<p><strong>Tokyo \/ Design by Ai Shimamine <\/strong><\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/2020_bid_cities_Tokyo.png\" alt=\"Logos for the 2020 Summer Olympics Candidate Cities\" \/>\n<\/figure>\n<p>Tokyo, who hosted one of the most beautifully branded Games in 1964, was selected as a Candidate City for 2020 in September of 2012. Originally considering Hiroshima as the main bid for the 2020 Games, Tokyo was ultimately selected by the Japanese IOC after poor public reaction and funding issues for the first bid.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/2020_bid_cities_Tokyo_Ai.jpg\" alt=\"Logos for the 2020 Summer Olympics Candidate Cities\" \/>\n<\/figure>\n<p>The mark was designed by fourth year student Ai Shimamine, who participated in a design competition to create a logo for Tokyo&#8217;s bid. The circular wreath of cherry blossoms, Japan&#8217;s most celebrated flower, takes the cake for cultivating a happy, peaceful, and comforting feeling (something the other two Candidate Cities don&#8217;t take advantage of), setting Tokyo apart from the playing field. The circular shape symbolizes a sense of eternity; accompanied by the playful cherry blossoms, it further evolves to express the eternal happiness which the Games inspire. Each individual petal within the circular wreath shape of the cherry blossoms represents the interconnectivity and interdependence of the world.<\/p>\n<p>Accompanying the Olympic colors, the design incorporates a traditional Edo period purple, which was used in cultural festivals and events during that time&#8211;a simple and comforting connection back to Japanese heritage. <\/p>\n<p>A mark that is fully thought through to the smallest &#8220;Rising Sun&#8221; detail that divides the type is, hands down, my favorite mark of the three Candidate Cities. It is a reminder that once every four years I become a kid again, full of excitement and hope. Congrats to Ai Shimamine on making her country proud.<\/p>\n<h1 class=\"red_100 rb_mar_large rb_pad_small rb_5_r100\">2020 Non-selected Applicant Cities<\/h1>\n<br \/><br \/>\n<p class=\"ra_marg_large\"><strong>Doha \/ Design by N\/A<\/strong><\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/2020_bid_cities_Doha.png\" alt=\"Logos for the 2020 Summer Olympics Candidate Cities\" \/>\n<\/figure>\n<p>While failing to become a Candidate City for the 2020 Games (in addition to a 2016 attempt), the mark presented by Doha was inspired by the Arabic word for Doha, &#8220;ad-dawha,&#8221; which translates to &#8220;the big tree.&#8221; This is a reference to the prominent tree that stood at the site where the original fishing village arose on the eastern coast of the Qatar peninsula, and it is considered to be a symbol of cultivation.<\/p>\n<p>The Doha Olympic Committee used this inspiration to create an edgy, youthful, and fruitful mark that feels tailored to the sleek, Armani Exchange-ish life that can be had in Qatar. The dark colored trunk of the mark illustrates the region&#8217;s strong historic heritage, while the lively firework-like leaves display the excitement and growth of the city and the Games to come. <\/p>\n<p>The clever addition of purple to the mark, which is the color of the Qatari flag, links the people of Qatar back to this international competition and furthers Qatar&#8217;s presences in the Olympic community&#8211;something that Madrid should learn from.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/2020_bid_cities_Doha_Type.png\" alt=\"Logos for the 2020 Summer Olympics Candidate Cities\" \/>\n<\/figure>\n<p>With that said, I&#8217;m sad to report that the tailored typeface works but is a bit expected. The type as a whole feels like a missed opportunity to play with contrasting shapes and to really let the mark vibrate in a good way. There are only so many tailored curves one mark can handle, and the Doha mark has reached that limit.<\/p>\n<p>Overall, the mark was a move in the right direction, with its simple formal shapes and clever coloring. It is a mark that easily benefits the branding as a whole through its readiness to be dissected into patterns, shapes, and icons to carry the Qatari story from beginning to end. Sadly, the games will pass over Doha in 2020. Here&#8217;s to seeing what handsome mark the Qatar Olympic Committee creates for the 2024 bid.<\/p>\n<br \/><br \/>\n<p><strong>Baku \/ Design by N\/A<\/strong><\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/2020_bid_cities_baku.png\" alt=\"Logos for the 2020 Summer Olympics Candidate Cities\" \/>\n<\/figure>\n<p>Baku, Azerbaijan also participated in bidding for the 2016 Olympics which were ultimately given to Rio de Janeiro. With high hopes, Baku submitted its second bid for the 2020 Games with a beautifully inspired Azerbaijani carpet mark. <\/p>\n<p>Baku&#8217;s mark rallies behind the concept and slogan of &#8220;Together We Can&#8221; and does so in an iconic and sophisticated manner. The weave of the four individual pieces subtly spells out Baku&#8217;s &#8220;dream date&#8221; of 2020 in a Pentagram-like &#8220;ah-ha&#8221; moment. That feeling of surprise, excitement, and discovery illustrates what the games are all about. <\/p>\n<p>The strong, geometric mark embraces subtle and carefully-handled gradients that help diversify the primary colors&#8211;simple yet complicated, in other words&#8211;creating a pleasant and harmonious feel. The neutrality of the mark lets each individual associate his or her own meaning to the mark and in turn creates a stronger bond with the Games in Baku. This is a symbol that any athlete would tattoo on themselves.<\/p>\n<p>Unfortunately, in May of 2012 it was announced that Baku had not been selected as a Candidate City. A shame to see such a handsome mark be washed away.<\/p>\n<br \/><br \/>\n<p><strong>Rome \/ Design by N\/A<\/strong><\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/2020_bid_cities_Rome.png\" alt=\"Logos for the 2020 Summer Olympics Candidate Cities\" \/>\n<\/figure>\n<p>Rome previously hosted the 1960 Summer Games and failed to hold the 2004 Games to Athens in a final round of voting by the IOC. Rome developed a bid for the 2020 Games after being nominated by the Italian National Olympic Committee, but the Italian government withdrew its support from the bid on the eve of the delivery of the application files, stating that it would not be a responsible use of money in &#8220;Italy&#8217;s current condition.&#8221;<\/p>\n<p>The mark that accompanied the failed bid is a simple and awkwardly drawn illustration of the Colosseum that was born out of the conceptual statement: &#8220;A time of history.&#8221; The mark itself feels rushed&#8211;with how the bid ended, I would not be surprised if it was done under several restrictions. The misproportioned mark is neither distorted nor refined enough to look purposeful and and falls into the grey area of an amateur and naive designer. Accompanied with a lackluster color gradient, it is easy to say that this is a blatantly missed opportunity to demonstrate Rome&#8217;s history though a single mark.<\/p>\n<p>Thankfully, Da Vinci won&#8217;t be turning in his grave since Rome&#8217;s bid never saw the light of day.<\/p>","protected":false},"excerpt":{"rendered":"The XXXII Olympic Summer Games in 2020 will be hosted by one of three candidate cities: Madrid, Istanbul, or Tokyo, following the 2016 games in Rio De Janeiro. The three candidates were selected by the International Olympic Committee out of&#8230;","protected":false},"author":12,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[12,26,87],"tags":[543],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/2584"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=2584"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/2584\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=2584"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=2584"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=2584"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}