{"id":2865,"date":"2013-11-27T05:36:37","date_gmt":"2013-11-27T11:36:37","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/new_logo_and_on-air_look_for_revolt.php"},"modified":"2013-11-27T05:36:37","modified_gmt":"2013-11-27T11:36:37","slug":"new_logo_and_on_air_look_for_revolt","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/new_logo_and_on_air_look_for_revolt.php","title":{"rendered":"New Logo and On-air Look for Revolt"},"content":{"rendered":"<p><span class=\"red_100\">Reviewed by Mark Kingsley<\/span><\/p>\n<p>In July of 2010, <a href=\"http:\/\/waters.house.gov\/\" target=\"_blank\" rel=\"noopener noreferrer\">Congresswoman Maxine Waters<\/a> addressed a Congressional Subcommittee hearing held prior to the Comcast-NBC Universal merger. <a href=\"http:\/\/waters.house.gov\/news\/documentsingle.aspx? DocumentID=195961\" target=\"_blank\" rel=\"noopener noreferrer\">She aired concerns<\/a> about the unbalanced diversity of management, programming and advertising positions within both companies. So in response, Comcast-NBC agreed to conditions intended to help rectify the situation.<\/p><!--more--><p>Almost a year later, politicians, media moguls and notable members of the African American glitterati gathered at <a href=\"http:\/\/politic365.com\/ 2012\/03\/08\/pdiddy-magic-comcast-and-congress-celebrate-minority-channels\/\" target=\"_blank\" rel=\"noopener noreferrer\">a Washington press event<\/a> which announced four niche, but minority-owned, channels. In attendance was a certain beneficiary of that development: Mr. Sean Combs.<\/p>\n<figure class=\"quarter\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/revolt_business_combs.jpg\" alt=\"New Logo and On-air Look for Revolt\" \/>\n<figcaption>Congresswoman Maxine Waters with Sean Combs at Washington press event (<a href=\"http:\/\/waters.house.gov\/news\/documentsingle.aspx? DocumentID=195961\" target=\"_blank\" rel=\"noopener noreferrer\">via<\/a>)<\/figcaption>\n<\/figure>\n<p>As his photo-Tweet shows above, Combs attended in his Businessman persona. The one directly opposite of the 1999 persona which had an assault charge, court-ordered anger management sessions, and an incident in a nightclub where shots were fired. There is also a third Combs persona. Opposite of the Businessman, it is the Revolutionary.<\/p>\n<p>Combs has been in rebellion for decades now, but it&#8217;s difficult to figure out exactly what against. After a quick rise at, then abrupt firing from, Uptown Records in 1993, he founded Bad Boy Records. From there, the early success of Bad Boy stars The Notorious B.I.G. &mdash; who Combs discovered while at Uptown &mdash; and Junior M.A.F.I.A. drew market attention from the West Coast-based Death Row label and thus started the well-publicized <a href=\"http:\/\/en.wikipedia.org\/wiki\/East_Coast- West_Coast_hip_hop_rivalry\" target=\"_blank\" rel=\"noopener noreferrer\">East Coast \/ West Coast feud<\/a>.<\/p>\n<p>After The Notorious B.I.G. was killed, Combs rushed to release &#8220;<a href=\"https:\/\/www.youtube.com\/watch?v=mM0-ZU8njdo\" target=\"_blank\" rel=\"noopener noreferrer\">I&#8217;ll Be Missing You<\/a>,&#8221; a tribute to B.I.G.&#8217;s memory based on The Police song &#8220;<a href=\"https:\/\/www.youtube.com\/watch?v=OMOGaugKpzs\" target=\"_blank\" rel=\"noopener noreferrer\">Every Breath You Take<\/a>&#8221; &mdash; which, frankly, isn&#8217;t that much different from the original.<\/p>\n<p>This is only the first of a long string of appropriations that Combs has used to build what he inaccurately calls his brand. Because in practice, this isn&#8217;t a brand, but rather old-fashioned capitalist exploitation. And instead of the exploitation of workers in a classic Marxist-Leninist sense, Combs exploits images.<\/p>\n<p>Rebellion is a frequent theme for Combs: the name of his company (Bad Boy), his appropriation of <a href=\"http:\/\/www.malcontent.com\/hazardous-freedom\/\" target=\"_blank\" rel=\"noopener noreferrer\">the black power salute<\/a>, and now his new music video channel <a href=\"http:\/\/revolt.tv\/\" target=\"_blank\" rel=\"noopener noreferrer\">Revolt<\/a>.<\/p>\n<figure class=\"full\"><div class=\"video-container\"><iframe src=\"https:\/\/www.youtube.com\/embed\/7RrjFBZ1Lhw\" frameborder=\"0\" allowfullscreen><\/iframe><\/div>\n<figcaption>Footage of launch day and party.<\/figcaption>\n<\/figure>\n<p>Contrary to his bluster, there&#8217;s nothing much that is new or revolutionary about Revolt. Unlike MTV, they actually play music videos &mdash; including Jay Z&#8217;s &#8220;Holy Grail,&#8221; which has a few lines most other channels would bleep out. It&#8217;s full of the jumpy editing and fidgety typography which was quite popular about a decade ago. And the interstitials and bumpers feature grainy black and white video, which I assume signals some sort of raw authenticity.<\/p>\n<figure class=\"full\"><div class=\"video-container\"><iframe src=\"https:\/\/www.youtube.com\/embed\/X11LAw5EJL8\" frameborder=\"0\" allowfullscreen><\/iframe><\/div>\n<figcaption>Sean Combs excitedly on his way to sign deal with TimeWarner Cable<\/figcaption>\n<\/figure>\n<p>Combs also seems to have a problem with his problem with authority. Seeing a channel named Revolt upload a video of how it won approval from The Man creates nothing but cognitive dissonance. And Combs is quoted as saying, &#8220;Our bar is extremely high; it&#8217;s highly curated. There are other places artists will be able to get exposure, but when you make it to Revolt you will feel <a href=\"http:\/\/www.usatoday.com\/story\/ life\/tv\/2013\/07\/26\/sean-diddy-combs-revolt-cable-tv-channel-music\/2590201\/\" target=\"_blank\" rel=\"noopener noreferrer\">you&#8217;ve been authorized<\/a>.&#8221;<\/p>\n<p>Revolution, you say? Good thing he&#8217;s got a permit.<\/p>\n<p>The two things that appears the most are Combs himself, speaking about how revolutionary Revolt is, and the logo.<\/p>\n<figure class=\"full\"><div class=\"video-container\"><iframe src=\"\/\/player.vimeo.com\/video\/77575229?portrait=0\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen><\/iframe><\/div>\n<figcaption>The Revolt on-air look and feel is an unfocused suite of effects, messages, boasts, threats and program logos. And cat videos.<\/figcaption>\n<\/figure>\n<p>New York City in the 1980s was an amazing place. The city was recovering from a financial crisis (where it found itself a hair&#8217;s breadth from bankruptcy), widespread arson, the Son of Sam murders, and a major blackout (which was the impetus for a huge looting spree). And in that vacuum, a forgotten downtown Manhattan was transforming itself into a glorious nexus where art, money, sex, class, race and gender collided, and then spun into the most amazing collection of stuff to look at, eat, fuck, dance to, laugh at, think about, argue over, and shake your head at.<\/p>\n<p>Much of the most interesting work on gallery walls in the 80s came from artists associated with the influential &#8220;Pictures&#8221; show, a 1977 group exhibition at Artist&#8217;s Space. The work was post-conceptual, aggressive, usually photo-based, and often concerned with the relation of images to power.<\/p>\n<p>A contemporary of this group was graphic designer-turned-artist Barbara Kruger. Her work layered bold red or black rectangles, with white Futura Bold text, over found black and white photographs &mdash; using graphic design techniques in a criticism of gender politics, consumerism and identity.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/Revolt_02_kruger.jpg\" alt=\"New Logo and On-air Look for Revolt\" \/>\n<figcaption>Works by Barbara Kruger<br \/><br \/>Left: <em>Untitled (&#8220;You construct intricate rituals which allow you to touch the skin of other men&#8221;)<\/em>, 1981<br \/>Center: <em>Untitled (I shop therefore I am)<\/em>, 1987<br \/>Right: <em>Untitled (Your body is a battleground)<\/em>, 1989<\/figcaption>\n<\/figure>\n<p>Over the course of her career, Kruger began creating typographic environments which, while not quite graffiti, had an equally disruptive visual effect.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/Revolt_03_kruger.jpg\" alt=\"New Logo and On-air Look for Revolt\" \/>\n<figcaption><em>Belief+Doubt<\/em> (Installation details), 2012<\/figcaption>\n<\/figure>\n<blockquote>A lot of (Kruger&#8217;s) work was political and feminist in nature, but it also was based on juxtaposing slogans that might not relate to the original intent of an image but ultimately change its meaning. When I first started the Obey campaign, I wanted to borrow Kruger&#8217;s style, not as a direct homage to her but to set something up that was dynamic and made people think that there was a message behind it. The irony was that I didn&#8217;t have a message at all; the lack of a message was part of my idea that people can be manipulated just by a stylistic approach &mdash; style over substance.<\/blockquote><h3>Shepard Fairey, <em>OBEY: Supply &amp; Demand &mdash; The Art of Shepard Fairey &mdash; 20th Anniversary Edition<\/em>; Gingko Press; 2009<\/h3>\n<p>In 1989 Shepard Fairey, an illustration student at the Rhode Island School of Design, printed an image of professional wrestler <a href=\"http:\/\/www.andrethegiant.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Andre the Giant<\/a>, with the absurd claim that he had a posse, on a sticker and began placing it around Providence, RI. By 1994, it had become a popular street symbol and could be seen along the east coast. When Titan Sports, then the parent company of the World Wrestling Foundation, threatened a copyright infringement lawsuit, Fairey adjusted the art. He appropriated Kruger&#8217;s typographic style, the word &#8220;Obey&#8221; from John Carpenter&#8217;s &#8220;They Live,&#8221; and combined them with a simplified image of the Giant.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/Revolt_04_fairey.jpg\" alt=\"New Logo and On-air Look for Revolt\" \/>\n<figcaption>Top: Still from <em>They Live<\/em>, 1988, directed by John Carpenter<br \/>Bottom left: Shepard Fairey, <em>Andre the Giant Has a Posse<\/em>, 1989 <br \/>Bottom right: Shepard Fairey, <em>Obey<\/em>, 1995<\/figcaption>\n<\/figure>\n<blockquote>The Obey icon face evolved at the end of 1995 out of the desire to move further away from the association with Andre the Giant and toward a more universal &#8220;Big Brother&#8221; (as in George Orwell&#8217;s <em>1984<\/em>) image. I had become fascinated by the power of the streamlined graphic approach of the Russian constructivist poster and wanted an icon that would integrate into work of this style. Where before I had been generating propaganda with work having a direct stylistic parallel. The Obey star was created during this period, as well as the Obey red box logo. The concept behind Obey is to provoke people who typically complain about life&#8217;s circumstances but follow the path of least resistance, to have to confront their own obedience. Obey is very sarcastic, a form of reverse psychology.<\/blockquote><h3>Shepard Fairey, <em>OBEY: Supply &amp; Demand &mdash; The Art of Shepard Fairey &mdash; 20th Anniversary Edition<\/em>; Gingko Press; 2009<\/h3>\n<p>Fairey certainly fell into something with the modified Obey direction. By 2001 it was a full-on money-making fashion brand which he justified in claiming the clothing as &#8220;another canvas to spread his art and message to the people.&#8221; Obey allowed Fairey to &#8220;create designs that represent his influences, ideals and philosophy&hellip; with biting sarcasm verging on reverse psychology&hellip; goad(ing) viewers, using the imperative &#8216;obey,&#8217; to take heed of the <a href=\"http:\/\/www.obeyclothing.com\/about\/\" target=\"_blank\" rel=\"noopener noreferrer\">propagandists out to bend the world to their agendas<\/a>.&#8221;<\/p>\n<p>Wow. Certainly a lot to be expressed when buying a denim work shirt.<\/p>\n<p>While Fairey was producing his first Andre the Giant sticker, James Jebbia, a manager at the flagship <a href=\"http:\/\/parachuteworld.com\/americas.html\" target=\"_blank\" rel=\"noopener noreferrer\">Parachute<\/a> store in Soho began developing a merchandise line in a nearby open-air market. The proceeds from that afforded a small boutique on Spring Street in Soho, called Union, which quickly became a center for skaters and other street culture. Two years later, Jebbia and the California surfing entrepreneur Sean St&uuml;ssy opened the first St&uuml;ssy shop in New York. Once St&uuml;ssy left the company in 1994, Jebbia moved on to open Supreme.<\/p>\n<p>Supreme began as a skate shop. You could get a new deck and other equipment, and perhaps buy a t-shirt. Soon enough, other merchandise, including limited-edition decks and sneakers, began to take over more and more space. Now, it&#8217;s a huge business with two shops in the States, one in London and six across Japan. And that growth has been both tempered and fueled by an obsessive focus on their brand and customers.<\/p>\n<p>Supreme has always maintained a healthy disrespect towards authority figures, whether it be something amorphous like proper office wear, or competitors like Nike. And they&#8217;re not above using and repurposing someone else&#8217;s graphics. Like perhaps, Nike. Or Andre Courr&egrave;ges. Or Barbara Kruger.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/Revolt_05_supreme.jpg\" alt=\"New Logo and On-air Look for Revolt\" \/>\n<figcaption>Top left: <em>Fuck Nike<\/em>, limited-edition t-shirt<br \/>Top right: Early Supreme logo based on Courr&egrave;ges typography<br \/>Bottom: Supreme logo, attributed to James Jebbia<\/figcaption>\n<\/figure>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/Revolt_06_richardson_supreme.jpg\" alt=\"New Logo and On-air Look for Revolt\" \/>\n<figcaption>Supreme campaign, Terry Richardson, photographer<br \/>Models: Kermit the Frog, Lady Gaga, Rosa Acosta, Sean Combs<\/figcaption>\n<\/figure>\n<p>Supreme&#8217;s wild posting campaigns in New York are usually a fun distraction. They are an inflammatory stew of juvenilia, street chic and boobies. More so when shot by photo\/ porno-grapher Terry Richardson.<\/p>\n<p>And this is where the story comes full circle. Because Combs managed to have himself featured in the catalog which accompanied the <em><a href=\"http:\/\/sneakhype.com\/art\/2009\/12\/supreme-x-diddy-x-terry-richardson-vashtie-kola.html\" target=\"_blank\" rel=\"noopener noreferrer\">Richardson campaign<\/a><\/em>. All the lipstick traces from Kruger to Fairey to Supreme to Revolt line up in a neat progression of influences.<\/p>\n<p>Now to be fair, Barbara Kruger cannot claim to have invented sans serif type dropped out of a red band. But she did take the urgency of something like the Exit sign and dial up the anger. And in doing so, she transformed the most banal images into an art more revolutionary than anything Fairey or Combs&#8217; egos could ever dream.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/Revolt_07_colgate.jpg\" alt=\"New Logo and On-air Look for Revolt\" \/>\n<figcaption>Colgate toothpaste packaging from 1968, Marvel Comics logo, New York City Subway signage<\/figcaption>\n<\/figure>\n<p>Frankly, after so many years of narcissistic posturing while dressed in revolutionary drag &mdash; without much to show for it other than a respectable fortune &mdash; it&#8217;s painfully clear that the one thing that Combs is revolting against is obscurity.<\/p>\n<p>Combs&#8217; need for relevance has become his prison. He wants to be both prophet of rebellion and hip-hop Medici. But by its very definition, <a href=\"http:\/\/www.tmz.com\/2013\/10\/07\/sean-diddy-combs-kylie-jenner-lil-twist-christian-combs-tv-network-revolt\/\" target=\"_blank\" rel=\"noopener noreferrer\">one cannot be<\/a> establishment and anti-establishment. At least the Medicis gave us a few popes, scientific innovation, and some of the greatest art and architecture in Western history.<\/p>\n<p>Which is a long way off from a basic-cable music video channel that dares&hellip; <strong>Dares!<\/strong> &hellip; to air unedited Jay-Z videos in the middle of the night. Yes, if you stay up late enough you just might hear <a href=\"http:\/\/therapinsider.com\/2013\/11\/06\/rapper-jay-z-found-dead-inside-at-43\/\" target=\"_blank\" rel=\"noopener noreferrer\">the empty<\/a> Mr. Carter say &#8220;fuck.&#8221; Many times.<\/p>\n<p class=\"end\">How revolutionary.<\/p>\n<p class=\"gray_60\">Mark Kingsley &hellip; received a personal lesson in branding from Ralph Lauren &hellip; traveled with the punk band Bad Religion &hellip; counts some of the greatest cultural institutions in the united states as his clients &hellip; was nominated for a Grammy &hellip; co-owned an awardwinning design studio for over 15 years &hellip; was an author on Speakup &hellip; worked in Ogilvy&#8217;s Brand Innovation Group (BIG) &hellip; worked at Landor as the Global Creative Lead on the Citi account &hellip; is currently an instructor in The Masters In Branding Program at SVA &hellip; can be found at <a href=\"http:\/\/www.malcontent.com\" target=\"_blank\" class=\"underline gray_50_to_red_50\" rel=\"noopener noreferrer\">Malcontent<\/a><\/p>","protected":false},"excerpt":{"rendered":"Reviewed by Mark Kingsley In July of 2010, Congresswoman Maxine Waters addressed a Congressional Subcommittee hearing held prior to the Comcast-NBC Universal merger. She aired concerns about the unbalanced diversity of management, programming and advertising positions within both companies. So&#8230;","protected":false},"author":5,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[66,12,26],"tags":[290,309,42,446],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/2865"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=2865"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/2865\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=2865"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=2865"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=2865"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}