{"id":2985,"date":"2014-02-04T05:48:16","date_gmt":"2014-02-04T11:48:16","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/new_logo_and_identity_for_adc_by_sid_lee.php"},"modified":"2014-02-04T05:48:16","modified_gmt":"2014-02-04T11:48:16","slug":"new_logo_and_identity_for_adc_by_sid_lee","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/new_logo_and_identity_for_adc_by_sid_lee.php","title":{"rendered":"New Logo and Identity for ADC by Sid Lee"},"content":{"rendered":"<p><span class=\"red_100\">Reviewed by Joe Marianek<\/span><\/p>\n<p><a href=\"http:\/\/www.adcglobal.org\" target=\"_blank\" rel=\"noopener noreferrer\">The Art Directors Club<\/a> (ADC) is a 94 year-old professional design and advertising organization based in New York City. Throughout the last year, the ADC has slowly unveiled various components of their new identity which includes a new monogram, colors, typography, grids and a custom typeface, among other things. A landing page of the site describes the additional changes to come, and more significantly suggests that the ADC is poised to launch a completely re-designed website in the coming weeks.<\/p><!--more--><p>The ADC was founded in 1920 by Louis Pedlar, who &#8220;brought his colleagues in advertising together &hellip; to dignify their profession and judge advertising art by the same stringent standards as fine art.&#8221; The first ADC logo featured a graphic interpretation of <a href=\"http:\/\/www.metmuseum.org\/toah\/hd\/durr\/hd_durr.htm\" target=\"_blank\" rel=\"noopener noreferrer\">Albrecht D&uuml;rer<\/a>&#8216;s signature. Al is considered to be one of the first high profile commercial artists and his initials are also conveniently the acronym of the club. Get it? The <a href=\"http:\/\/www.adcglobal.org\/adc\/history\/\" target=\"_blank\" rel=\"noopener noreferrer\">elaborate history<\/a> of the ADC is populated by colorful figures ranging from James Victore to Salvador Dali, and the organization has kept company with some of the top firms in advertising and design. The ADC hosts highly successful programs competitions such as the <a href=\"http:\/\/www.adcglobal.org\/awards\/\" target=\"_blank\" rel=\"noopener noreferrer\">Annual Awards<\/a> and <a href=\"http:\/\/www.adcglobal.org\/awards\/yg\/\" target=\"_blank\" rel=\"noopener noreferrer\">Young Guns<\/a>, but they also feature benevolent programming such as the <a href=\"http:\/\/www.adcglobal.org\/education\/portfolio\/\" target=\"_blank\" rel=\"noopener noreferrer\">National Student Portfolio Reviews<\/a> and <a href=\"http:\/\/www.adcglobal.org\/education\/highschool\/workshops\/\" target=\"_blank\" rel=\"noopener noreferrer\">Saturday Career Workshops<\/a>. They also have a <a href=\"http:\/\/www.adcglobal.org\/awards\/hof\/\" target=\"_blank\" rel=\"noopener noreferrer\">Hall of Fame<\/a> and some <a href=\"http:\/\/www.adcglobal.org\/awards\/grandmasters\/\" target=\"_blank\" rel=\"noopener noreferrer\">GrandMasters<\/a> (a scary title). The ADC aims to have an increasingly global presence and impact, as I have recently received emails from them asking me to travel to Miami for the <a href=\"http:\/\/adcawards.org\/festival\/\" target=\"_blank\" rel=\"noopener noreferrer\">ADC Festival of Art and Craft<\/a>. And every time I walk by their space on 29th street, I see evidence of life: beanbag chairs laying around a lectern in the gigantic event space, some intriguing show of fresh work on the walls, or the remnants of last night&#8217;s foosball championship.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/adc_2014_been_there_durer_that.jpg\" alt=\"New Logo and Identity for ADC by Sid Lee\" \/>\n<figcaption>Al and his logo.<\/figcaption>\n<\/figure>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/adc_2014_xyz.png\" alt=\"New Logo and Identity for ADC by Sid Lee\" \/>\n<figcaption>ADC is as easy as XYZ.<\/figcaption>\n<\/figure>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/adc_2014_letterhead_render.jpg\" alt=\"New Logo and Identity for ADC by Sid Lee\" \/>\n<figcaption>A press release design concept.<\/figcaption>\n<\/figure>\n<p>In a letter on the landing page of the <a href=\"http:\/\/www.adcglobal.org\/\" target=\"_blank\" rel=\"noopener noreferrer\">interim website<\/a>, ADC President Ignacio Oreamuno cuts to the chase and clarifies almost everything that is to come. Here&#8217;s my takeaway summary:<br \/>\n1. The club is being rebuilt with a focus on its roots.<br \/>\n2. Never say the words &#8220;Art Directors Club&#8221; again. It&#8217;s &#8220;ADC,&#8221; period.<br \/>\n3. The new logo is a modern interpretation of Albrecht D&uuml;rer&#8217;s signature (and of the old logos).<br \/>\n4. Creative professionals of the world, unite. Titles, roles and agency definitions are old guard.<br \/>\n5. The future has arrived. It&#8217;s gold, silver, and well-crafted.<\/p>\n<p>Ignacio&#8217;s letter reads as a rallying cry with assertions such as, &#8220;We plan to continue to do more than any other international organization to help the creative industries pave the way boldly into the future. This is not a three-year plan, it&#8217;s a now plan, and one we will execute across the world on every continent.&#8221; This charged and borderline-totalitarian tone cannot be ignored.<\/p>\n<figure class=\"quarter\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/adc_2014_logo_history.jpg\" alt=\"New Logo and Identity for ADC by Sid Lee\" \/>\n<figcaption>An incongruous history of ADC logos.<\/figcaption>\n<\/figure>\n<p>The previous identity &mdash; designed by <a href=\"http:\/\/www.trollback.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Trollb&auml;ck<\/a> was launched less than five years ago &mdash; and was <a href=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/artdirectorsclubnewlogo.php\" target=\"_blank\" rel=\"noopener noreferrer\">>reviewed by Armin<\/a> here on Brand New, where it inspired a lot of dialogue and was subsequently illuminated with <a href=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/follow-up_art_directors_club.php\" target=\"_blank\" rel=\"noopener noreferrer\">additional insights<\/a> from Trollb&auml;ck. The new identity is a complete departure from the candy colors of yore, and signals a return to tight craft. Designed by <a href=\"http:\/\/sidlee.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Sid Lee<\/a>, the new identity falls neatly in line with the family of ADC monograms that have existed in various forms since 1920. Its closest cousin is the crisp 2002 monogram by Paula Scher (bottom row, middle logo in image above), which adds a C below the A and D. The new monogram is an update of Scher&#8217;s logo, and anticipates further usage beyond a business card, letterhead, and banner. By collecting the A and D into a C forms a compact asset, the logo can travel online and fit neatly into the various squares of social media bio pics. My only issue with the monogram &mdash; a minor one &mdash; is that it has been softened slightly with curves placed arbitrarily on certain corners. This formal dissonance might be intended to signal &#8220;age&#8221; but it seems unnecessary. A clean and jazzy Geometric Sans-Serif typeface was developed for supporting materials and program names. The identity uses a classic palette of metallic and glitter colors: white, black, gold, bronze, silver. One thing that I particularly love about the system is that it appears to employ a tightly crafted Art Deco-inspired grid that can be used and reinterpreted by other designers. In the right hands, this amazing set of tools could inspire a lot of great work. At its best, it&#8217;s an identity that looks to the best parts of the past without being kitsch, and would fit neatly into the world of <a href=\"http:\/\/www.amazon.com\/The-Great-Gatsby-Scott-Fitzgerald\/dp\/0743273567\" target=\"_blank\" rel=\"noopener noreferrer\">Jay Gatsby<\/a>.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/adc_2014_logo_grid.png\" alt=\"New Logo and Identity for ADC by Sid Lee\" \/>\n<hr \/>\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/adc_2014_logo_grid_posters.jpg\" alt=\"New Logo and Identity for ADC by Sid Lee\" \/>\n<figcaption>Modular grids enable designers to embellish the logo with decorations. <\/figcaption>\n<\/figure>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/adc_2014_logo_typeface.png\" alt=\"New Logo and Identity for ADC by Sid Lee\" \/>\n<figcaption>A custom typeface enables branded wordmarks for programming, events and announcements.<\/figcaption>\n<\/figure>\n<p>Brooklyn-based studio <a href=\"http:\/\/quitefranklyn.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Franklyn<\/a> who recently designed the beautiful <a href=\"http:\/\/adcyoungguns.org\/\" target=\"_blank\" rel=\"noopener noreferrer\">ADC Young Guns<\/a> site, was commissioned to create the new ADC site, which prominently features the tagline, &#8220;Connecting, Provoking and Inspiring the Creative World Since 1920.&#8221; While this tagline does not represent a departure from their previous mission, it takes on an assertive tone when it is presented prominently in a center-aligned serif font, and the site seems to thoroughly reflect the overall identity. If the website is as good as the screenshots (one provided below), we can expect bright, big, edge-to-edge content that connects, provokes and celebrates in with seamless and elegant interaction across all platforms.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/adc_2014_franklyn_website.jpg\" alt=\"New Logo and Identity for ADC by Sid Lee\" \/>\n<figcaption>A mockup of the new ADC website, launching in early 2014.<\/figcaption>\n<\/figure>\n<p>The best days of the ADC are not behind it. The refreshed ADC monogram is a smart move because it signals a connection to the past, rather than a break. A club is a club, but this one is inherently inclusive. If you pay your annual membership dues, you&#8217;re in. You can do mediocre work and still be a member of the club. If you do great work, you might win an award. If you&#8217;re a winner, the club will honor you and your work and, more people will know who you are. Some of those people will want to do good work like you and be recognized, and they&#8217;ll join the club. Then this process will repeat. In the old days, your winning work was printed in a thick book and stuck on the shelf with other thick books. Then, Lazy Art Directors would pull these books off the shelf and emulate your work. But you would still become more famous, because everyone would be talking about you. Whether one agrees with it or not, this is a model that generally used to work until the internet. Clubs are no longer the primary resource for Lazy Art Directors, who now cruise sites like <a href=\"http:\/\/ffffound.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">FFFFOUND<\/a>, or even <a href=\"http:\/\/underconsideration.com\/quipsologies\/\" target=\"_blank\" rel=\"noopener noreferrer\">Quipsologies<\/a>, for &#8220;inspiration.&#8221; So, even though this club model is a little busted, it seems that the ADC has come close to solving this method for the future so that we can continue to celebrate our profession.<\/p>\n<p>The ADC is clearly in the process of reestablishing itself as an authority, and growing its member base beyond the traditional confines of New York advertising and design. In doing so, it has set a high bar. Even though it&#8217;s unfair to compare various design organizations with completely different strategies, membership bases, mission statements, acronyms, and logos&hellip; I will. The AIGA and the ADC were founded around the same time with more or less similar intents. The AIGA clumsily announced the <a href=\"http:\/\/www.aiga.org\/cast-your-vote-for-AIGAs-future\/\" target=\"_blank\" rel=\"noopener noreferrer\">sale<\/a> of its national headquarters and event space on Fifth Avenue in Manhattan, and <a href=\"http:\/\/www.aiga.org\/news-20121001\/\" target=\"_blank\" rel=\"noopener noreferrer\">divested<\/a> the competitions at the core of their history and identity to the <a href=\"http:\/\/observatory.designobserver.com\/feature\/status-quo-or-transformation-a-false-choice\/38159\/\" target=\"_blank\" rel=\"noopener noreferrer\">surprise and disgust<\/a> of the design community. But, the ADC has doubled down on what it does best. The ADC seems to value the benefits that a brick and mortar location brings to members, and knows how the right programming can be a catalyst for connection, community and celebration whether your a student or a retired ad-man. They use their event space like they mean it. Moreover, the ADC understands that competitions are integral to celebrating great work, and encouraging more of it. The ADC has hit a lofty high note &mdash; that our work should be of the highest craft, and honor the history and power of our profession. By looking to the past, the refreshing new identity and website do just that.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/adc_2014_gatsby_window.png\" alt=\"New Logo and Identity for ADC by Sid Lee\" \/>\n<figcaption>The ADC headquarters and event space at 106 West 29th Street, New York, NY.<\/figcaption>\n<\/figure>\n<blockquote>&#8220;So we beat on, boats against the current, borne back ceaselessly into the past.&#8221;<\/blockquote><h3>F. Scott Fitzgerald, <em>The Great Gatsby<\/em>, 1925<\/h3>\n<p class=\"end\">As a disclaimer, anything I say here is through the lens of my own intimate relationship with the ADC. I&#8217;m a member, I&#8217;m a Young Gun, I&#8217;ve won a few cubes, I&#8217;ve been on several juries and committees, I&#8217;ve chaired the National Student Portfolio Reviews, I have consumed a responsible amount of free alcohol at their events, I designed the identity for the <a href=\"http:\/\/new.pentagram.com\/2010\/11\/new-work-art-directors-club-20\/\" target=\"_blank\" rel=\"noopener noreferrer\">2010 Hall of Fame Gala<\/a> and also the aforementioned 2003 identity at Pentagram. The design and advertising world is small.<\/p>\n<p class=\"gray_60\">Thanks to Zack Kinslow at the ADC for providing many insights about the new identity, and a special thanks to Michael Freimuth of Franklyn and Kurt Koepfle of Pentagram for their contributions.<\/p>\n<p class=\"gray_60\"><a href=\"http:\/\/www.joemarianek.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Joe Marianek<\/a> is a multidisciplinary designer, educator and creative director with more than ten years of experience. Prior to joining the Apple global design group in 2012 he worked for Milton Glaser, Paula Scher, Landor, and Michael Bierut, ultimately named associate partner at Pentagram. He served as vice-president of the Rhode Island Chapter of the AIGA from 2010 to 2012, and has lectured and judged internationally. He has taught extension courses in poster design, identity systems, and information graphics at the Rhode Island School of Design. Since 2007, Marianek has been a faculty member at the School of Visual Arts in New York, teaching typography and senior thesis courses. He is currently based in San Francisco.<\/p>","protected":false},"excerpt":{"rendered":"Reviewed by Joe Marianek The Art Directors Club (ADC) is a 94 year-old professional design and advertising organization based in New York City. Throughout the last year, the ADC has slowly unveiled various components of their new identity which includes&#8230;","protected":false},"author":5,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[9,71,26],"tags":[40,115,42,957],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/2985"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=2985"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/2985\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=2985"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=2985"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=2985"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}