{"id":3340,"date":"2014-07-17T06:43:35","date_gmt":"2014-07-17T11:43:35","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/new_logo_and_identity_for_airbnb_by_designstudio.php"},"modified":"2014-07-17T06:43:35","modified_gmt":"2014-07-17T11:43:35","slug":"new_logo_and_identity_for_airbnb_by_designstudio","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/new_logo_and_identity_for_airbnb_by_designstudio.php","title":{"rendered":"New Logo and Identity for Airbnb by DesignStudio"},"content":{"rendered":"<p>Launched in 2008 by two RISD graduates, Joe Gebbia and Brian Chesky, <a href=\"https:\/\/www.airbnb.com\" target=\"_blank\" rel=\"noopener noreferrer\">Airbnb<\/a> (originally AirBed &amp; Breakfast) is an online marketplace for people to list their property (owned or rented) for short- and long-term accommodations for other people to book. Offerings range from a tiny bedroom in someone&#8217;s home or apartment to a remote villa to a full castle (of which there are more than 600 listings) and prices range from $10 to $1,000. In six years, Airbnb users have hosted over 15 million cumulative guests through more than 800,000 listings across 34,000 cities in 190 countries and has disrupted both the hospitality industry and all kinds of property laws where it&#8217;s unclear what&#8217;s rentable and what&#8217;s not.    Airbnb has grown from a company that had to promote itself by its founders hand-assembling over 3,000 boxes of fake <a href=\"https:\/\/www.airbnb.com\/obamaos\" target=\"_blank\" rel=\"noopener noreferrer\">Obama and McCain cereals<\/a> during the Democratic National Convention in 2008 to being a <a href=\"http:\/\/www.runnersworld.com\/new-york-city-marathon\/airbnb-new-sponsor-of-new-york-city-marathon\" target=\"_blank\" rel=\"noopener noreferrer\">sponsor<\/a> of the 2014 New York City Marathon &mdash; this alone represents the exponential growth and awareness of the service. Yesterday, Airbnb introduced a new brand positioning, Belong Together, and a new identity designed by London-based <a href=\"http:\/\/www.wearedesignstudio.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">DesignStudio<\/a>.<\/p><!--more--><blockquote>Belonging has always been a fundamental driver of humankind. So to represent that feeling, we&#8217;ve created a symbol for us as a community. It&#8217;s an iconic mark for our windows, our doors, and our shared values. It&#8217;s a symbol that, like us, can belong wherever it happens to be.<br \/><br \/>It&#8217;s a symbol for people who want to try a new tea they&#8217;ve never heard of from a village they couldn&#8217;t find on the map. It&#8217;s a symbol for going where the locals go&mdash;the cafe that doesn&#8217;t bother with a menu, the dance club hidden down a long alleyway, the art galleries that don&#8217;t show up in the guidebooks. It&#8217;s a symbol for people who want to welcome into their home new experiences, new cultures, and new conversations.<br \/><br \/>We&#8217;re proud to introduce the B&eacute;lo: the universal symbol of belonging.<\/blockquote><h3><a href=\"http:\/\/blog.airbnb.com\/belong-anywhere\" target=\"_blank\" rel=\"noopener noreferrer\">Airbnb blog post from founder Brian Chesky<\/a><\/h3>\n<figure class=\"full\"><div class=\"video-container\"><iframe src=\"https:\/\/www.youtube.com\/embed\/nMITXMrrVQU\" frameborder=\"0\" allowfullscreen><\/iframe><\/div>\n<figcaption>Introducing the new brand.<\/figcaption>\n<\/figure>\n<p>DesignStudio managed to get Airbnb&#8217;s attention after being shortlisted along with eight other undisclosed design firms and was literally brought on board, living and working in San Francisco (Airbnb&#8217;s headquarters) for long periods of time over the course of more than a year while also taking on the arduous task of four of its team members traveling to 13 cities, staying with 18 hosts, across four continents using Airbnb. You can read more about their process <a href=\"http:\/\/www.wearedesignstudio.com\/works\/airbnb-process\/\" target=\"_blank\" rel=\"noopener noreferrer\">here<\/a>. I&#8217;m rarely impressed by design firms that go method for a project; I think it&#8217;s charming but I really doubt it leads to the mythical insights one expects. Sometimes interviewing a CEO and one lowest-paid employee leads to the right answer in less time and under budget. But props to DesignStudio and Airbnb for going there.<\/p>\n<blockquote>With this project, we set out to create a top-to-bottom transformation of the Airbnb brand to reflect the growing global audience. Part of our goal was to design a marque anyone could draw &mdash; something that transcended language and formed the foundation of the new brand. The marque, named B&eacute;lo, encompasses values of belonging and is imbued with four meanings of People, Places, Love and Airbnb. This is transcended into a community symbol that can be expressed differently by each community member and in every listing &mdash; it is not bound by language, culture or location. The end result is a symbol we hope people feel compelled to share, one that accepts we are all different, one to wear with pride. Our long term aim is to create a universal symbol for Airbnb.<\/blockquote><h3><a href=\"http:\/\/www.wearedesignstudio.com\/works\/airbnb-brand\/\" target=\"_blank\" rel=\"noopener noreferrer\">DesignStudio case study<\/a><\/h3>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/airbnb_logo_4things.png\" alt=\"New Logo and Identity for Airbnb by DesignStudio\" \/>\n<figcaption>The four meanings behind the logo: People, Places, Love and Airbnb.<\/figcaption>\n<\/figure>\n<figure class=\"full\"><div class=\"video-container\"><iframe src=\"\/\/player.vimeo.com\/video\/100956544?title=0&amp;byline=0&amp;portrait=0&amp;color=f0001c\" width=\"500\" height=\"281\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen><\/iframe><\/div>\n<figcaption>Logo animation, showing how People, Places, Love and Airbnb come together.<\/figcaption>\n<\/figure>\n<p>So, let&#8217;s get to it. The old logo, designed by one of its founders in mere hours, using Underware&#8217;s <a href=\"http:\/\/www.myfonts.com\/fonts\/underware\/bello\/?refby=ucllc\" target=\"_blank\" rel=\"noopener noreferrer\">Bello<\/a> had the typical naivet&eacute; of a start-up logo and a heavy case of gradientism which was later cleaned up. The tightly-spaced, cushiony letterforms helped, in a weird unexpected way, communicate a sense of comfort and casualness that has served Airbnb quite well and built a modicum amount of equity despite the fact that you don&#8217;t really see the Airbnb logo anywhere outside of their website and mobile apps. Clearly that is changing, now that the company is growing and seems to be intent on increasing its brand awareness to a more mainstream audience, and that&#8217;s where the new logo comes in.<\/p>\n<p>Tackling the easy part of the logo first: the wordmark. It&#8217;s fine. I&#8217;m starting to believe that London-based designers have to sign a contract before being able to operate as a company stating they will only use Lineto typefaces. So it&#8217;s no surprise that Lineto&#8217;s <a href=\"http:\/\/lineto.com\/The+Fonts\/Font+Categories\/Text+Fonts\/Circular\/\" target=\"_blank\" rel=\"noopener noreferrer\">Circular<\/a> &mdash; although reportedly a customized version of it &mdash; has been chosen as the brand font. It&#8217;s a nice, clean, and contemporary sans serif so you can&#8217;t really knock it much.<\/p>\n<p>[<strong>Correction:<\/strong> Wordmark is based on Lineto&#8217;s <a href=\"http:\/\/lineto.com\/The%20Fonts\/Font%20Categories\/Text%20Fonts\/Brown\/\" target=\"_blank\" rel=\"noopener noreferrer\">Brown<\/a>. The type family used for the rest of the materials as the brand font <em>is<\/em> Circular.]<\/p>\n<blockquote>To build a brand and not just a new marque, we began by creating a bespoke colour: &#8216;Rausch&#8217;. Named in honour of the street where it all started, it is a colour which delivers the emotion and passion around the brand, without the aggression of pure red. Rausch is supported by a secondary palette, with colours and names drawn from continents and world cities, to create a memorable range to be used by Airbnb&#8217;s vast internal design team.<\/blockquote><h3><a href=\"http:\/\/www.wearedesignstudio.com\/works\/airbnb-brand\/\" target=\"_blank\" rel=\"noopener noreferrer\">DesignStudio case study<\/a><\/h3>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/airbnb_logo_detail.png\" alt=\"New Logo and Identity for Airbnb by DesignStudio\" \/>\n<figcaption>Logo detail.<\/figcaption>\n<\/figure>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/airbnb_icon_detail_animation.gif\" alt=\"New Logo and Identity for Airbnb by DesignStudio\" \/>\n<figcaption>The B&eacute;lo, in action.<\/figcaption>\n<\/figure>\n<p>Then there is the icon, nicknamed &#8220;The B&eacute;lo&#8221; (pronounced bay-loh) after the brand idea of <em>belo<\/em>nging (although I would have enjoyed it more if it was in honor of the previous font). The icon is an abstraction of four principles &mdash; People, Places, Love, and Airbnb &mdash; that have been blended into this single &#8220;A&#8221; shape. Mr. Chesky waxes far too poetic about the symbol and its potential to unify cultures and people but he&#8217;s not far off in trusting that this icon has the potential of being impressively representative of his company. It could possibly be as ubiquitous as &#8220;Wi-Fi&#8221; logos on cafes or TripAdvisor stickers in all kinds of travel spots if its community embraces it. It&#8217;s a deceivingly simple icon that is easy to reproduce, recognize, and propagate. The dimension they have built into it (both in the renderings below and the animation where the logo spins at the 1:30 mark on the first video) show there is literally more depth to the icon than meets the eye and I hope they exploit that a little more.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/airbnb_icon_3d.jpg\" alt=\"New Logo and Identity for Airbnb by DesignStudio\" \/>\n<hr \/>\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/airbnb_icon_3d_02.jpg\" alt=\"New Logo and Identity for Airbnb by DesignStudio\" \/>\n<hr \/>\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/airbnb_icon_3d_03.jpg\" alt=\"New Logo and Identity for Airbnb by DesignStudio\" \/>\n<figcaption>The B&eacute;lo IRL. If Airbnb mass-produced that keychain I would bet it could be as cool as the Livestrong yellow bracelets were at the time.<\/figcaption>\n<\/figure>\n<p>To be more clear: this is a great icon. These days it&#8217;s really hard to come up with an icon that can serve as an immediate identifier and sometimes it isn&#8217;t about the icon &mdash; see Nike&#8217;s swoosh (which ain&#8217;t worth shit on its own &mdash; seriously, imagine it being launched today) &mdash; and more about the meaning imbued behind it through very dominant use and user adoption. Airbnb, right now, has the momentum to build all the meaning they want into this icon and I have a feeling they are going to pull it off.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/airbnb_create_icon.jpg\" alt=\"New Logo and Identity for Airbnb by DesignStudio\" \/>\n<hr \/>\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/airbnb_create_site.jpg\" alt=\"New Logo and Identity for Airbnb by DesignStudio\" \/>\n<figcaption>Airbnb insists users create their own icon, which you can do <a href=\"http:\/\/create.airbnb.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">here<\/a>.<\/figcaption>\n<\/figure>\n<p>I wish they would back off on the &#8220;let&#8217;s all make logos&#8221; gimmick. I understand the goodwill of wanting to give users some sense of ownership in the icon but I think if they were less obvious and adamant about it there would be a more genuine adoption of the icon. Some of the alternate versions of the logo, as created by Airbnb or DesignStudio, are cool (see animated GIF above) but the ones created by users with the <a href=\"http:\/\/create.airbnb.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Create<\/a> tool are downright terrible and don&#8217;t do much in advancing the brand. Make cool window stickers &mdash; like those that come in every single Apple product &mdash; and let people put them on their properties.<\/p>\n<p>Now, there is the matter of the mob mentality who, yesterday, got all riled up about two things: <strong>1)<\/strong> The new icon looks like the logo of <a href=\"https:\/\/www.automationanywhere.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Automation Anywhere<\/a> and have claimed it was ripped off, and <strong>2)<\/strong> the new icon looks like every sexual reproductive organ in the male and female anatomy. To the first claim: had you ever heard of Automation Anywhere before yesterday? Right, didn&#8217;t think so. To claim that DesignStudio or Airbnb copied or stole the logo is idiotic. It simply points to the fact that neither logo is highly original in its shape and that it&#8217;s possible that out of the millions of companies out there designing logos for themselves to arrive at similar solutions. To the second claim that the logo looks like testicles, a vagina, a butt, a penis, and an asshole &mdash; <a href=\"http:\/\/airbnblogos.tumblr.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">all already dutifully illustrated in this Tumblr (NSFW)<\/a> &mdash; seriously, how old are y&#8217;all, 13? Grow up. It&#8217;s a fucking &#8220;A&#8221;.<\/p>\n<figure class=\"quarter\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/airbnb_card_stationery.jpg\" alt=\"New Logo and Identity for Airbnb by DesignStudio\" \/>\n<figcaption>Business card and letterhead.<\/figcaption>\n<\/figure>\n<figure class=\"quarter\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/airbnb_apparely_stuff.jpg\" alt=\"New Logo and Identity for Airbnb by DesignStudio\" \/>\n<figcaption>Fashion-y prototypes.<\/figcaption>\n<\/figure>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/airbnb_apparely_billboard.jpg\" alt=\"New Logo and Identity for Airbnb by DesignStudio\" \/>\n<figcaption>The main message.<\/figcaption>\n<\/figure>\n<p class=\"end\">The icon isn&#8217;t perfect and perhaps there was a little too much pomposity\/grandiosity in its release, introduction, and language used but this is a really good change for Airbnb, signaling a maturity in its branding and an ambition to become a globally-known brand &mdash; you do need a certain amount of self-fanfare to pull that kind of stuff off but, mainly, Airbnb just has a really good offering that a very specific generation of affluent, globe-trotting, social-media-pumping users is embracing and you can&#8217;t ask for better ambassadors than that. If Airbnb finds a way to make the icon adoption feel more organic (and state\/country laws to be more favorable) I do think this icon has the 5- or 10-year potential to become more than just a corporate trademark.<\/p>","protected":false},"excerpt":{"rendered":"Launched in 2008 by two RISD graduates, Joe Gebbia and Brian Chesky, Airbnb (originally AirBed &amp; Breakfast) is an online marketplace for people to list their property (owned or rented) for short- and long-term accommodations for other people to book&#8230;.","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[9,73,26],"tags":[617,105,339,309],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/3340"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=3340"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/3340\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=3340"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=3340"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=3340"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}