{"id":3917,"date":"2015-04-20T05:55:11","date_gmt":"2015-04-20T10:55:11","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/new_logo_for_hillary_clinton_presidential_campaign.php"},"modified":"2015-04-20T05:55:11","modified_gmt":"2015-04-20T10:55:11","slug":"new_logo_for_hillary_clinton_presidential_campaign","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/new_logo_for_hillary_clinton_presidential_campaign.php","title":{"rendered":"New Logo for Hillary Clinton Presidential Campaign"},"content":{"rendered":"<p><span class=\"red_100\">Reviewed by Mark Kingsley<\/span><\/p>\n<p>I have little to no concern whether Michael Bierut&#8217;s logo for Hillary Clinton&#8217;s presidential campaign reaches a certain aesthetic standard. Such standards are constantly shifting because aesthetics is a branch of philosophy, which itself is a continual ebb and flow of definition and redefinition, framing and reframing. That which <a href=\"https:\/\/www.typotheque.com\/articles\/cult_of_the_ugly\" target=\"_blank\" rel=\"noopener noreferrer\">Steve Heller called ugly<\/a> became a new kind of beauty. And regardless of <a href=\"http:\/\/designisonefilm.com\" target=\"_blank\" rel=\"noopener noreferrer\">Massimo Vignelli&#8217;s platonic ideals of order<\/a>, I constantly come across <a href=\"http:\/\/www.woostercollective.com\/#grid-view\" target=\"_blank\" rel=\"noopener noreferrer\">beautiful empires of disorder, detritus and shit<\/a>.<\/p><!--more--><p>This is because one&#8217;s taste, as a way to control the world, is irrelevant. But one&#8217;s taste, as a way to see and interact with the world, can be absolutely relevant. It all depends on how things are framed and the contexts in which they are framed.  Unfortunately, the controversy around Hillary&#8217;s logo has generally been framed in the most fallacious manner: that of the professional expertise (read &#8220;taste&#8221;) of the graphic designer. <\/p>\n<p>Perhaps it&#8217;s because we&#8217;re still coming out of the Financial Crisis, but there certainly are a great number of designers climbing all over each other to declare both their &#8220;professional&#8221; (ironic quotes) capability and Hillary&#8217;s logo as bad piece of work. It&#8217;s clumsy, it&#8217;s awkward, it&#8217;s badly proportioned, and the arrow points to the right.<\/p>\n<p>The sad truth is, the American people couldn&#8217;t care less about aesthetic standards as professed by a small subset of typographic and layout specialists. But they do care what font their resume is set in. Well, kind of &hellip; it really depends what they have on their computer. <\/p>\n<p>Which pretty much explains why so many signs in local shops are <a href=\"http:\/\/www.malcontent.com\/the-whistling-repertory-of-the-common-man\/\" target=\"_blank\" rel=\"noopener noreferrer\">set in Algerian<\/a>.<\/p>\n<p>The avant-garde <a href=\"http:\/\/musicmavericks.publicradio.org\/features\/interview_babbitt.html\" target=\"_blank\" rel=\"noopener noreferrer\">composer Milton Babbitt<\/a> knew that his music wouldn&#8217;t have any effect on the &#8220;<a href=\"http:\/\/www.palestrant.com\/babbitt.html\" target=\"_blank\" rel=\"noopener noreferrer\">whistling repertory of the man in the street<\/a>,&#8221; and that gave him the freedom to compose as he wished. But graphic designers are a different creative breed. The world&#8217;s communications require varying degrees of aesthetic attention and in attending to that need, designers find themselves caught up in the continual struggle between art-for-art&#8217;s-sake and art-for-commerce.<\/p>\n<p>The aesthetic standards for each job are established by the context in which that job will exist. And in the case of Hillary, she and her staff need to consider several arenas, from the political to the media, the mass, the practical, and the aspirational.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/hillary_clinton_kingsley_60 Minutes.jpg\" alt=\"New Logo for Hillary Clinton Presidential Campaign\" \/>\n<figcaption>Hillary Clinton with then-candidate Bill on <em>60 Minutes<\/em>.<\/figcaption>\n<\/figure>\n<p>While previous first ladies found their voice during their husband&#8217;s term in office, America met Hillary during Bill Clinton&#8217;s 1992 presidential campaign, where she was presented as a political partner. If people voted for Bill, they would get <a href=\"http:\/\/backstoryradio.org\/2014\/12\/10\/two-for-the-price-of-one\/\" target=\"_blank\" rel=\"noopener noreferrer\">&#8220;two for the price of one.&#8221;<\/a> And when responding to allegations of Bill&#8217;s infidelity on <a href=\"http:\/\/www.cbsnews.com\/news\/hillarys-first-joint-interview-next-to-bill-in-92\/\" target=\"_blank\" rel=\"noopener noreferrer\"><em>60 Minutes<\/em><\/a>, Hillary&#8217;s slight Southern drawl and reference to Tammy Wynette&mdash; &#8220;I&#8217;m not sitting here because I&#8217;m some little woman standing by her man&hellip; I&#8217;m sitting here because I love him and respect him and I honor what he&#8217;s been through and&hellip; if that&#8217;s not good enough, then heck, don&#8217;t vote for him&#8221; &mdash; didn&#8217;t sit well with many people.<\/p>\n<p>Then several months after taking office, Bill named Hillary to head the President&#8217;s Task Force on National Health Care Reform. As Myra G. Gutin wrote in the anthology <a href=\"https:\/\/books.google.com\/books?id=4Bn1O7rKTugC&#038;pg=PA174&#038;lpg=PA174&#038;dq=Myra+G.+Gutin+laura+bush&#038;source=bl&#038;ots=H2pe-KFnvQ&#038;sig=5CDCC3OUoWzD77GNPo2g4tOLJAM&#038;hl=en&#038;sa=X&#038;ei=iPwzVc3ML6PLsASv_oC4CQ&#038;ved=0CCUQ6AEwAQ#v=onepage&#038;q=Myra%20G.%20Gutin%20laura%20bush&#038;f=false\" target=\"_blank\" rel=\"noopener noreferrer\">&#8220;Laura Bush: The Report to the First Lady:&#8221;<\/a><\/p>\n<blockquote>\nUnfortunately, the whole health care reform enterprise almost immediately became a nightmare. There were nearly 600 people working in sub-groups and task forces. To achieve her goals, the First Lady closed meetings to the media and the public causing frustration and anger. The Association of American Physicians and Surgeons brought suit in federal court to open the meetings. A federal judge ruled that the task force was guilty of misconduct in withholding documents; later, however, the United States Court of Appeals for the district of Columbia held that Mrs. Clinton was a &#8216;de facto officer or employee&#8217; of the government, and that the Task Force was not obligated to open its hearings.<br \/><br \/>The ruling was a victory for Mrs. Clinton, but the victory tarnished when the Task Force unveiled its sweeping, controversial reform plan. There seemed to be something to offend everyone, and the bureaucracy, regulation, and rules made the viability of that new plan questionable. Compromises were offered that might have won support of both Democrats and Republicans, but Mrs. Clinton remained unyielding, particularly on the provision of universal coverage. The First Lady gambled and lost; the health care plan collapsed completely in August 1994.\n<\/blockquote><h3>&#8220;Laura Bush: The Report to the First Lady&#8221;<\/h3>\n<p>From the outset of the Clinton presidency, there was no relief from scrutiny or political attacks. <a href=\"http:\/\/en.wikipedia.org\/wiki\/White_House_travel_office_controversy\" target=\"_blank\" rel=\"noopener noreferrer\">Travelgate<\/a>, the suicide of <a href=\"http:\/\/en.wikipedia.org\/wiki\/Suicide_of_Vince_Foster\" target=\"_blank\" rel=\"noopener noreferrer\">Vincent Foster<\/a>, personal financial dealings and <a href=\"http:\/\/en.wikipedia.org\/wiki\/Whitewater_controversy\" target=\"_blank\" rel=\"noopener noreferrer\">Whitewater<\/a> were constantly (and sometimes still) in the news. The Clintons had committed the sin of standing out. In the wrong way. <\/p>\n<p>Everything was now subject to close analysis, including their physical appearance. Because as the fashion columnist for the <em>Washington Post<\/em>, Robin Givhan, has often noted, Beltway fashion needs to ride the fine edge between stylish and common.<\/p>\n<blockquote>Clinton tried to have a more fashionable profile but was pummeled into surrender. She was criticized in 1993 for her inauguration hat and for her purple sparkly gown. They were too parochial. They lacked elan. But then she hosted a dinner at the White House wearing one of designer Donna Karan&#8217;s cold-shoulder dresses and folks raised eyebrows wondering if it was too sexy, too trendy, too too. Critics accused her of using clothes as tools for political propaganda, from the pink suit news conference when she was on a charm offensive with the media to the &#8220;dragon&#8221; coat when she went to confront the grand jury. By the time she welcomed Laura Bush to the White House, she was wearing a plain black pantsuit. Fashionwise, she had thrown in the towel.<\/blockquote><h3><a href=\"http:\/\/www.washingtonpost.com\/wp-dyn\/content\/article\/2009\/01\/16\/AR2009011601267.html\" target=\"_blank\" rel=\"noopener noreferrer\"> &#8220;Robin Givhan on Culture: Peer Into the First Lady&#8217;s Closet and You&#8217;ll See an Entire Nation&#8217;s Hang-Ups&#8221;<\/a><\/h3>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/hillary_clinton_kingsley_Hillarys_looks.jpg\" alt=\"New Logo for Hillary Clinton Presidential Campaign\" \/>\n<figcaption>A small range of Hillary&#8217;s looks, from self-styled to professionally groomed.<\/figcaption>\n<\/figure>\n<p>Following that line of thought, the visual identity for Hillary Clinton&#8217;s campaign needs to maintain a similar balance: simple enough for clear communication, without being too hip. In the same way her campaign headquarters were established in the trendy borough of Brooklyn, it couldn&#8217;t be located in ultra-trendy Bushwick; where the Clintons went for <a href=\"http:\/\/gothamist.com\/2012\/09\/22\/photos_bill_hillary_clinton_went_to.php#photo-1\" target=\"_blank\" rel=\"noopener noreferrer\">pizza at Roberta&#8217;s<\/a>. It had to be the more-established used-to-be-trendy <a href=\"http:\/\/www.newsday.com\/news\/new-york\/hillary-clinton-chooses-brooklyn-heights-for-2016-campaign-hq-1.10191587\" target=\"_blank\" rel=\"noopener noreferrer\">Brooklyn Heights<\/a>. <\/p>\n<p>And if you&#8217;re Hillary Clinton, who do you go to for your campaign logo? Why someone who&#8217;s established, non-controversial, respected and extremely charismatic. That would be none other than <a href=\"http:\/\/www.aiga.org\/medalist-michaelbierut\/\" target=\"_blank\" rel=\"noopener noreferrer\">Michael Bierut<\/a>. Because, as someone once said to me: no one was ever fired for hiring Pentagram.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/hillary_clinton_kingsley_Hillaryclinton_com.jpg\" alt=\"New Logo for Hillary Clinton Presidential Campaign\" \/>\n<figcaption>Current home page for hillaryclinton.com<\/figcaption>\n<\/figure>\n<p>Alissa Walker at Gizmodo reported that Michael <a href=\"http:\/\/gizmodo.com\/the-long-pointy-history-behind-hillarys-brilliant-logo-1697613050\" target=\"_blank\" rel=\"noopener noreferrer\">neither confirmed nor denied<\/a> an involvement in the project, so I will take the liberty of accepting that silence as Pentagram&#8217;s general policy. This is understandable. When one works for such a carefully-considered organization as team Hillary, one can only imagine the need to control as much of the dialogue as possible. And the non-disclosure agreements.<\/p>\n<blockquote>Hillary rendezvoused with Bill in Boston the night before the Clintons&#8217; extraordinary &#8220;Checkers speech&#8221; on <em>60 Minutes<\/em>. She conferred with the television crew on colors and camera angles. &#8220;You can quote me as saying that my sense of it was that she was in control,&#8221; says Steve Kroft, the interviewer. &#8220;We fiddled around with who should sit on which side, and they fiddled around with chair heights and things like that. You didn&#8217;t know she was his wife, you&#8217;d have thought she was a media consultant. She didn&#8217;t do it in a dictatorial sort of way&hellip;. She was very delightful and charming. When they left the room, everybody pretty much said, &#8216;Boy, she&#8217;s terrific&#8217;.&#8221;<\/blockquote><h3><a href=http:\/\/www.vanityfair.com\/news\/1992\/05\/hillary-clinton-first-lady-presidency\" target=\"_blank\">Vanity Fair<\/a><\/h3>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/hillary_clinton_kingsley_Nevada_Iowa_NewHampshire_social_icons.jpg\" alt=\"New Logo for Hillary Clinton Presidential Campaign\" \/>\n<figcaption>Individual Facebook profile images for (from left to right) Nevada, Iowa, and New Hampshire.<\/figcaption>\n<\/figure>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/hillary_clinton_kingsley_Nevada_NewHampshire_banner_ads.jpg\" alt=\"New Logo for Hillary Clinton Presidential Campaign\" \/>\n<figcaption>Banner ads for Nevada and New Hampshire.<\/figcaption>\n<\/figure>\n<p>While attribution for the logo may currently be embargoed, its usage isn&#8217;t. And this is the crux of the issue. Political campaigns are both quickly responsive and made up of volunteers. You have to respond to the opposition and whatever topic is trending in the media as fast as possible, and you have to um&hellip; guide your army of volunteers without alienating them.<\/p>\n<p>When considering the range of work for the Obama campaign &mdash; from Andy Keene&#8217;s logo (done as part of Sol Sender&#8217;s team), to <a href=\"https:\/\/www.kickstarter.com\/projects\/simplescott\/designing-obama\/description\" target=\"_blank\" rel=\"noopener noreferrer\">Scott Thomas&#8217;<\/a> applications, to Shepard Fairey&#8217;s <a href=\"http:\/\/nyulocal.com\/national\/2012\/02\/27\/shepard-fairey-pleads-guilty-in-copyright-case\/\" target=\"_blank\" rel=\"noopener noreferrer\">plagiarized poster<\/a> &mdash; we see room for creativity within a managed system. But so far, for Hillary, all I&#8217;ve seen are missed opportunities. All the arrow applications are flat and simplistic. A pointing finger rather than a metaphor for progress. A visual tic rather than a passionate call for action. <\/p>\n<p>And the photography defaults to generic landscapes or nondescript pictures of voters which would be at home on any other candidate&#8217;s webpage &mdash; with the only photographic element that says &#8220;Hillary&#8221; being a set of semi-candid images of the candidate.<\/p>\n<p>For this, I suspect Team Hillary&#8217;s reticence to convey anything other than platitudes and bromides. Barack Obama was relatively free of the burden of decades spent in Washington and that contributed a greater sense of possibility to his campaign. But even though she enters the race with probably the deepest amount of experience than any other Republican or Democrat around, Hillary also has the impediment of caution developed over several decades in Washingtonian. And that means little passion in the graphic program.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/hillary_clinton_kingsley_various_banner_ads.jpg\" alt=\"New Logo for Hillary Clinton Presidential Campaign\" \/>\n<figcaption>Various banner ads, all uninspiring<\/figcaption>\n<\/figure>\n<p>Which is a shame. Because within those two blue bars and red arrow lies a connection to a powerful and authentic visual language that comes from a pivotal moment in history: Depression America and the WPA. <\/p>\n<p>In 1935, during the depths of the Great Depression, President Franklin Delano Roosevelt used the Emergency Relief Appropriation Act to create the Works Progress Administration, an ambitious agency which employed thousands of unemployed people for numerous infrastructure projects. One of these projects was the <a href=\"http:\/\/newdeal.feri.org\/tva\/tva10.htm\" target=\"_blank\" rel=\"noopener noreferrer\">Rural Electrification Administration<\/a>, whose charter was to bring electricity to rural areas that had yet to be wired. <\/p>\n<p>At the time, only 10 percent of rural households had electricity. And while to us electricity is a basic need, in 1935 that concept needed some convincing. Enter <a href=\"http:\/\/www.aiga.org\/medalist-lesterbeall\/\" target=\"_blank\" rel=\"noopener noreferrer\">Lester Beall<\/a>, a well-respected New York graphic designer who received the commission to help promote the project.<\/p>\n<p>Beall&#8217;s posters combined sophisticated elements of European design with American simplicity to create a series that was wonderfully playful and direct. A political tool that didn&#8217;t smell like propaganda. And something which still looks fresh as well as an important entry in the design canon.<\/p>\n<p>Hillary, take notice.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/hillary_clinton_kingsley_beall_posters_02.jpg\" alt=\"New Logo for Hillary Clinton Presidential Campaign\" \/>\n<figcaption>Several of Lester Beall&#8217;s posters for the Rural Electrification Administration.<\/figcaption>\n<\/figure>\n<p>And who&#8217;s to say that Lester Beall&#8217;s work wasn&#8217;t somewhere in the back of Michael Bierut&#8217;s mind? Michael used to work for <a href=\"http:\/\/www.nytimes.com\/2014\/05\/28\/business\/massimo-vignelli-a-modernist-graphic-designer-dies-at-83.html\" target=\"_blank\" rel=\"noopener noreferrer\">Massimo Vignelli<\/a>, who maintained a decades-long friendship with my design teacher <a href=\"http:\/\/www.rrogerremington.com\" target=\"_blank\" rel=\"noopener noreferrer\">R. Roger Remington<\/a>, who in the early 1980s acquired Lester Beall&#8217;s archives for what eventually became <a href=\"http:\/\/vignellicenter.rit.edu\" target=\"_blank\" rel=\"noopener noreferrer\">The Vignelli Center for Design Studies<\/a> at the Rochester Institute of Technology. <\/p>\n<p>Besides that string of connections, there are so many parallels between the 1930s and today. Then, the country was struggling to emerge from the Great Depression, and today we&#8217;re trying to put the Financial Crisis behind us. Roosevelt had the New Deal and Obama has the <a href=\"http:\/\/en.wikipedia.org\/wiki\/Jumpstart_Our_Business_Startups_Act\" target=\"_blank\" rel=\"noopener noreferrer\">Jumpstart Our Businesss Startup<\/a> (JOBS) act. Roosevelt spoke of the &#8220;<a href=\"http:\/\/newdeal.feri.org\/speeches\/1932c.htm\" target=\"_blank\" rel=\"noopener noreferrer\">forgotten man<\/a>,&#8221; and today the topic is the 99%. Roosevelt&#8217;s policies were criticized as unconstitutional, if not somewhat imperious, and so are Obama&#8217;s.<\/p>\n<p>Communication doesn&#8217;t happen in a vacuum. Ideas are built upon existing ones and people discern meaning through degrees of difference. Does it look like something I&#8217;ve seen before? Can I bring my previous experience to bear here?<\/p>\n<p>One of the secrets of communication is understanding the role of routine. You either break from routine, follow it, or slightly tweak it. And for Hillary, and her conservatism, I could absolutely see her marketing team build upon Lester Beall&#8217;s graphic language, tweak it for today&#8217;s audience, and redeem a symbol currently in danger of being marginalized into meaninglessness. It would take a lot more effort, but it would make things a lot more fun and dynamic. And wouldn&#8217;t that be a welcome change from your run-of-the-mill political campaign&#8217;s marketing stew of anger and invective?<\/p>\n<p>Well, one can hope.<\/p>\n<p class=\"gray_60\">Mark Kingsley &hellip; received a personal lesson in branding from Ralph Lauren &hellip; traveled with the punk band Bad Religion &hellip; counts some of the greatest cultural institutions in the united states as his clients &hellip; was nominated for a Grammy &hellip; co-owned an awardwinning design studio for over 15 years &hellip; was an author on Speakup &hellip; worked in Ogilvy&#8217;s Brand Innovation Group (BIG) &hellip; worked at Landor as the Global Creative Lead on the Citi account &hellip; is currently an instructor in The Masters In Branding Program at SVA &hellip; can be found at <a href=\"http:\/\/www.malcontent.com\" target=\"_blank\" class=\"underline gray_50_to_red_50\" rel=\"noopener noreferrer\">Malcontent<\/a><\/p>","protected":false},"excerpt":{"rendered":"Reviewed by Mark Kingsley I have little to no concern whether Michael Bierut&apos;s logo for Hillary Clinton&apos;s presidential campaign reaches a certain aesthetic standard. Such standards are constantly shifting because aesthetics is a branch of philosophy, which itself is a&#8230;","protected":false},"author":5,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[12,81,26],"tags":[],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/3917"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=3917"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/3917\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=3917"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=3917"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=3917"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}