{"id":4197,"date":"2015-09-02T06:27:26","date_gmt":"2015-09-02T11:27:26","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/new_logo_for_google_done_in_house.php"},"modified":"2015-09-02T06:27:26","modified_gmt":"2015-09-02T11:27:26","slug":"new_logo_for_google_done_in_house","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/new_logo_for_google_done_in_house.php","title":{"rendered":"New Logo for Google done In-house"},"content":{"rendered":"<p>Google needs no introduction, except the acknowledgment that it&#8217;s more than the desktop-based search engine on a web browser that I think we all still see it as. It&#8217;s still that and it&#8217;s extremely powerful at it but there is also maps, news, images, self-driving cars, douchebag face gear (<a href=\"http:\/\/www.forbes.com\/sites\/siimonreynolds\/2015\/02\/05\/why-google-glass-failed\/\" target=\"_blank\" rel=\"noopener noreferrer\">thank goodness that ended<\/a>), balloons up in the air, 1 GB internet connections, TV, email, Microsoft Office killer apps, and so much more. Even with the introduction of <a href=\"https:\/\/abc.xyz\/\" target=\"_blank\" rel=\"noopener noreferrer\">Alphabet<\/a> to hold Sergei and Larry&#8217;s every disruptive whim and be the parent company, Google is still a parent company of its own and represents multiple and sometimes diametrically opposing offerings to everyone from grandmas to millennials to my 5-year-old. Which is why redesigning the Google logo is an impossible task without a perfect answer. Of all the potential right or wrong ones, though, yesterday&#8217;s introduction of a new logo designed in-house, Google arrived at the best possible answer.<\/p>\n<!--more--><blockquote>1. A scalable mark that could convey the feeling of the full logotype in constrained spaces.<br \/><br \/>2. The incorporation of dynamic, intelligent motion that responded to users at all stages of an interaction.<br \/><br \/>3. A systematic approach to branding in our products to provide consistency in people&#8217;s daily encounters with Google.<br \/><br \/>4. A refinement of what makes us Googley, combining the best of the brand our users know and love with thoughtful consideration for how their needs are changing.<\/blockquote><h3><a href=\"https:\/\/design.google.com\/articles\/evolving-the-google-identity\/\" target=\"_blank\" rel=\"noopener noreferrer\">Google Design case study<\/a><\/h3>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/google_2015_process.jpg\" alt=\"New Logo for Google done In-house\" \/>\n<figcaption>Process.<\/figcaption>\n<\/figure>\n<p>We should get one thing straight first: the serif Google logo we&#8217;ve gotten used to seeing since 1999 &mdash; that&#8217;s 16 years, a period in which many of us have built our professional careers and relied on Google to do so many things &mdash; is not good. Not by any standard. It&#8217;s an old-looking, disproportionate piece of typography that no designer would think of using in a logo pitch to a client. We currently think it&#8217;s good and many are mourning its demise not because it was a great piece of design like the IBM logo but because we&#8217;ve grown so accustomed to it that anything different is an assault on what we know to be dear and true on the internet. To me, it was about time for that logo to go away.<\/p>\n<p>Also, it&#8217;s important to read the brief above. Even if part of it may have been concocted after the fact to support the solution, there are a couple of things there that make the task of a new Google logo very different from designing other logos. Foremost is the scale at which is deployed, both in terms of its physical appearance and the number of instances it has to be served in a variety of mediums. This isn&#8217;t just a logo that needs to print on a business card, embroider on a polo, and work on a website &mdash; it has to do all those things plus live in smartphones, watches, TVs, tablets, eventually car dashboards, and who knows what else in the near future. A lot of visual solutions to a logo wouldn&#8217;t adapt well to this challenge, which is why the simplicity many people are reacting to as boring is the right approach.<\/p>\n<blockquote>We shared the thinking with teams across the organization. Engineering, research, product, and marketing tested the ideas and evaluated their feasibility as we iterated on the design and rollout strategy. This collaborative process led to a system flexible enough to be used across our marketing materials and product work on any platform: three elemental states that make up a single logo.<\/blockquote><h3><a href=\"https:\/\/design.google.com\/articles\/evolving-the-google-identity\/\" target=\"_blank\" rel=\"noopener noreferrer\">Google Design case study<\/a><\/h3>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/google_2015_the_three_elements.png\" alt=\"New Logo for Google done In-house\" \/>\n<figcaption>The three main elements: logo, dots, and Google G.<\/figcaption>\n<\/figure>\n<figure class=\"full\"><div class=\"video-container\"><video controls><source src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/google_2015_the_three_elements_animated.mp4\" type=\"video\/mp4\">Your browser does not support the video tag.<\/video><\/div>\n<figcaption>The elements, animated.<\/figcaption>\n<\/figure>\n<p>One of the aspects that makes this redesign interesting is that they have bestowed logo duties on three separate elements: there is the logo, a set of dots, and a monogram. The impressive thing about this is that all three scream Google on their own &mdash; even the dots, simply by being the Google colors. You won&#8217;t mistake them for Microsoft dots, that&#8217;s for sure. The three elements, together, are the representation of the brand at every point: when you fire up an app through the G monogram, while the app is thinking through the dots, and when the app is loaded through the wordmark. This is a very clever way of building a visual ecosystem that imprints the Google DNA at every turn.<\/p>\n<blockquote>The Google logo has always had a simple, friendly, and approachable style. We wanted to retain these qualities by combining the mathematical purity of geometric forms with the childlike simplicity of schoolbook letter printing. Our new logotype is set in a custom, geometric sans-serif typeface and maintains the multi-colored playfulness and rotated &#8216;e&#8217; of our previous mark&#8211;a reminder that we&#8217;ll always be a bit unconventional.<\/blockquote><h3><a href=\"https:\/\/design.google.com\/articles\/evolving-the-google-identity\/\" target=\"_blank\" rel=\"noopener noreferrer\">Google Design case study<\/a><\/h3>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/google_2015_logo_detail.png\" alt=\"New Logo for Google done In-house\" \/>\n<figcaption>Logo detail<\/figcaption>\n<\/figure>\n<figure class=\"full\"><div class=\"video-container\"><video controls><source src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/google_2015_logo_explanation.mp4\" type=\"video\/mp4\">Your browser does not support the video tag.<\/video><\/div>\n<figcaption>Logo construction.<\/figcaption>\n<\/figure>\n<p>So&hellip; THE logo. If the plan is to signal revolution instead of evolution, where do you go from a serif logo? A sans serif, of course. This is not revolutionary on its own and even less so in these last two years when every other major company is switching to some interpretation of the same style of sans serif. There is nothing special about the new logo. Even the tilted &#8220;e&#8221; is a tried and true mechanism. In essence, yes, the new logo is boring but it&#8217;s not like the old logo was a party with cocaine falling from the sky and male and female strippers grinding on everyone&#8217;s groin while Jay Z performed a secret concert. What&#8217;s important is that the new logo is exactly right and perfectly calibrated for what it needs to do. It retains the color system that has far too much equity, it keeps a sense of quirkiness through the &#8220;e&#8221;, and it reads perfectly clear at every single size &mdash; perhaps to a fault. As I was working last night on a couple of Google Sheets I couldn&#8217;t help but be distracted by the highly visible new logo.<\/p>\n<p>Any other solution to the logo &mdash; anything more effusive, more visible, more different, more visually explosive &mdash; would have been met with terrible anger. This &#8220;boring&#8221; solution is safe and almost expected but it&#8217;s extremely appropriate.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/google_2015_ooooo.png\" alt=\"New Logo for Google done In-house\" \/>\n<figcaption>Search result pagination.<\/figcaption>\n<\/figure>\n<p>To me the biggest testament of the logo working is the image above. One of Google&#8217;s trademarks (metaphorically and probably literally) is the multiple &#8220;o&#8221; treatment for showing the number of pages available in the search results and the new logo works, as the kids say, amazeballs. Anyone that says the old logo looked better in doing this is wrong.<\/p>\n<blockquote>The Google G is directly derived from the logotype &#8216;G,&#8217; but uses increased visual weight to stand up at small sizes and contexts where it needs to share space with other elements. Designed on the same grid as our product iconography, the circular shape was optically refined to prevent a visual &#8220;overbite&#8221; at the point where the circular form meets the crossbar. The color proportions convey the full spectrum of the logotype and are sequenced to aid eye movement around the letterform.<\/blockquote><h3><a href=\"https:\/\/design.google.com\/articles\/evolving-the-google-identity\/\" target=\"_blank\" rel=\"noopener noreferrer\">Google Design case study<\/a><\/h3>\n<figure class=\"full\"><div class=\"video-container\"><video controls><source src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/google_2015_google_g.mp4\" type=\"video\/mp4\">Your browser does not support the video tag.<\/video><\/div>\n<figcaption>The Google G.<\/figcaption>\n<\/figure>\n<p>The &#8220;G&#8221; monogram is no surprise. Based on the new logo, the simple geometric &#8220;G&#8221; works perfectly in a square for every possible avatar and shorthand needed, whether it&#8217;s in a single color or the multi-color version (which you can see in use as Google.com&#8217;s favicon). And since Google has a stronghold on the letter &#8220;G&#8221; &mdash; <a href=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/dj_vu_google_changes_its_favic.php\" target=\"_blank\" rel=\"noopener noreferrer\">even making the lowercase, double-story &#8220;g&#8221; work for them<\/a> &mdash; pretty much anything resembling a &#8220;G&#8221; would have worked. But this is spot on.<\/p>\n<blockquote>The Google dots are a dynamic and perpetually moving state of the logo. They represent Google&#8217;s intelligence at work and indicate when Google is working for you. We consider these unique, magic moments. A full range of expressions were developed including listening, thinking, replying, incomprehension, and confirmation. While their movements might seem spontaneous, their motion is rooted in consistent paths and timing, with the dots moving along geometric arcs and following a standard set of snappy easing curves.<\/blockquote><h3><a href=\"https:\/\/design.google.com\/articles\/evolving-the-google-identity\/\" target=\"_blank\" rel=\"noopener noreferrer\">Google Design case study<\/a><\/h3>\n<figure class=\"full\"><div class=\"video-container\"><video controls><source src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/google_2015_dots.mp4\" type=\"video\/mp4\">Your browser does not support the video tag.<\/video><\/div>\n<figcaption>The dots.<\/figcaption>\n<\/figure>\n<p>The dots might be my favorite aspect of the redesign. I really like how they serve as an extension of the visual behaviors established in Google&#8217;s Material Design spec and it&#8217;s amazing how much you can do with four dots. I&#8217;m not going to dare to compare this work to that of Pixar&#8217;s or Disney&#8217;s but I do think there is a highly commendable effort here to bring to life these most of inanimate objects and give them an actual personality. Overall, all the animation work on this project is stellar.<\/p>\n<blockquote>In tandem with developing the logotype, we created a custom, geometric sans-serif typeface to complement the logo in product lockups and supporting identity materials. We call it Product Sans. The typeface design takes cues from that same schoolbook letter-printing style, but adopts the neutral consistency we&#8217;ve all come to expect from a geometric sans serif. This allows us to maintain an appropriate level of distinction between the Google logotype and the product name.<\/blockquote><h3><a href=\"https:\/\/design.google.com\/articles\/evolving-the-google-identity\/\" target=\"_blank\" rel=\"noopener noreferrer\">Google Design case study<\/a><\/h3>\n<figure class=\"full\"><div class=\"video-container\"><video controls><source src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/google_2015_typography.mp4\" type=\"video\/mp4\">Your browser does not support the video tag.<\/video><\/div>\n<figcaption>Custom typeface, Product Sans.<\/figcaption>\n<\/figure>\n<p>The new custom typeface is such a mash-up of every other sans serif out there that it&#8217;s really hard to care that they made a new type family that looks like a dozen other typefaces. It&#8217;s nice and everything but I think we have done every possible humanist-slash-geometric sans serif possible. We won, okay? Happy?<\/p>\n<figure class=\"full\"><div class=\"video-container\"><iframe src=\"https:\/\/www.youtube.com\/embed\/olFEpeMwgHk\" frameborder=\"0\" allowfullscreen><\/iframe><\/div>\n<figcaption>Logo and home page evolution over the past 17 years with new look kicking in at the 1:16 mark.<\/figcaption>\n<\/figure>\n<p class=\"end\">The official, short verdict from me is that this is great. Really great. It&#8217;s not a groundbreaking logo but it doesn&#8217;t need to be. It&#8217;s the system and cohesive thinking about it that stands out and may be hard to get excited about for the general public. You also have to admire the confidence with which it was deployed: It&#8217;s Tuesday, bitches, and here is a new logo for one of the largest, most important brands in the world! Compare that to Yahoo&#8217;s 30-day fiasco and you have to admire a proper process and a solid rollout. This new logo system is the climax of Google&#8217;s evolution into one of the most thoughtful and well-designed products today and represents a masterful 180-degree turn from the third-rate design it featured in its infancy and of which it was very proud. Now, Google is setting a standard that other design-led companies like Apple and IBM need to catch up to.<\/p>","protected":false},"excerpt":{"rendered":"Google needs no introduction, except the acknowledgment that it&apos;s more than the desktop-based search engine on a web browser that I think we all still see it as. It&apos;s still that and it&apos;s extremely powerful at it but there is&#8230;","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[9,26,88],"tags":[287,617,108,141,42],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/4197"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=4197"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/4197\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=4197"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=4197"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=4197"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}