{"id":4471,"date":"2016-02-03T06:40:44","date_gmt":"2016-02-03T12:40:44","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/new_logo_and_identity_for_uber_done_in_house.php"},"modified":"2016-02-03T06:40:44","modified_gmt":"2016-02-03T12:40:44","slug":"new_logo_and_identity_for_uber_done_in_house","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/new_logo_and_identity_for_uber_done_in_house.php","title":{"rendered":"New Logo and Identity for Uber done In-house"},"content":{"rendered":"<p>Launched in 2009 (originally named UberCab), <a href=\"https:\/\/www.uber.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Uber<\/a> is a ride hail application that connects drivers with riders but since there is a chance you are reading this while riding in an Uber car, you probably don&#8217;t need me to tell you much about Uber. Created by Travis Kalanick and Garrett Camp and headquartered in San Francisco, CA, Uber is now available in 400 cities across 65 countries where it has disrupted &mdash; for better <em>and<\/em> worse &mdash; the incumbent taxi system. Originally, a semi-affordable luxury that focused on big black cars, Uber now comes in every flavor with even the least fanciest cars as part of the unattached fleet and has even expanded into services like Uber Rush, a messenger service in Manhattan. Whether loved or hated, Uber is here to stay and, to cement its position, the company introduced yesterday a new logo and identity designed in-house (more on this at the end of the post).<\/p>\n<!--more--><blockquote>The cornerstone of our brand identity is the new logotype. We&#8217;ve always felt there was a cognitive dissonance between who we were deep down and how we expressed ourselves through our logo. The simplicity of the new logotype denotes quality and elegance, while the combination of straight and curved lines convey both the confidence and approachability of our updated look.<\/blockquote><h3><a href=\"https:\/\/brand.uber.com\/#our-new-look\" target=\"_blank\" rel=\"noopener noreferrer\">Uber brand microsite<\/a><\/h3>\n<figure class=\"full\"><div class=\"video-container\"><video controls><source src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/uber_2016_logo_evolution.mp4\" type=\"video\/mp4\">Your browser does not support the video tag.<\/video><\/div>\n<figcaption>Logo evolution.<\/figcaption>\n<\/figure>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/uber_2016_logo.png\" alt=\"New Logo and Identity for Uber done In-house\" \/>\n<figcaption>Logo detail.<\/figcaption>\n<\/figure>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/uber_2016_logo_grid.png\" alt=\"New Logo and Identity for Uber done In-house\" \/>\n<figcaption>Logo grid. Uh-oh &#8220;R&#8221;.<\/figcaption>\n<\/figure>\n<p>The previous logo was so thin it would crumble at the slightest sneeze. The wordmark lacked a lot of weight to be of good use in small screens and the wide letter-spacing forced it to take up too much space, making it necessary to make it smaller, making it barely readable. I&#8217;ve always disliked the little curl on the &#8220;U&#8221; but other than that, it was a mostly innocuous logo.<\/p>\n<p>The new one fixes the usability of the logo by going bolder and tighter. On that aspect alone, the logo evolution is a success. Beyond that, there is nothing else nice to say about it but also nothing negative. Okay, well, maybe a couple of things: the inner curves on the bottom halves of the &#8220;B&#8221;, &#8220;E&#8221;, and &#8220;R&#8221; are very awkward and the elliptical (because they are far from rounded) corners are also strange and give the sensation that the letters have been stretched. Overall though, it&#8217;s fine. It could be a lot worse, it could be a lot better.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/uber_2016_logo_donts.png\" alt=\"New Logo and Identity for Uber done In-house\" \/>\n<figcaption>I had never seen a page like this in guidelines. I guess it makes sense. Seems like it&#8217;s making up for previous bad behavior. Maybe there is a closet somewhere with hundreds of unopened Uber-branded condoms.<\/figcaption>\n<\/figure>\n<p>If you read one identity guideline page this morning, make it the above.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/uber_2016_rush.jpg\" alt=\"New Logo and Identity for Uber done In-house\" \/>\n<figcaption>Uber Rush rider with bag.<\/figcaption>\n<\/figure>\n<blockquote>The unique aspect of Uber is that we exist in the physical world. When you push a button on your phone, a car moves across the city and appears where you are. <strong>We exist in the place where bits and atoms come together<\/strong>. That is Uber. We are not just technology but technology that moves cities and their citizens.<\/blockquote><h3><a href=\"https:\/\/newsroom.uber.com\/celebrating-cities-a-new-look-and-feel-for-uber\/\" target=\"_blank\" rel=\"noopener noreferrer\">Uber announcement<\/a> (emphasis mine)<\/h3>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/uber_2016_the_bit.gif\" alt=\"New Logo and Identity for Uber done In-house\" \/>\n<figcaption>This is the bit.<\/figcaption>\n<\/figure>\n<blockquote>When we start designing for a specific market, we look at the culture holistically&#8211;art, architecture, tradition, old and new fashion, textiles, the environment&#8211;to create color palettes and patterns that are both fresh and relevant. We&#8217;re launching with 65 local color palettes and patterns, representing countries in which Uber operates. These colors and patterns are authentic expressions of the real world&#8217;s diversity, and they afford flexibility in our communications.<\/blockquote><h3><a href=\"https:\/\/brand.uber.com\/#our-new-look\" target=\"_blank\" rel=\"noopener noreferrer\">Uber brand microsite<\/a><\/h3>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/uber_2016_patterns.jpg\" alt=\"New Logo and Identity for Uber done In-house\" \/>\n<figcaption>These are the atoms. Localized patterns.<\/figcaption>\n<\/figure>\n<p>The identity goes into an oddly conceptual thing about bits and atoms. Probably good to watch the video below to either understand or scratch your head a little harder. I&#8217;m going to skip on thinking too much about the concept because it sounds far too self-important. The &#8220;bit&#8221; is significant in that it appears in a lot of places and is basically a square that has info in it or frames things. It reminds me a little of the dot in Google&#8217;s Material visual language but less sophisticated. The &#8220;atoms&#8221; are the textures above which, yeah, okay, they are just textures inspired by each location. They are fine as well. Nothing too exciting but they help add a visual element.<\/p>\n<p>The problem with the bit and the textu&hellip; the atoms is that, at least judging from the main Uber website, there is no real synergy between them and no relationship to the logo or the rest of the layout and typography. It&#8217;s all nicely placed on there but it feels like patchwork.<\/p>\n<figure class=\"full\"><div class=\"video-container\"><video controls><source src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/uber_2016_brand_video.mp4\" type=\"video\/mp4\">Your browser does not support the video tag.<\/video><\/div>\n<figcaption>Brand movie. Important, I guess, to understand the &#8220;atoms and bits&#8221; idea. <\/figcaption>\n<\/figure>\n<blockquote>Like our design system as a whole, at the center of our app icons is the Bit&#8211;the symbol of our technology. It&#8217;s contained within an abstract shape that denotes the product. Underneath those components lies the pattern, a representation of the world of atoms. By adjusting the shape and pattern, we can create unique expressions of our products and cities around the world.<\/blockquote><h3><a href=\"https:\/\/brand.uber.com\/#our-new-look\" target=\"_blank\" rel=\"noopener noreferrer\">Uber brand microsite<\/a><\/h3>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/uber_2016_app_icon_before_after.png\" alt=\"New Logo and Identity for Uber done In-house\" \/>\n<figcaption>App icon, before and after.<\/figcaption>\n<\/figure>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/uber_2016_app_icon_before_after_my_phone.jpg\" alt=\"New Logo and Identity for Uber done In-house\" \/>\n<figcaption>App icon, before and after in situ, on my phone. (Yes, I play Candy Crush).<\/figcaption>\n<\/figure>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/uber_2016_app_icon_detail.jpg\" alt=\"New Logo and Identity for Uber done In-house\" \/>\n<figcaption>App icons detail. Left one is for riders, right one is for drivers.<\/figcaption>\n<\/figure>\n<figure class=\"full\"><div class=\"video-container\"><video controls><source src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/uber_2016_loading.mp4\" type=\"video\/mp4\">Your browser does not support the video tag.<\/video><\/div>\n<figcaption>App loading screen. Thanks to <a href=\"https:\/\/twitter.com\/tinkadoic\" target=\"_blank\" rel=\"noopener noreferrer\">Tin Kadoić<\/a> for capturing and uploading.<\/figcaption>\n<\/figure>\n<p>The bigger issue with the redesign &mdash; far more troubling &mdash; than the logo redesign is the app icon. In this case the app icon gets more action than the logo itself. That&#8217;s the first interaction from most users. If I wasn&#8217;t a fan of the curl in the &#8220;U&#8221; of the old logo I was even less of a fan of the inward serifs of the old icon. But, hey, it was a &#8220;U&#8221; for Uber and it was shiny like the badge on the grill of a car. The new icon is completely unidentifiable in any way as Uber other than it saying &#8220;Uber&#8221; underneath. Let&#8217;s assume that it&#8217;s a matter of being used to poking on that icon for the last five or six years and that we just need to get used to poking at this new one but, even then, it seems like this is an icon for something else altogether. I don&#8217;t think there is enough strength in the bit as the principal (and literal) touchpoint. Having a separate icon for drivers that looks even less like anything doesn&#8217;t help the cause of establishing a consistent, recognizable mobile environment.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/uber_2016_movie_screen_grab_framework.jpg\" alt=\"New Logo and Identity for Uber done In-house\" \/>\n<figcaption>The framework of how layouts come together. Not embeddable so you will have to watch it <a href=\"https:\/\/brand.uber.com\/#our-new-look\" target=\"_blank\" rel=\"noopener noreferrer\">here<\/a>.<\/figcaption>\n<\/figure>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/uber_2016_movie_screen_grab_motion.jpg\" alt=\"New Logo and Identity for Uber done In-house\" \/>\n<figcaption>Motion textures and behaviors. Also not embeddable. Watch <a href=\"https:\/\/brand.uber.com\/#our-new-look\" target=\"_blank\" rel=\"noopener noreferrer\">here<\/a>.<\/figcaption>\n<\/figure>\n<p>After watching the two movies above I&#8217;m still left unclear about what the purpose of anything is. It feels like the team just threw stuff together hoping it would add up to a cohesive whole but everything seems disjointed in a very polished way that ticks off a number of trends, including dramatic music in the videos. Perhaps part of the problem was the process.<\/p>\n<blockquote>Here&#8217;s the thing, though. Kalanick is not a designer. He&#8217;s an engineer by training and an entrepreneur by nature. Yet he refused to entrust the rebranding to anyone else. This was an unusual decision. Most CEOs hire experts&#8211;branding agencies that specialize in translating corporate values into fonts and colors&#8211;or tap an in-house team. Not Kalanick. For the past three years, he&#8217;s worked alongside Uber design director Shalin Amin and a dozen or so others, hammering out ideas from a stuffy space they call the War Room. Along the way, he studied up on concepts ranging from kerning to color palettes. &#8220;I didn&#8217;t know any of this stuff,&#8221; says Kalanick. &#8220;I just knew it was important, and so I wanted it to be good.&#8221;<\/blockquote><h3><a href=\"http:\/\/www.wired.com\/2016\/02\/the-inside-story-behind-ubers-colorful-redesign\/\" target=\"_blank\" rel=\"noopener noreferrer\">WIRED story<\/a><\/h3>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/uber_2016_wired.jpg\" alt=\"New Logo and Identity for Uber done In-house\" \/>\n<figcaption>The Uber design team: Shalin Amin, Mirtho Prepont, Roger Oddone, Travis Kalanick (CEO), Catherine Ray and Bryant Jow at the Uber HQ office in San Francisco. Photo by Talia Herman for WIRED<\/figcaption>\n<\/figure>\n<p>WIRED has an extremely <a href=\"http:\/\/www.wired.com\/2016\/02\/the-inside-story-behind-ubers-colorful-redesign\/\" target=\"_blank\" rel=\"noopener noreferrer\">in-depth article about the redesign<\/a> that is entertaining in how it aggrandizes all the &#8220;a-ha!&#8221; design moments but mostly chilling about the involvement of Uber&#8217;s infamous CEO, Travis Kalanick, whose brash and bro-ish personality has taken as many headlines as the service. If you thought Yahoo&#8217;s <a href=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/new_logo_for_yahoo_designed_in-house.php\" target=\"_blank\" rel=\"noopener noreferrer\">weekend charrette between CEO Marissa Meyer and her design team<\/a> was scary, try an extended process of more than a year of a non-designer CEO micro-managing the process. We rarely get to read about how the sausage gets made and WIRED did a great job in capturing the whole process but this may not have been the best case study for Team Branding as it sounds far from optimal.<\/p>\n<p class=\"end\">If the picture above is any indication, Shalin Amin, shown far left and lead designer on the project, you can sense &mdash; nay, feel deep in your heart &mdash; the weariness in his face. I&#8217;m only going on assumptions here and what the WIRED article shared but it&#8217;s somewhat clear that part of the confused outcome of the identity had a lot to do with a lack of design leadership (or the wrong design leadership) in the process. Overall, the identity is functioning and it <em>looks<\/em> good but it doesn&#8217;t come across as a confident or exciting expression of what Uber is or can be.<\/p>","protected":false},"excerpt":{"rendered":"Launched in 2009 (originally named UberCab), Uber is a ride hail application that connects drivers with riders but since there is a chance you are reading this while riding in an Uber car, you probably don&apos;t need me to tell&#8230;","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[9,26,90],"tags":[683,1238,446],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/4471"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=4471"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/4471\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=4471"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=4471"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=4471"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}