{"id":4483,"date":"2016-02-09T06:21:06","date_gmt":"2016-02-09T12:21:06","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/new_logo_and_identity_for_vsco_done_in_house.php"},"modified":"2016-02-09T06:21:06","modified_gmt":"2016-02-09T12:21:06","slug":"new_logo_and_identity_for_vsco_done_in_house","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/new_logo_and_identity_for_vsco_done_in_house.php","title":{"rendered":"New Logo and Identity for VSCO done In-house"},"content":{"rendered":"<p>Established in 2011, <a href=\"http:\/\/vsco.co\/\" target=\"_blank\" rel=\"noopener noreferrer\">VSCO<\/a> (short for Visual Supply Company) is an &#8220;art and technology company empowering people everywhere to create, discover, and connect&#8221;. Headquartered in Oakland, CA, with over 100 employees, VSCO is most well known for its smartphone app, a more artsy version of Instagram that provides many more post production editing capabilities to make your photos even more moody and emo. VSCO recently reached 30 million active users &mdash; compare to Instagram&#8217;s 400+ million &mdash; and over the past year has been implementing a new identity designed in-house. Last month the team published <a href=\"http:\/\/vsco.co\/id\/journal\/p\/1\" target=\"_blank\" rel=\"noopener noreferrer\">a series of posts<\/a> that explain the identity. In detail. Very. Detailed.<\/p>\n<!--more--><blockquote>As a company that developed a platform for creation and expression, we naturally began our research around the ideas of language, translation, interpretation and expression. At the same time, we centered our reflection periods around developing a visual language (a brand language) that could function very much like a human language system &#8211; interchangeable, flexible, and organic. This meant developing systems of symbols and structure that could be constructed and deconstructed easily.<\/blockquote><h3><a href=\"http:\/\/vsco.co\/id\/journal\/into-the-wilderness\">VSCO<\/a><\/h3>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/vsco_core_elements.png\" alt=\"New Logo and Identity for VSCO done In-house\" \/>\n<figcaption>The core elements.<\/figcaption>\n<\/figure>\n<p>I&#8217;ve been meaning to write this post for a few days but every time I went through the in-house team&#8217;s posts I felt confused and tired. If you have the time, it would be worth reading through all the posts both for background information and entertainment purposes. I sometimes cringe at the over simplification of design concepts issued in corporate press releases but this is the complete opposite, it&#8217;s like a grad student&#8217;s thesis project. Some of the aspects touched upon are interesting but can feel like a case of Thinking Too Hard. It also gets a little too philosophical for my taste, but let&#8217;s get through this journey together, shall we?<\/p>\n<figure class=\"quarter\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/vsco_core_elements_01.png\" alt=\"New Logo and Identity for VSCO done In-house\" \/>\n<figcaption>&#8220;The Globe &#8212; Community as a representation (ie. &#8220;projection&#8221;, &#8220;transformation&#8221;) of the world. VSCO as community.&#8221;<\/figcaption>\n<\/figure>\n<figure class=\"quarter\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/vsco_core_elements_02.png\" alt=\"New Logo and Identity for VSCO done In-house\" \/>\n<figcaption>&#8220;The Face &#8212; Our personhood. A flexible mark reflecting our humanity.&#8221;<\/figcaption>\n<\/figure>\n<figure class=\"quarter\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/vsco_core_elements_03.png\" alt=\"New Logo and Identity for VSCO done In-house\" \/>\n<figcaption>&#8220;The Seal &#8212; A unique imprint. A genetic code unique to every one of us.&#8221;<\/figcaption>\n<\/figure>\n<blockquote>The development of the symbol set begins with the third of VSCO&#8217;s core human symbols, which also serves as the company&#8217;s logo. If we understand that the symbol represents a unique imprint or a genetic code (cf. Human), visually mimicking a code wheel or signet, then we asked the question, what happens when we deconstruct that symbol?<\/blockquote><h3><a href=\"http:\/\/vsco.co\/id\/journal\/symbols\">VSCO on symbols<\/a><\/h3>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/vsco_core_elements_03_explained.png\" alt=\"New Logo and Identity for VSCO done In-house\" \/>\n<figcaption>The third core element serves as the logo.<\/figcaption>\n<\/figure>\n<p>That&#8217;s already a lot of stuff to get through just to talk about the logo. If you are still left wondering, yes, the logo is the double ring thing. But you would have eventually figured that on your own since the logo says VSCO nowhere. Flippant-ism aside, it&#8217;s kind of heroic for VSCO to have a completely abstract logo without a wordmark. It definitely signals that VSCO is not your selling-to-Facebook-anytime-soon kind of company and that they march to the beat of their own weird drum. They place their brand association on that icon, which obviously serves as the app icon, and is what users interact with the most. In that regard, this feels like the anti-Uber approach: This abstract icon acts as a funnel for the rest of the identity and the icon-based, word-less user interface found within the app.<\/p>\n<p>Despite the praise, the explanatory graphic of the icon above is just a few words of shy of being complete mumbo jumbo.<\/p>\n<blockquote>We wanted to form a simple visual language that embodied the thesis of the brand (cf. Into the Wilderness). If language &#8212; expressed in visual, auditory or written forms &#8212; is the vehicle of human expression, then we asked ourselves if we could develop a system that would allow us to visually communicate, whether it&#8217;s in our product design or our brand messaging.<\/blockquote><h3><a href=\"http:\/\/vsco.co\/id\/journal\/symbols\">VSCO VSCO on symbols<\/a><\/h3>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/vsco_cells.png\" alt=\"New Logo and Identity for VSCO done In-house\" \/>\n<figcaption>&#8220;Cells&#8221; as alphabet.<\/figcaption>\n<\/figure>\n<blockquote>The structure of the VSCO visual language consists of mapping simple geometric shapes to the artificial and natural systems that are manifest in our everyday life.<\/blockquote><h3><a href=\"http:\/\/vsco.co\/id\/journal\/symbols\">VSCO on symbols<\/a><\/h3>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/vsco_transformation.png\" alt=\"New Logo and Identity for VSCO done In-house\" \/>\n<figcaption>Studies of Expansion, Compression, Adaptation, Mutation, and Transformation.<\/figcaption>\n<\/figure>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/vsco_cells_jumbled.png\" alt=\"New Logo and Identity for VSCO done In-house\" \/>\n<figcaption>Cells, fallen.<\/figcaption>\n<\/figure>\n<p>I went through the app and some user&#8217;s posts but I never saw where these cell things come into play. Maybe it&#8217;s more internal, maybe it&#8217;s on its way. I love looking at them, but I have no idea what they mean, what purpose they serve, or who will have the ability to interpret them in any meaningful way other than &#8220;Whoah, dude.&#8221;<\/p>\n<blockquote>The VSCO Gothic project is part of an ongoing effort to develop a family of simple workhorse typefaces to serve as foundational elements for the VSCO design language. Working over the course of six months with Göran Söderström, the founder of Letters from Sweden, VSCO Gothic is the first of many typefaces to come.<\/blockquote><h3><a href=\"http:\/\/vsco.co\/id\/journal\/type\">VSCO on type<\/a><\/h3>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/vsco_gothic_01.png\" alt=\"New Logo and Identity for VSCO done In-house\" \/>\n<figcaption>VSCO Gothic custom typeface.<\/figcaption>\n<\/figure>\n<blockquote>Our interest lied in not chasing perfection, but rather realism. The earliest forms of sans serif, a departure from hundreds of years of tradition in printed text, was geometric, bold, functional yet at the same time imperfect and distinctly human. We wanted VSCO Gothic to be perfectly imperfect.<\/blockquote><h3><a href=\"http:\/\/vsco.co\/id\/journal\/type\">VSCO on type<\/a><\/h3>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/vsco_gothic_02.png\" alt=\"New Logo and Identity for VSCO done In-house\" \/>\n<figcaption>VSCO Gothic various weight type specimens.<\/figcaption>\n<\/figure>\n<p>The custom sans serif typeface is fairly nice although I could have seen this easily working with Trade Gothic or Benton out of the box but, hey, if you have the resources and time, why not? The last image above does bring up a weird recurring theme of sausage links, but there is no explanatory thesis about it.<\/p>\n<p>Then something amazing happened, they ran out of stuff to say when it was time for the most interesting part of the system. The faces.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/vsco_faces_00.png\" alt=\"New Logo and Identity for VSCO done In-house\" \/>\n<figcaption>Various faces.<\/figcaption>\n<\/figure>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/vsco_faces_01.png\" alt=\"New Logo and Identity for VSCO done In-house\" \/>\n<figcaption>From letters to faces.<\/figcaption>\n<\/figure>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/vsco_faces_02.png\" alt=\"New Logo and Identity for VSCO done In-house\" \/>\n<figcaption>The face as letters.<\/figcaption>\n<\/figure>\n<p>After going through all the materials and still mostly left wondering what&#8217;s the practical application of most of it I feel like I (and most of us) take identity design too literally or in a prescriptive way where a logo must be easily identifiable so maybe I&#8217;m a square for thinking that the faces made out of VSCO would make for a hell of a better logo system. When you know the company or app is called VSCO, decoding the faces to see the four letters is a very enjoyable (and relatively simple) puzzle to solve. It&#8217;s also the only literal &#8220;human&#8221; element of the identity that establishes a link to the many, you know, humans that other humans take pictures of and make up the bulk of a photo app user&#8217;s output. But, like, the cells, this doesn&#8217;t seem to appear anywhere in use in the VSCO universe. Disclaimer: I&#8217;m not a regular VSCO app user, so maybe my exposure (pun!) is limited.<\/p>\n<p class=\"end\">Overall, I think they got too deep into semiotics and couldn&#8217;t quite let go but I do appreciate the effort to design an informed and thoughtful identity and from the few semi-applications seen this could be an extra hipstery identity of the good kind as the team does have a good grasp on generating alternative-looking compositions. Or they could just sell out to Facebook. Either or.<\/p>","protected":false},"excerpt":{"rendered":"Established in 2011, VSCO (short for Visual Supply Company) is an &quot;art and technology company empowering people everywhere to create, discover, and connect&quot;. Headquartered in Oakland, CA, with over 100 employees, VSCO is most well known for its smartphone app,&#8230;","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[9,26,92],"tags":[823,683],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/4483"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=4483"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/4483\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=4483"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=4483"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=4483"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}