{"id":4499,"date":"2016-02-17T06:04:58","date_gmt":"2016-02-17T12:04:58","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/new_name_logo_and_on-air_look_for_w_by_artgraft.php"},"modified":"2016-02-17T06:04:58","modified_gmt":"2016-02-17T12:04:58","slug":"new_name_logo_and_on_air_look_for_w_by_artgraft","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/new_name_logo_and_on_air_look_for_w_by_artgraft.php","title":{"rendered":"New Name, Logo, and On-air Look for W by Art&amp;Graft"},"content":{"rendered":"<p>Originally launched as Watch in 2008 by UKTV with general entertainment programming, <a href=\"http:\/\/w.uktv.co.uk\/\" target=\"_blank\" rel=\"noopener noreferrer\">W<\/a>, as it was renamed and relaunched last week, is officially &#8220;UKTV&#8217;s premium entertainment channel, offering audiences a dazzling mix of original factual entertainment formats&#8221; but unofficially its programming (and identity) is geared towards women. The channel includes British and American shows ranging from <em>The Honourable Woman<\/em> to <em>Code Black<\/em> to a new show, <em>Get Me To The Church<\/em>, where a bride and groom are dropped off somewhere in the world without any possessions and they must get to the church in time for their wedding. (They also air <em>The Strain<\/em> which is creepy as hell, so the programming is a little all over the place). The new identity and on-air look for the channel have been designed by London-based <a href=\"http:\/\/artandgraft.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Art&amp;Graft<\/a>.<\/p>\n<!--more--><blockquote>Our solution was to create a strong, confident design system that reflects the modern personalities of this female demographic, while also being welcoming and appealing to wider audiences. Sidestepping overtly feminine design tropes &#8211; pink, fluffy, soft &#8211; we have created an authoritative, premium channel brand that audiences, especially women, can relate to, be inspired by, trust to curate great content and most importantly be entertained by.<\/blockquote><h3><a href=\"http:\/\/artandgraft.com\/portfolio\/w-channel-rebrand\" target=\"_blank\" rel=\"noopener noreferrer\">Art&amp;Graft project page<\/a><\/h3>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/w_channel_overview.jpg\" alt=\"New Name, Logo, and On-air Look for W by Art&amp;Graft\" \/>\n<figcaption>Identity overview.<\/figcaption>\n<\/figure>\n<blockquote>The new diamond W logo is at the heart of the rebrand and embodies the brand proposition of smart escapism. The logo, a striking diamond shape, not only provides a strong visual identity but also conceptually encapsulates the brand proposition providing a portal through which the viewer can journey and discover exciting content and moments of bravery.<br \/><br \/>Using the chiseled edge of a diamond to give the W the look of a cut jewel, the logo acts like a treasure at the end of the journey, the rewarding viewing experience of W. It&#8217;s a strong graphic shape that the channel can own, craft in many ways and it provides a graphic transition between environments.<\/blockquote><h3><a href=\"http:\/\/artandgraft.com\/portfolio\/w-channel-rebrand\" target=\"_blank\" rel=\"noopener noreferrer\">Art&amp;Graft project page<\/a><\/h3>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/w_channel_logo.jpg\" alt=\"New Name, Logo, and On-air Look for W by Art&amp;Graft\" \/>\n<figcaption>Logo detail.<\/figcaption>\n<\/figure>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/w_channel_logo_color_variations.jpg\" alt=\"New Name, Logo, and On-air Look for W by Art&amp;Graft\" \/>\n<figcaption>Color variations.<\/figcaption>\n<\/figure>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/w_channel_logo_angle.jpg\" alt=\"New Name, Logo, and On-air Look for W by Art&amp;Graft\" \/>\n<figcaption>Logo animation detail.<\/figcaption>\n<\/figure>\n<p>The previous logo and on-air look were designed by DixonBaxi and they were both pretty good &mdash; <a href=\"https:\/\/vimeo.com\/38232635\" target=\"_blank\" rel=\"noopener noreferrer\">here is a sample ident<\/a> &mdash; but since we are not necessarily comparing apples to apples as Watch and W seem to have different ambitions, we&#8217;ll just let the old stuff drift into the night.<\/p>\n<p>The new jewel-like &#8220;W&#8221; logo is fairly attractive. The chiseled letter is convincingly rendered and the diamond shape it sits in has an elegant glossy texture like an enamel pin and a very thin gold trimming that makes it feel premium. The blue color is soft and welcoming and the diamond pattern in the background provides an additional comforting feel. Without all the rendering, there is not much to the logo but since this lives mostly on screen it will always come in full display.<\/p>\n<p>The new name is a search engine nightmare &mdash; try a search for &#8220;W&#8221; &mdash; and will always depend on having UKTV appended to it, which may not be all that terrible but it does seem counterproductive. &#8220;Watch&#8221; wasn&#8217;t that much better, so maybe they don&#8217;t see it as a concern in general.<\/p>\n<blockquote>The design is constructed around a strong diamond shaped grid system; a hidden grid that is exposed by how softer, more luxurious textures rest upon it. The use of the grid and 3D finishes in this way allow us to encapsulate the many facets of the core audience and content, but also add a tactility not often found in channel branding.<\/blockquote><h3><a href=\"http:\/\/artandgraft.com\/portfolio\/w-channel-rebrand\" target=\"_blank\" rel=\"noopener noreferrer\">Art&amp;Graft project page<\/a><\/h3>\n<figure class=\"full\"><div class=\"video-container\"><iframe src=\"https:\/\/player.vimeo.com\/video\/154852930?color=ffffff&#038;byline=0&#038;portrait=0\" width=\"500\" height=\"279\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen><\/iframe><\/div>\n<figcaption>On-air package.<\/figcaption>\n<\/figure>\n<p>The on-air look is quite great, with the diamond pattern serving as the grid to reveal and place content in unconventional ways. Meaning, most channels&#8217; on-air looks are very horizontal and vertical but here, patterns and images swoop in diagonally and chunks of diamond pieces in the background show imagery through angled windows. An additional gold diamond is introduced to serve as the anchor and guiding device for the information and it sometimes converts into the logo &mdash; a lovely example of it at the 0:38 mark of the video above. The system only uses <a href=\"http:\/\/typography.net\/fontfamilies\/view\/30\" target=\"_blank\" rel=\"noopener noreferrer\">Wayfarer<\/a> by Jeremy Tankard, originally commissioned as a wayfinding system type family, which gives W an unexpected aesthetic distinction as it&#8217;s not the kind of font you usually see on air.<\/p>\n<blockquote>We wanted the W idents to be intelligent and multifaceted, like the audiences it would be speaking to, and take the viewer on a continuous journey through moments of everyday bravery. With our diamond motif as a transition point, this led us to think about using the idea of forward movement; moving outside of our comfort zone and pushing on regardless of obstacles which is reflected in the scenes we pass through. [&hellip;] Taking this concept and placing it in real-life scenarios led us to our final approach; creating an endless journey by looping together sections of multiple, diverse scenes.&#8221;<\/blockquote><h3><a href=\"http:\/\/artandgraft.com\/portfolio\/w-channel-rebrand\" target=\"_blank\" rel=\"noopener noreferrer\">Art&amp;Graft project page<\/a><\/h3>\n<figure class=\"full\"><div class=\"video-container\"><iframe src=\"https:\/\/player.vimeo.com\/video\/154854703?color=ffffff&#038;byline=0&#038;portrait=0\" width=\"500\" height=\"279\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen><\/iframe><\/div>\n<figcaption>Idents.<\/figcaption>\n<\/figure>\n<p class=\"end\">The idents are based on a continuos passage through narrow visual aisles masked by a diamond. The effect feels so simple and it&#8217;s beautifully done, going from scene to scene without missing a beat (or the right perspective). Overall, this is a very well executed identity and on-air look that tips to a women-centric audience but maintains a broad enough aesthetic and motion behavior to not have the dudes channel-surfing to the next sports channel.<\/p>","protected":false},"excerpt":{"rendered":"Originally launched as Watch in 2008 by UKTV with general entertainment programming, W, as it was renamed and relaunched last week, is officially &quot;UKTV&apos;s premium entertainment channel, offering audiences a dazzling mix of original factual entertainment formats&quot; but unofficially its&#8230;","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[9,66,26],"tags":[292,809,290],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/4499"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=4499"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/4499\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=4499"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=4499"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=4499"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}