{"id":4509,"date":"2016-02-22T06:03:31","date_gmt":"2016-02-22T12:03:31","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/new_logo_and_identity_for_the_met_by_wolff_olins.php"},"modified":"2016-02-22T06:03:31","modified_gmt":"2016-02-22T12:03:31","slug":"new_logo_and_identity_for_the_met_by_wolff_olins","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/new_logo_and_identity_for_the_met_by_wolff_olins.php","title":{"rendered":"New Logo and Identity for The Met by Wolff Olins"},"content":{"rendered":"<p><span class=\"red_100\">Review by Mark Kingsley.<\/span><\/p>\n<p>This is how they describe themselves:<\/p>\n<p><blockquote>The Metropolitan Museum of Art is the largest museum in the Western Hemisphere, and the world&#8217;s most encyclopedic art museum under one roof. Founded in 1870, its permanent collections, housed in 17 curatorial departments, embrace more than two million works of art spanning 5,000 years of world culture, from prehistory to the present, from every part of the globe, in all artistic media, and at the highest levels of creative excellence.<\/blockquote><h3>Metropolitan Museum of Art website<\/a><\/h3>\n<p>I have no argument with that. The museum is the closest thing I have to a spiritual wellspring in New York City. And it&#8217;s been that way to me, several times a month, for well over three decades.<\/p><!--more--><p>Early last week I received a robo-mailing from the museum inviting me to become a member and be one of the first to visit their new galleries on Madison Avenue. The building at this location was designed by modernist master Marcel Breuer in the mid-1960s and until 2014 was home to the Whitney Museum of American Art.<\/p>\n<p>Above the return address of this mailing was a strange thing: an odd wordmark made up of overly-ligatured letterforms with wide triangular serifs spelling out &#8220;THE MET.&#8221; Initially, this didn&#8217;t really register in my mind. It seemed to be a journeyman&#8217;s effort, neither awful nor awesome, but right down the middle and obviously the product of committee or second-thoughts. Over the years, I have befriended enough employees and ex-employees of the museum and have consistently heard of the politicking which runs rampant throughout. Which doesn&#8217;t surprise me. In 1997, the museum supported 91 curators. So I can well imagine the process which lead up to the wordmark.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/the_met_logo.png\" alt=\"New Logo and Identity for The Met by Wolff Olins\" \/>\n<figcaption>Logo detail.<\/figcaption>\n<\/figure>\n<p>Just after the mailing arrived, Justin Davidson, the classical music and architecture critic at <em>New York<\/em> magazine, fired the <a href=\"http:\/\/www.vulture.com\/2016\/02\/metropolitan-museums-new-logo-the-met.html\" target=\"_blank\" rel=\"noopener noreferrer\">first salvo<\/a> against the rebranding. His post identified Wolff Olins as the author the work, and basically called out the Met for imitating the Tate&#8217;s approach. The Tate had previously commissioned Wolff Olins to unite several disparate collections and buildings into one branded institution. Davidson also pointed out that the Met&#8217;s head of modern and contemporary art, Sheena Wagstaff, previously held the position of chief curator at Tate Modern. So obviously, Wolff Olins was an easy choice.<\/p>\n<p>In response to the past few days of typical backlash both The Met and Wolff Olins have released additional materials. But rather than quelling criticism, I fear the effect only reveals holes in the rebranding strategy and ultimately the resulting wordmark.<\/p>\n<blockquote>New designs will be put into use beginning March 1, and will include a clear graphic language comprised of custom fonts and colors. Our new logo no longer relies on symbols and, instead, is based on our commonly used name &#8220;The Met,&#8221; which has an immediacy that speaks to all audiences. It is an original drawing, a hybrid that combines and connects serif and sans serif, classical and modern letterforms. In this respect, it reflects the scope of the Museum&#8217;s collection and the inherent connections that exist within it.<\/blockquote><h3>The Met provided text<\/h3>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/the_met_logo_extensions.png\" alt=\"New Logo and Identity for The Met by Wolff Olins\" \/>\n<figcaption>Logo extensions for the other locations.<\/figcaption>\n<\/figure>\n<blockquote>The logo exploration was led by the choice of the new, more succinct name, The Met. The mark is a unique drawing inspired by the idea of making &#8216;connections&#8217; &#8212; helping users connect ideas across time and culture, across the collection, between themselves and the art they interact with. The letterforms are connected together in bespoke ways and combine both serif and sans-serif letterforms &#8212; a deliberate move to incorporate both classical and modern ideas, a nod to the fact that The Met spans 5,000 years of art.<\/blockquote><h3>Wolff Olins provided text<\/h3>\n<p>According to audience research, The Met&#8217;s deep collection was perceived as overwhelming and difficult to navigate. Therefore, Wolff Olins developed &#8220;a strategy focused on making the Museum more open and accessible to users, and more coherent as a holistic experience across the soon-to-be three locations.&#8221; The team and client developed a yet-to-be-revealed set of principles that guided how their engagement strategy could be activated, which then became the jumping off point to develop the visual identity system. The goal was to combine contrasting characteristics of The Met &#8212; &#8220;bold and elegant, modern and classical, accessible and wise.&#8221;<\/p>\n<p>An early decision was to call the museum &#8220;The Met.&#8221; Not the &#8220;Metropolitan Museum of Art.&#8221; The Met.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/the_met_maps_languages.png\" alt=\"New Logo and Identity for The Met by Wolff Olins\" \/>\n<figcaption>Maps in different languages.<\/figcaption>\n<\/figure>\n<p>This seems strange. I call it The Met. My friends call it The Met. But this is most likely specific to residents of New York City. As Parisians call it &#8220;le Beaubourg&#8221; while the rest of the world says &#8220;Centre Georges Pompidou,&#8221; I suspect most of the world knows it as the Metropolitan Museum of Art. This was generally confirmed over the weekend as I polled friends and students with international backgrounds.<\/p>\n<p>Basically, an odd, if not solipsistic, naming choice for such an international destination.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/the_met_logo_history.jpg\" alt=\"New Logo and Identity for The Met by Wolff Olins\" \/>\n<figcaption>A collage of previous identities, inaccurately presented as justification for the rebrand. Many of these elements appeared before the 1971 mark was introduced. (From Wolff Olins).<\/figcaption>\n<\/figure>\n<p>The new mark was drawn by <a href=\"http:\/\/alias.dj\/#\/menu\" target=\"_blank\" rel=\"noopener noreferrer\">Gareth Hague<\/a> and replaces one from 1971, based on <a href=\"http:\/\/www.metmuseum.org\/collection\/the-collection-online\/search\/336656\" target=\"_blank\" rel=\"noopener noreferrer\">a 1509 woodcut by Luca Pacioli<\/a>. The old mark conveyed the rationality and clear headedness of the Renaissance, the Enlightenment, and ultimately Modernism itself &#8212; an appropriate sentiment for an institution that celebrates human achievement, regardless of origin or expression.<\/p>\n<p>But the museum felt that this geometrically-constructed M was too reliant on symbolism. So instead, they wrote out the name as &#8220;an original drawing, a hybrid that combines and connects serif and sans serif, classical and modern letterforms. In this respect, it reflects the scope of the Museum&#8217;s collection and the connections that exist within it&#8221;.<\/p>\n<p>In other words the letters touch each other.<\/p>\n<p>Basically they swapped out capital-S Symbolism for the simplistic metaphor of &#8220;connections.&#8221; If you&#8217;ve ever seen a newspaper photograph of someone handing over a check while shaking hands, you understand how simple this symbolism is.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/the_met_sample_art.jpg\" alt=\"New Logo and Identity for The Met by Wolff Olins\" \/>\n<figcaption>Explanation for the use of red. (From Wolff Olins.)<\/figcaption>\n<\/figure>\n<p>So why red? According to the Wolff Olins press release, red was chosen &#8220;because it embodies passion and vitality, and has done across time and culture.&#8221; This was demonstrated via the above mood board of random selections from the collection. For such an encyclopedic institution, this rationale is inadequate and could apply to any other client with a red logo.<\/p>\n<p>So here&#8217;s a suggestion&#8230;<\/p>\n<p>Dr. Elena Phipps is a specialist in the history of textiles and has been associated with the museum since 1977. She has written and spoken wonderfully about <a href=\"https:\/\/www.youtube.com\/watch?v=Nqx5EHKfKtI\" target=\"_blank\" rel=\"noopener noreferrer\">cochineal red<\/a>, a color made from insects found in South America. After the Spanish conquest of the New World, cochineal red became the second most valuable export from the Americas after gold. Her chemical analysis of pieces in the museum&#8217;s collection helped prove the pigment&#8217;s global spread centuries before we even heard the word globalization.<\/p>\n<p>How perfectly appropriate for the Met.<\/p>\n<p>Also within their collection, the museum has a Frank Lloyd Wright interior (he signed his buildings with a red square)&#8230; a deep collection of <a href=\"http:\/\/www.metmuseum.org\/collection\/the-collection-online\/search\/251532\" target=\"_blank\" rel=\"noopener noreferrer\">Greek red-figure pottery<\/a>&#8230; numerous Chinese <a href=\"http:\/\/www.metmuseum.org\/collection\/the-collection-online\/search\/39901\" target=\"_blank\" rel=\"noopener noreferrer\">scroll paintings with red collector&#8217;s chops<\/a>&#8230; <a href=\"http:\/\/www.metmuseum.org\/collection\/the-collection-online\/search\/146206\" target=\"_blank\" rel=\"noopener noreferrer\">Christian Louboutin shoes<\/a>&#8230; the fugitive red lake pigment of <a href=\"http:\/\/www.metmuseum.org\/about-the-museum\/press-room\/exhibitions\/2015\/van-gogh-irises-and-roses\" target=\"_blank\" rel=\"noopener noreferrer\">Van Gogh&#8217;s &#8220;Irises and Roses,&#8221;<\/a> and so on.<\/p>\n<p>Red is perfect. And a better case for the color could &#8212; should &#8212; have been made. Especially when the client is an art museum.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/the_met_identity_elements.png\" alt=\"New Logo and Identity for The Met by Wolff Olins\" \/>\n<figcaption>Identity elements.<\/figcaption>\n<\/figure>\n<p>Now that we&#8217;ve explored the color strategy&#8217;s shortcomings, let&#8217;s focus on the mark itself. The manner in which it was drawn is, to me, irrelevant. This is where differences in taste arise and (what the current museum director calls) &#8220;logo obsessed zombies&#8221; feel compelled to discuss letterspacing. To some, the leading is too open. To others, the openness of the T&#8217;s make it look off balance. Personally, I focus on other things.<\/p>\n<p>First is the nagging sense that the choice of such a verging-on decorative type is part of a larger trend and more appropriate to a hipster magazine than a world class museum. Consider MM&#8217;s work for <a href=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/new_logo_and_identity_for_the_battery_by_mm.php#.VsrCFlJmhos\" target=\"_blank\" rel=\"noopener noreferrer\">The Battery<\/a> or the <a href=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/new_logo_and_identity_by_and_for_creature.php#.VsrCHlJmhos\" target=\"_blank\" rel=\"noopener noreferrer\">creative agency Creature&#8217;s<\/a> rebrand.<\/p>\n<p>Second is the thought that the mark represents 1970s typography making its way back into fashion. Especially the typography of paperbacks with tight, at times touching, letterspacing, available through companies like Photolettering and executed with <a href=\"http:\/\/www.druckkunst-museum.de\/Composing_Techniques\/articles\/404.html\" target=\"_blank\" rel=\"noopener noreferrer\">phototypesetting<\/a> devices.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/the_met_70s_paperbacks.jpg\" alt=\"New Logo and Identity for The Met by Wolff Olins\" \/>\n<figcaption>The glories of 1970s typesetting.<\/figcaption>\n<\/figure>\n<p>It seems like a trend. Vinyl is making a comeback, HBO has a show about the era, and Marc Jacobs&#8217; most recent collection featured platform shoes. So why associate the wordmark for an eternal client with a single decade?<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/the_met_other_materials.jpg\" alt=\"New Logo and Identity for The Met by Wolff Olins\" \/>\n<figcaption>Other materials.<\/figcaption>\n<\/figure>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/the_met_website.jpg\" alt=\"New Logo and Identity for The Met by Wolff Olins\" \/>\n<figcaption>Website.<\/figcaption>\n<\/figure>\n<p>I once heard a story about Wolf Olins&#8217; work for the <a href=\"http:\/\/www.underconsideration.com\/speakup\/archives\/003489.html\" target=\"_blank\" rel=\"noopener noreferrer\">2012 London Olympics<\/a> &#8212; probably one of the more polarizing identities in the last 20 years. The story goes that the creative director on the project attended the wedding of a friend who had cut his hair into an abominable, asymmetrical, bordering-on-horrifying style. When asked why he did this, the response was that in every photograph of this man, one could identify the decade based on the haircut. And since this day was so special, he wanted to elevate the photographic documentation into something so unique that it would become, in a sense, eternal. And so, following that example, he created the distinctive system for the Olympics.<\/p>\n<p>I don&#8217;t know if this story is true, but even if false, it still captures the audacious creativity that I&#8217;ve come to admire about Wolff Olins. Their fearlessness, combined with thoughtfulness, has produced many examples of world-class work. And we hate them because we envy them so.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/the_met_Campbell_instagram_01.jpg\" alt=\"New Logo and Identity for The Met by Wolff Olins\" \/>\n<figcaption>Zombies!? How petulant.<\/figcaption>\n<\/figure>\n<p>In preparing this piece, I found myself going through the social media accounts for both the museum and its director, Thomas P. Campbell. The zombie comment above is a rare bit of pique from someone who has spoken eloquently about bridging the perceived elitism of an art museum.<\/p>\n<blockquote>The Great Hall at the Met is one of the great portals of the world, awe-inspiring, like a medieval cathedral. From there, you can walk in any direction to almost any culture. I frequently go out into the hall and the galleries and I watch our visitors coming in. Some of them are comfortable. They feel at home. They know what they&#8217;re looking for. Others are very uneasy. It&#8217;s an intimidating place. They feel that the institution is elitist. I&#8217;m working to try and break down that sense of that elitism. I want to put people in a contemplative frame of mind, where they&#8217;re prepared to be a little bit lost, to explore, to see the unfamiliar in the familiar, or to try the unknown. Because for us, it&#8217;s all about bringing them face to face with great works of art, capturing them at that moment of discomfort, when the inclination is kind of to reach for your iPhone, your Blackberry, but to create a zone where their curiosity can expand.<\/blockquote><h3><a href=\"https:\/\/www.ted.com\/talks\/thomas_p_campbell_weaving_narratives_in_museum_galleries?language=en\" target=\"_blank\" rel=\"noopener noreferrer\">Campbell at a 2012 TED Talk<\/a><\/h3>\n<p>This contrasts directly with the museum&#8217;s previous director, Philippe de Montebello, <a href=\"http:\/\/www.newyorker.com\/magazine\/1997\/11\/24\/the-importance-of-being-elitist\" target=\"_blank\" rel=\"noopener noreferrer\">who saw elitism as a crucial requirement for democracy<\/a>. But while he did have that air, de Montebello oversaw projects that doubled the museum&#8217;s size and acquired significant collections and individual masterpieces. And before de Montebello, director Thomas Hoving basically invented the blockbuster exhibition with &#8220;The Treasures of Tutankhamun&#8221; &#8212; which inspired the classic <a href=\"http:\/\/www.nbc.com\/saturday-night-live\/video\/king-tut\/n8663\" target=\"_blank\" rel=\"noopener noreferrer\">Steve Martin sketch on Saturday Night Live<\/a>.<\/p>\n<p>So between the Dionysian Hoving and the Apollonian de Montebello, Campbell is challenged to establish his imprimatur. I wonder whether the addition of the Met Breuer (which most likely was the impetus for this rebrand) will have that much effect on the museum&#8217;s position in post-war art. There will be more exhibition space, but the collection still lags behind the Museum of Modern Art and the Tate Modern. Any acquisitions to fill holes could be seen as playing catch up.<\/p>\n<p>And they can&#8217;t fully claim the cutting edge of contemporary art. That belongs to MoMA, the Whitney, and the New Museum. So here they are: in a difficult in-between place. The new building, The Breuer, represents something&#8230; but so early in the game, it&#8217;s hard to confidently define what that something is. Plus, the Whitney still owns the building and right now, The Met only has an eight year commitment.<\/p>\n<p>There&#8217;s a lot riding on this expansion, and a lot riding on this rebranding: the perception of the museum&#8217;s relevance, the definition of the Campell era, the need to draw in enough visitors to help pay for the expansion, and holding all competing museums at bay. Given what seems to be thin strategy work, perhaps there&#8217;s an element of branding cart going before the programming horse.<\/p>\n<p class=\"end\">Cart&#8230; before horse&#8230; Good idea for a painting.<\/p>\n<p><span class=\"gray_70\">Mark Kingsley is owner of the boutique creative studio <a href=\"http:\/\/www.malcontent.com\" target=\"_blank\" class=\"gray_70_to_red_70\" rel=\"noopener noreferrer\">Malcontent<\/a>. Previously, he was Landor&#8217;s global creative lead on the Citi account and creative director for Lendoor, a fin-tech startup. He is an instructor in the Masters in Branding program at SVA, currently teaching a workshop in criticism as applied to brand thinking. The name of the class is Logo Insignifica.<\/span><\/p>","protected":false},"excerpt":{"rendered":"Review by Mark Kingsley. This is how they describe themselves: The Metropolitan Museum of Art is the largest museum in the Western Hemisphere, and the world&apos;s most encyclopedic art museum under one roof. Founded in 1870, its permanent collections, housed&#8230;","protected":false},"author":5,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[9,63,26],"tags":[406,327,115,309,33,180],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/4509"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=4509"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/4509\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=4509"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=4509"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=4509"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}