{"id":458,"date":"2006-11-20T09:26:37","date_gmt":"2006-11-20T15:26:37","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/taking_the_fuji_out_of_fujifil.php"},"modified":"2006-11-20T09:26:37","modified_gmt":"2006-11-20T15:26:37","slug":"taking_the_fuji_out_of_fujifil","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/taking_the_fuji_out_of_fujifil.php","title":{"rendered":"Taking the Fuji out of FujiFilm"},"content":{"rendered":"<p><img loading=\"lazy\" alt=\"fujifilm_logo.gif\" src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/fujifilm_logo.gif\" width=\"470\" height=\"200\" \/><\/p>\n<p><span class=\"small\"><strong>Guest Editorial by John Feldhouse<\/strong><\/span><\/p>\n<p>The new <a href=\"http:\/\/www.fujifilm.com\" target=\"_blank\" rel=\"noopener noreferrer\">Fujifilm<\/a>  identity was released on October 1st and carries a major update from the 1980s  Landor design. The highly recognizable &#8220;film box&#8221; has been replaced with a stark  typographic treatment with one minimal element of color. One should ask, &#8220;Is less  really more?&#8221; Fujifim was founded in 1934 as Fuji Photo Film Co., Ltd. From 1962  to 1990 Fujifilm established a number of divisions worldwide. It was in 1960 that  Fujifilm updated their logo to the now familiar red and abandoning their original  mark. In 1980 Fujifilm again changed their logo to the recognizable film box logo  created by Landor. As Fujifilm continued to grow and become a juggernaut in the  film industry, they decided to update their logo in 1992 with adding text to the  film box. And in 2006, Fujifilm decided to abandon the Fuji Box and go with a  pure typographic treatment.<\/p><!--more--><p><img loading=\"lazy\" alt=\"fujifilm_past_logos.gif\" src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/fujifilm_past_logos.gif\" width=\"470\" height=\"140\" \/><\/p>\n<p>It should be noted that after continued attempts to contact Fujifilm, they  never responded back so the designer or firm still remains unknown.<\/p>\n<p>With  such a classic identity recently leaving the shelf with Kodak, Fujifilm wasted  no time in updating theirs as well. With Kodak going to a typographic mark, one  would think Fujifilm would steer in a different direction, however, this is not  the case. Both marks are extremely similar: they are both geometric sans typefaces,  both use red as a graphic element, they no longer use a symbol in the identity,  and both draw from their predecessors. The ironic part about these identities  is neither one is ground-breaking in an industry leading the way with ground-breaking  products. <\/p>\n<p>Fujifilm&#8217;s new mark uses a trendy typeface while creating a rough-looking  box. When scaled to various sizes the mark works well large, but fails at a smaller  size. The box is lost at the smaller size, as shown on their web site, but the  typography seems to work very well. The attention to detail with the typeface  proportions is remarkable. The kerning is nearly perfect and the weight ratio  works very well. In the <a href=\"http:\/\/www.fujifilm.com\/news\/n060712.html\" target=\"_blank\" rel=\"noopener noreferrer\">press  release<\/a>, Fujifilm states that they will continue to use the traditional green  for its corporate color which may help with the branding aspect. Only time will  tell how well the newly implemented logo will work.<\/p>\n<p>So the once familiar  identity landscape in the film industry has been turned upside down in a matter  of months. It seemed inevitable as many major corporations are refreshing their  look to keep up with the times. Whether we as designers like or dislike the new  Fujifilm identity, one thing remains constant with it: change. It is this change  that we as designers struggle with especially when our so-called &#8220;treasured identities&#8221;  are touched. Fujifilm has gone through its own evolution with its identity and  we should expect more changes in years to come. Rather than dismissing the new  logo outright, we should embrace the changes and realize what we can take from  the new identity. Each one of us will see something that can be improved, however,  we can&#8217;t change it. The only thing we can do is keep challenging ourselves to design  at the highest level possible.<\/p>\n<p><span class=\"small\"><strong><a href=\"http:\/\/www.feldhouse.net\" target=\"_blank\" rel=\"noopener noreferrer\">John Feldhouse<\/a> graduated from Auburn University in 2005 and is currently working at Radiant Systems, a technology company based in Atlanta, GA. <\/strong><\/span><\/p>","protected":false},"excerpt":{"rendered":"<img src=\"https:\/\/www.underconsideration.com\/brandnew\/images\/excerpt_empty.gif\" alt=\"Excerpt Empty\" \/>","protected":false},"author":5,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[9,26,88],"tags":[],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/458"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=458"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/458\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=458"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=458"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=458"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}