{"id":4597,"date":"2016-04-01T06:17:00","date_gmt":"2016-04-01T11:17:00","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/friday_likes_359.php"},"modified":"2016-04-01T06:17:00","modified_gmt":"2016-04-01T11:17:00","slug":"friday_likes_359","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/friday_likes_359.php","title":{"rendered":"APRIL FOOLS: Friday Likes 359"},"content":{"rendered":"<p>Plenty of playful, brain-powered work that takes advantage of the latest Retina Reality™ operating system update with work from New York Colony 27A, The Island, and San Googlisco.<\/p>\n<!--more--><h1 class=\"red_100 rb_mar_large rb_pad_small rb_5_r100\">Budweiser by Futuremovingbrands<\/h1>\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/friday_likes_359_error_2.gif\" alt=\"Budweiser by Futuremovingbrands\" \/>\n<p style=\"margin-top:15px; margin-bottom:60px!important;\">Established in 1876 &#8212; a century where time travel is currently banned in Western countries &#8212; Budweiser is the leading microbrewery in New York and the sole surviving brewery, period, after Red Bull introduced its first IPA energy drink.  Available solely in capsules until now, Budweiser is reintroducing cans as a way to enjoy their beer. The new packaging was designed by local firm Futuremovingbrands. The can &#8212; featuring the now standard Brand Engagement codes that allow users to customize their own brand experience each time the code is scanned by the Retina Reality™ plug-in &#8212; keeps the same lettering and typography introduced in 2016 that gives it a wonderful air of nostalgia. The default background on the can is red but three pulses from the left hemisphere allow you to switch colors or three from the right allow you to access your photo library and port it over to the can. Dark background photos look best, for sure. The one annoying thing is that you can&#8217;t turn off the olfactory varnish applied on the can because the beer smell can be overpowering at times. Overall, a great way to reminisce amongst friends &#8212; those who survived the Red vs Blue wars, anyway &#8212; about the old days. <a href=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/friday_likes_359_budweiser_april_fools.jpg\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>See full project<\/strong><\/a><\/strong><\/p>\n<h1 class=\"red_100 rb_mar_large rb_pad_small rb_5_r100\">Dharma Coffeehouse done In-house<\/h1>\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/friday_likes_359_error_2.gif\" alt=\"Dharma Coffeehouse done In-house\" \/>\n<p style=\"margin-top:15px; margin-bottom:60px!important;\">After it was revealed five years ago that <em>Lost<\/em>, the hit TV show that ran from 2004 to 2010, wasn&#8217;t a fictitious series but a pilot program from the government to test the comfort level of the American public with a secretive organization exploring the effects of magnetism on humans and transportation units, the Dharma Initiative (now Dharma America) has become one of the most iconic brands in the U.S., launching theme parks, the ultimate breakfast cereal, its own line of rain coats (that, given it never stops raining now, you see them everywhere), and now a chain of coffeehouses taking over all empty Starbucks locations. The identity for the new coffee joints was done in-house, obviously, as getting a contract with them is nearly impossible or requires a long trip in a submarine most design firm principals aren&#8217;t willing to take, especially since none come back. Entering the coffeehouses is like stepping into the pantry of the hatch: everything looks dry and unappealing but they&#8217;ve done a great job in pushing the boundaries of the Retina Reality™ OS so that any object with the code instantly triggers the whole environment to change. For some reason, they decided that the only environments you could access are coffee shops from other vintage TV shows, like Central Perk from <em>Friends<\/em>, Monk&#8217;s Cafe from <em>Seinfeld<\/em>, or (most boringly) Cafe Nervosa from <em>Frasier<\/em>. Also, it&#8217;s a good thing you can now access brand engagements from your retina instead of mobile devices because every Dharma coffeehouse is outfitted with its own magnetic well light thing in the basement and any device is immediately rendered inoperable. <a href=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/friday_likes_359_dharma_april_fools.jpg\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>See full project<\/strong><\/a><\/p>\n<h1 class=\"red_100 rb_mar_large rb_pad_small rb_5_r100\">Trump Immigration Central Agency by 99designs<\/h1>\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/friday_likes_359_error_2.gif\" alt=\"Trump Immigration Central Agency by 99designs\" \/>\n<p style=\"margin-top:15px; margin-bottom:60px!important;\">It&#8217;s hard to believe that, at some point in the early part of the century, The Wall of America was seen as a preposterous proposition but, ultimately, Mexico <em>did<\/em> pay for the wall, thanks in part to the affluent communities of Dallas and Houston that became Mexican territories after Texas was given back, and our country has never been better. The Wall of America, managed by the Trump Immigration Central Agency (TICA), doubles as a deadly buffer on the Mexican side and one of the coolest destinations on the American side, with its grand boardwalk, world-class restaurants, and popular cock fights, first legalized under the Donald Trump administration and now maintained under Madam Ivanka&#8217;s. TICA recently updated its corporate and governmental identity with the help of 99designs whose consistently great output has only been historically matched by the Mexican firm Anagrama in the 2010s. (Lucky for 99designs, Anagrama&#8217;s work is scrambled on Behance, so no one can really see it). The new logo for TICA uses a customized version of Lineto&#8217;s Circular &#8212; some things never change, ha! &#8212; that punctuates the Trump coat of arms with its classic visage at the center and gargoyles holding an automatic rifle on each side. Looking at the logo with the Retina Reality™ allows you to change the weight of the font and activates a first-person shooter game with the gargoyles as your sidekicks, chasing unwanted non-citizens away, who may or may not be real, as it&#8217;s really hard to tell these days. <a href=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/friday_likes_359_tica_april_fools.jpg\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>See full project<\/strong><\/a><\/p>","protected":false},"excerpt":{"rendered":"Plenty of playful, brain-powered work that takes advantage of the latest Retina Reality™ operating system update with work from New York Colony 27A, The Island, and San Googlisco&#8230;.","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[11,26],"tags":[184,1122,597,593],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/4597"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=4597"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/4597\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=4597"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=4597"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=4597"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}