{"id":4673,"date":"2016-05-11T06:12:40","date_gmt":"2016-05-11T11:12:40","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/new_icon_for_instagram_done_in_house.php"},"modified":"2016-05-11T06:12:40","modified_gmt":"2016-05-11T11:12:40","slug":"new_icon_for_instagram_done_in_house","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/new_icon_for_instagram_done_in_house.php","title":{"rendered":"New Icon for Instagram done In-house"},"content":{"rendered":"<p>Launched in 2010, <a href=\"https:\/\/www.instagram.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Instagram<\/a> needs little introduction, especially as it&#8217;s become the preferred social media platform for most users thanks to its simple interface, highly visual timeline, and despite its growing amount of &#8220;Sponsored&#8221; posts. Not as huge as its parent company, Facebook, Instagram has 200 million daily active people &#8212; which is not total users, but the amount of people that come back to the app every single day, spending an average of 21 minutes on it. (Data provided by Instagram.) I don&#8217;t know if I spend 21 minutes daily on it but I do check it an obnoxious amount of times a day. <a href=\"http:\/\/blog.instagram.com\/post\/144198429587\/160511-a-new-look\" target=\"_blank\" rel=\"noopener noreferrer\">Today Instagram is introducing<\/a> an update to its user interface and changing (dramatically) its app icon for the first time since launch. The script wordmark <a href=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/hand_beats_filter_in_new_instagram_wordmark.php\" target=\"_blank\" rel=\"noopener noreferrer\">redesigned in 2013<\/a> remains the same.<\/p> <!--more--><blockquote>We realized we needed to move past a rendered camera to get a flexible, scalable glyph, but the previous glyph proved to be a weak basis for an icon. To maintain the previous icon&#8217;s gravity, we had to figure out how to give the new mark more character while also removing what was unnecessary.<br \/><br \/>The question then became, how far do we go? If you abstract too much, the glyph doesn&#8217;t feel tied to the history and soul of Instagram. If you make it too literal, it&#8217;s hard to justify changing from what we currently have.<br \/><br \/>After a lot of refinement, we landed on a glyph that still suggests a camera, but also sets the groundwork for years to come.<\/blockquote><h3><a href=\"https:\/\/medium.com\/@ianspalter\/designing-a-new-look-for-instagram-inspired-by-the-community-84530eb355e3\" target=\"_blank\" rel=\"noopener noreferrer\">Ian Spalter, Head of Design at Instagram, on Medium<\/a><\/h3>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/instagram_2016_icon.jpg\" alt=\"New Icon for Instagram done In-house\" \/>\n<figcaption>Icon detail.<\/figcaption>\n<\/figure>\n<figure class=\"full\"><div class=\"video-container\"><video autoplay loop><source src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/instagram_2016_icon_evolution_small.mp4\" type=\"video\/mp4\">Your browser does not support the video tag.<\/video><\/div>\n<figcaption>Evolution from old to new icon.<\/figcaption>\n<\/figure>\n<figure class=\"full\"><div class=\"video-container\"><iframe src=\"https:\/\/player.vimeo.com\/video\/166138104\" width=\"640\" height=\"360\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen><\/iframe><\/div>\n<figcaption>Process of the evolution.<\/figcaption>\n<\/figure>\n<p>The skeuomorphic camera icon that has accompanied Instagram until today is a modern-day classic. Not because it&#8217;s good &#8212; it&#8217;s not, really &#8212; but because of its omnipresence in users&#8217; phone screens. I bet it&#8217;s on the home screen of 99% of people who have the app and who tap it very regularly. When the iPhone first came out &#8212; if you&#8217;ll remember &#8212; skeuomorphism was the default aesthetic and now, for better or worse, it&#8217;s all about flat design with a dash of optional gradients so it&#8217;s no surprise that&#8217;s where Instagram has headed. If there was any surprise it&#8217;s that Instagram held on to the skeuomorphism for a relatively long five years.<\/p>\n<p>I doubt anyone will be making <a href=\"https:\/\/www.google.com\/search?q=instagram+logo+cake\" target=\"_blank\" rel=\"noopener noreferrer\">cakes and cookies<\/a> in the shape of the new Instagram logo and that&#8217;s the biggest problem the new logo faces: it&#8217;s not the old logo. The ensuing shitstorm on the internet today will be epic. About 75% of the negative reaction will be simply to the fact that it has changed and the other 25% will be to the not-quite-fact that there is a generic aesthetic to the new icon where it could be a &#8220;camera&#8221; icon for the upcoming smart microwave from Apple or whatever other user interface you would imagine. This is not to say it&#8217;s a bad-looking icon, no&#8230; as far as camera icons go, this is quite lovely and has the minimal amount of elements necessary to be recognized as a camera BUT not the minimal amount of elements necessary to be recognized as Instagram.<\/p>\n<p>Unlike Uber, that replaced it&#8217;s &#8220;U&#8221; for a metaphysical atom, the change here is only aesthetic. It&#8217;s still a camera. Yes, at first it will be hard to recognize it, but when you have 200 million people tapping on it everyday, multiple times a day, that&#8217;s the kind of brand engagement that Coca-Cola or Nike would kill for. When it comes to &#8220;brand impressions&#8221; and &#8220;brand touchpoints&#8221;, Instagram (and Facebook and Twitter and, yes, even Uber) have no shortage of opportunities so it will only be a matter of time &#8212; three months, probably &#8212; before this is known, recognized, and considered as <em>the<\/em> Instagram app icon. Simply by repetition and usage. Hell, I was starting to get used to the Uber icon until they pulled out of Austin this Monday.<\/p>\n<p>Execution-wise, the camera icon is fine as I already mentioned. It has pleasant curves, the lens and viewfinder are in the right place with the right proportions and I&#8217;ve rarely met a yellow-magenta-purple-blue gradient I didn&#8217;t like. This one will look particularly good in those juicy iPhone retina displays.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/instagram_2016_icon_before_after_glyph.jpg\" alt=\"New Icon for Instagram done In-house\" \/>\n<figcaption>Comparison with the previous &#8220;glyph&#8221; offered by Instagram as the preferred icon to refer to it on other websites.<\/figcaption>\n<\/figure>\n<p>One thing I found interesting is the lack of mention on the Instagram posts of the &#8220;glyph&#8221; above, which I always found to be a smart translation of the full icon and how different the new icon feels from it. I don&#8217;t think the old one had the presence to stand as the official app icon but I just wanted to give it a nod as a highly functional reduction of the logo. Although it did speak to the necessity of having a flat logo that could be used both in large and small applications just like Twitter&#8217;s bird and Facebook&#8217;s &#8220;f&#8221;, which is where the glyph competes for attention.<\/p>\n<blockquote>Our family of apps &#8211; Layout, Boomerang, and Hyperlapse &#8211; also have a new, unified look. We carried the gradient through each icon, and designed them on the same grid to make the system feel cohesive. We also updated the Layout and Boomerang icons to better represent what the apps help you create &#8211; a composition of photos, or a mini video that loops forward and backward. <\/blockquote><h3><a href=\"https:\/\/medium.com\/@ianspalter\/designing-a-new-look-for-instagram-inspired-by-the-community-84530eb355e3\" target=\"_blank\" rel=\"noopener noreferrer\">Ian Spalter, Head of Design at Instagram, on Medium<\/a><\/h3>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/instagram_2016_icon_family.jpg\" alt=\"New Icon for Instagram done In-house\" \/>\n<figcaption>Family of icons with Layout, Hyperlapse, and Boomerang.<\/figcaption>\n<\/figure>\n<p>Of the few things shown about the redesign, this might be the highlight: a unified set of app icons for the three sister apps. Same thickness, same gradient, same layout within the app square. Simple, effective, and recognizable as a family.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/instagram_2016_ui.jpg\" alt=\"New Icon for Instagram done In-house\" \/>\n<figcaption>New app user interface.<\/figcaption>\n<\/figure>\n<p>Since I wrote this review before the update went live, I don&#8217;t have a full sense of how the new user interface feels but I like the color-less approach that lets the photos be the main focus on the screen, instead of having all those blues coming at you. I&#8217;m surprised the camera icon on the user interface isn&#8217;t the new icon &#8212; seems like an easy way to double-down on it. But I also understand that one thing is brand and one thing is functionality.<\/p>\n<p class=\"end\">Overall, we all knew this day would come and that no icon would ever match the short-range nostalgia that the old icon evokes resulting in instant rejection of the new one but, from all the 2015 &#8211; 16 design standards, this is as good as it gets with a simple, friendly, gradienty icon. Now, if you&#8217;ll excuse me, I have to see what other people are doing that I&#8217;m not.<\/p>","protected":false},"excerpt":{"rendered":"Launched in 2010, Instagram needs little introduction, especially as it&apos;s become the preferred social media platform for most users thanks to its simple interface, highly visual timeline, and despite its growing amount of &quot;Sponsored&quot; posts. Not as huge as its&#8230;","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[9,26,92],"tags":[1274,46,105],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/4673"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=4673"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/4673\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=4673"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=4673"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=4673"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}