{"id":470,"date":"2006-12-29T10:40:17","date_gmt":"2006-12-29T16:40:17","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/fluxuantingly_fluxing_flux.php"},"modified":"2006-12-29T10:40:17","modified_gmt":"2006-12-29T16:40:17","slug":"fluxuantingly_fluxing_flux","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/fluxuantingly_fluxing_flux.php","title":{"rendered":"Fluxuantingly Fluxing Flux"},"content":{"rendered":"<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/flux_logo.gif\" alt=\"flux Logo, Before and After\" \/><\/p>\n<p>Not all rebrandings and logo redesigns have to happen on a larger than life scale, some happen in small offices under the guidance of a small group of people&hellip; sometimes only &mdash; gasp &mdash; just one person and, the change, only mattering to a diminutive audience. Nonetheless, the results are equally interesting. Such is the case with the work that John Walsh, of <a href=\"http:\/\/www.holdenandfriends.com\" target=\"_blank\" rel=\"noopener noreferrer\">holdenandfriends<\/a> in Knutsford, Cheshire, did for <a href=\"http:\/\/www.fluxmagazine.com\/\" target=\"_blank\" rel=\"noopener noreferrer\"><em>flux<\/em> magazine<\/a> &mdash; an independent publication covering fashion, music, art and culture &mdash; recently, redesigning the logo and the magazine from the outside in.<\/p><!--more--><p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/flux_magazine.jpg\" alt=\"flux Magazine Cover, Before and After\" \/><\/p>\n<p>Needless to say, the change is startling and a vast improvement. The original logo, designed by the editor of the magazine, looks more appropriate for a skateboard or surfing magazine with its italicized F in a circle; the word FLUX was too tightly set, creating a not ha-ha funny ligature between the F and the L; and the logo on the cover just didn&#8217;t fill up the space appropriately, or strikingly. The new logo, in contrast, is bold, unique and deliciously letter-spaced, optimizing the usually uncomfortable spaces to the right of Ls and the left of Xs with a smooth, inherent curve. By maintaining (but repurposing) the &ldquo;dot&rdquo;, the logo retains a unique identifier to the original while establishing it as a defining element of the magazine&#8217;s identity. With such a superficially simple and effortless-looking logo I decided to ask John Walsh a few questions to learn more about his process and this project.<\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/flux_sketch.jpg\" alt=\"flux Sketch\" \/><\/p>\n<p><strong><span class=\"red\"><span class=\"small\">BN:<\/span>  The most evident part of the redesign is that it kept the &ldquo;dot&rdquo; that was in the original logo, what was some of the thinking around this?<\/span><\/strong><\/p>\n<p><span class=\"small\">JW:<\/span>  The big idea around this logo came from the word Flux itself, something that is constantly changing but in the context of this particular magazine, revolving around one fixed point: &bull; being the only fixed point and the only constant thing, the main focus of attention that ties everything else together. I have suggested that in future issues the logo will pivot around this point, so that it might be down the side or at an angle, or even swing round onto the back cover. But whether they will let me be that adventurous is to be seen.<\/p>\n<p><strong><span class=\"red\"><span class=\"small\">BN:<\/span> From your web site, it seems that holdenandfriends also designed the original, how has the relationship with the client evolved? And, was it strange to replace your own design?<\/span><\/strong><\/p>\n<p><span class=\"small\">JW:<\/span>  The editor of <em>flux<\/em> designed the original logo, but over the years I have been commissioned to work on the covers and various spreads. Each time I worked with them, I told them that I wasn&rsquo;t too sure about the logo and in my own mind I knew it would be the right thing to develop the magazines&rsquo; identity.<\/p>\n<p>The relationship with <em>flux<\/em> originally started four years ago when I was interviewed by them, having landed on the graphics scene in Manchester with a letterpress studio and a laptop and I&rsquo;d just produced my first commission which was Factory Records last ever invitation. So, <em>flux<\/em> did a piece on me, then I went round for a chat with the editor and that&rsquo;s when it all began. I got a call the day after saying that the magazine was ready to go to print but they didn&rsquo;t know what to do with the cover, so I sorted it out in the same afternoon. It was a great opportunity and I went on to produce the next eight covers which I loved working on, I was given the title of the issue and a vague roundup of the content, then I would go away, write a short description of how I saw it looking with a very rough visual, built a team around the idea and brought it to life mixing letterpress, photography, pen and ink, typography, whatever felt right at the time.    <\/p>\n<p>Then I disappeared off the Manchester landscape to look after holdenandfriends in Knutsford. It wasn&rsquo;t until 2 months ago that I bumped into the editor of <em>flux<\/em> in the street again, the next day I got this message:<\/p>\n<blockquote><span class=\"small\"><strong>\nHi John,<br \/>\nGood to see you yesterday. Just thought to contact you about this.<br \/>\nWe are thinking about changing our Flux logo. We have been for a bit.<br \/>\nWe want something bold, classic, timeless. But still somehow contemporary  <br \/>\nand forward looking. It is very hard we have gone over it many, many times <br \/>\nand had designers looking at it. Minimal, kind of early Modernist but still a <br \/>\nlittle unique and up to date. It&#8217;s very hard. It also has to realistically <br \/>\nsell to people in shops on front of an A4 magazine.<br \/>\nWhat do you reckon? Is it something you can help with?<br \/>\nLee<br \/>\n<\/strong><\/span><\/blockquote>\n<p>&hellip;So I invited them over to my new office for a brew, told them that I would only present them with one idea, which I did, they liked it, I developed it and they loved it. I should also mention that the job didn&rsquo;t stop there, I recommended that they can&rsquo;t just change their logo and leave the rest as it is, so I became their official Art Director and Designer, started from scratch and rebuilt the entire structure of the magazine and now I&rsquo;m looking forward to working on the next issue.<\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/flux_drawings.jpg\" alt=\"flux drawings\" \/><\/p>\n<p><strong><span class=\"red\"><span class=\"small\">BN:<\/span> Did you see any marked differences in designing a logo for a magazine as opposed to a logo for a company or product?<\/span><\/strong><\/p>\n<p><span class=\"small\">JW:<\/span>  I think that I approach every project on an individual basis, the reason people come to me is for a bespoke service (they are not just going to get a typeface and a color palette), I get under the skin of whatever the project is, saturate myself in their world and experience, then go for a wander, shut off and see what happens. I make every single mark have a reason for being where it is and try to imagine every eventuality across all media. For &bull; FLUX I did approach it so that up close you get the subtleties of the line and from a distance, it reads bold and clear. I don&rsquo;t really know if I saw this as a logo in the traditional sense, I haven&rsquo;t put any guidelines together for it. So the possibilities as a point of departure, because it is a fluctuating magazine, can have more scope than a company or product logo, and because I&rsquo;m not just going to hand it over and be on my way, I can guide it carefully in the appropriate direction, we&rsquo;ll just have to see what happens next with a dot and four letters.<\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/flux_development.gif\" alt=\"flux Development\" \/><\/p>\n<p><strong><span class=\"red\"><span class=\"small\">BN:<\/span> Tell us a bit about the typography in the logo and how it came about.<\/span><\/strong><\/p>\n<p><span class=\"small\">JW:<\/span> The typography was originally based on Franklin Gothic, over 100 years old and still looking as fresh as a daisy. Strong, solid, clear, no messin&rsquo;. Then it was a matter of getting it flowing together smoothly, focusing on the shapes of each character and almost morphing them into each other so that it wasn&rsquo;t just four independent letters but one seamless sculptural piece. This involved a lot of squinting and standing back until it felt right.<\/p>\n<p>Which is my main philosophy when designing: <strong>1.<\/strong> Do it <strong>2.<\/strong> Stand back <strong>3.<\/strong> Squint <strong>4.<\/strong> If it feels right, it is right. Simple.<\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/images\/divider_hor_single.gif\" \/><\/p>\n<p><span class=\"small\">John Walsh is an independent art director and designer based in Manchester, UK.<br \/>\nHe has been involved in 500+ projects across all media, he just says yes and gets the job done.<br \/>\n18 months ago he joined holdenandfriends as creative director.<br \/>\nQualifications include an MA in creative technology and a BA in graphic design.<br \/>\nHe teaches 1 day a week on the Design and Art Direction Degree course at Manchester Metropolitan University.<br \/>\nHe has a 2 year old son called Elijah.<\/span><\/p>","protected":false},"excerpt":{"rendered":"<img src=\"https:\/\/www.underconsideration.com\/brandnew\/images\/excerpt_empty.gif\" alt=\"Excerpt Empty\" \/>","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[9,82,26],"tags":[],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/470"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=470"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/470\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=470"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=470"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=470"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}