{"id":507,"date":"2007-06-09T17:43:55","date_gmt":"2007-06-09T22:43:55","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/the_united_states_of_animalia.php"},"modified":"2007-06-09T17:43:55","modified_gmt":"2007-06-09T22:43:55","slug":"the_united_states_of_animalia","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/the_united_states_of_animalia.php","title":{"rendered":"The United States of Animalia"},"content":{"rendered":"<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/hsus_logo.gif\" alt=\"The Humane Society of the United States Logo, Before and After\" \/><\/p>\n<p>If you hate and mistreat animals, please stop reading now and go bang your head against a brick wall. If, on the other hand, you love animals and are offended and saddened when hearing stories of cruelty or mistreatment of our often furry companions on earth, I have a great logo to cheer you up. <a href=\"http:\/\/www.hsus.org\" target=\"_blank\" rel=\"noopener noreferrer\">The Humane Society of the United States<\/a> (HSUS), &#8220;the nation&#8217;s largest animal protection organization with more than ten million members and constituents&#8221;, now serving animals for more than 53 years, recently updated their previous bureaucratic-looking identity for a lively, all-encompassing new identity full of proud fauna.<\/p><!--more--><p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/hsus_logo_detail.gif\" alt=\"The Humane Society of the United States Logo Detail\" \/><\/p>\n<p>The overall identity, collateral and advertising job was done by the Chicago office of <a href=\"http:\/\/www.eurorscg.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Euro RSCG<\/a>, and the rendering of this American Animal Kingdom was executed by California-based <a href=\"http:\/\/www.michaelschwab.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Michael Schwab<\/a>, one of the best &#8220;minimalizers&#8221; in the industry. The new logo is <a href=\"http:\/\/hsus.typepad.com\/wayne\/2007\/05\/a_more_vivid_pi.html\" target=\"_blank\" rel=\"noopener noreferrer\">further explained<\/a>, with little hyperbole for a change of pace and welcome objectivity, by HSUS&#8217; President and CEO, Wayne Pacelle:<\/p>\n<blockquote>There are three elements of this logo worth spotlighting. First, there are 18 different animals in the logo. These are animals of all types, visually demonstrating that we work to protect all animals &mdash; not just predators, or dogs and cats, or farm animals. Your HSUS is there for all animals.<\/blockquote>\n<blockquote>Second, the animals collectively represent a map of the United States. This configuration conveys the national reach of our work. The industries that do harm to animals &mdash; factory farming, the fur trade, animal fighting syndicates, puppy mills &mdash; are of a national and global scope, and they cannot be successfully challenged at a local level alone.<\/blockquote>\n<blockquote>Third, you won&#8217;t see images of injured or bloodied animals. While we work to fight against abuse and exploitation, and while we expose the consequences of human &mdash; caused cruelty when we must, we imagine a world where animals are healthy and alive. We celebrate the lives of animals, and that&#8217;s our goal &mdash; to prevent cruelty and to see them healthy and well.<\/blockquote>\n<p>There is something extremely right about this logo and a lot of it is due to how straightforward this is: It&#8217;s animals and it&#8217;s the U.S. Nothing more, nothing less. The balance of black and white in the shapes is enough to render the map of the U.S. and not make it feel gimmicky or forced. The choice and placement of the whale, dolphin and cougar (or tiger?) are a reflection of the careful consideration that (I assume simply by looking at it) went into the making of this logo. The combination of static and stationary animals also gives this logo variety and tension (of the good kind). And the typography, in its simplicity (although one could, perhaps pointlessly, argue the choice ad nauseam), is a perfect complement to the map. Of course, this is not, by any means, the most original or groundbreaking logo.<\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/many_things_together.gif\" alt=\"Logos Made up of Stuff\" \/><\/p>\n<p><span class=\"small\"><strong><em>Left to right, top row<\/em>: Luba Lukova&#8217;s Peace poster, Lincoln Center Festival 2005&#8217;s identity; <em>bottom row:<\/em> Unilever Logo by Miles Newlyn for Wolff Olins, Baltimore Logo by Landor.<\/strong><\/span><\/p>\n<p>Many before have done this, to varying desgrees of success, in slightly different ways. This logo, to me, is a reminder that borrowing ideas can simply be the beginning of a great result. HSUS&#8217; logo is, in premise, no more different than those above but, in its context, it thrives: The logo visually fulfills the mission and name of the organization &mdash; and it does so in a beautifully integrated way that rises above mere lumping of objects together (like the Lincoln or Baltimore logos, which feel slightly gratuitous). There is something for everyone to care about in this logo &mdash; and for an organization committed to household pets, farm animals and wildlife, this is no easy task. So if you like animals (and this logo) and you are happy and you know it, clap your paws.<\/p>","protected":false},"excerpt":{"rendered":"<img src=\"https:\/\/www.underconsideration.com\/brandnew\/images\/excerpt_empty.gif\" alt=\"Excerpt Empty\" \/>","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[9,67,26],"tags":[],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/507"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=507"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/507\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=507"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=507"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=507"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}