{"id":510,"date":"2007-06-23T14:27:00","date_gmt":"2007-06-23T19:27:00","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/paleys_lens_turns_heads_causes.php"},"modified":"2007-06-23T14:27:00","modified_gmt":"2007-06-23T19:27:00","slug":"paleys_lens_turns_heads_causes","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/paleys_lens_turns_heads_causes.php","title":{"rendered":"Paley&apos;s Lens Turns Heads, Causes Neck Fractures"},"content":{"rendered":"<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/paley_center_logo.gif\" alt=\"The Paley Center for Media Logo, Before and After\" \/><\/p>\n<p><span class=\"small\"><strong>Guest Editorial by Joe Marianek<\/strong><\/span><\/p>\n<p>Earlier this month, <a href=\"http:\/\/www.landor.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Landor Associates<\/a> announced a new name, strategy and identity for <a href=\"http:\/\/mtr.org\/\" target=\"_blank\" rel=\"noopener noreferrer\">The Paley Center for Media<\/a>; formerly the Museum of Television and Radio, with branches in Los Angeles and New York. The Paley Center for Media offers a curated collection of privately-donated media, holds panel discussions, and screenings in its theaters. The Paley Center doesn&#8217;t feature physical Smithsonian-type artifacts like vacum tubes, Alf&#8217;s carcass, or a comprehensive collection of everything ever broadcast on television and radio. What it does offer is a curated collection of 140,000 programs that one can access.<\/p><!--more--><p>William S. Paley founded the MT&amp;R, and also another center for media, <a href=\"http:\/\/www.cbs.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">CBS<\/a>. With his purchase of 16 affiliated radio stations in the Chicago area, Paley grew a disparate radio-network into a communications powerhouse within months and coined it the Columbia Broadcasting System. During WWII, Paley served in the Psychological Warfare branch of the Office of War Information, where ammo was infotainment. Back home, Paley saw an opportunity to revolutionize broadcasting&#8217;s business model by valuing advertisers at the forefront of the communications relationship. Thereby, he brought CBS to the top of the big three in America for&hellip; television and radio. <\/p>\n<p>The institution&#8217;s prior goals are best explained with Paley&#8217;s founding vision&hellip;  &#8220;to make sure that programming was being preserved&#8211;in order to preserve our own cultural history&#8211;and to let this collection be accessible to the general public walking in off the street.&#8221;<\/p>\n<p><a href=\"http:\/\/www.landor.com\/?do=cNews.news&#038;storyid=512&#038;g=1200&#038;year=2007\" target=\"_blank\" rel=\"noopener noreferrer\">Landor&#8217;s new strategy<\/a> with regard to the Center&#8217;s role in media is an aggressive departure:<\/p>\n<blockquote>&#8220;As the media landscape continues to change to include new platforms and modes of distribution, The Paley Center for Media seeks to expand its role as a thought leader and forum for media. The Paley Center for Media offers members and non-members a place where media luminaries, industry leaders and cultural influencers convene to examine the cultural, creative and social significance of all media.&#8221;<\/blockquote>\n<p>The organization has moved away from positioning itself as collections-based institution, so dropping the &#8220;Museum&#8221; descriptor was probably intended to manage the expectations of TV-buff tourists with fanny packs off the street. The new name &#8220;Paley Center for Media&#8221; does not suggest repository of entertaining\/enlightening broadcast artifacts; but rather a more ethereal destination and purpose.<\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/paley_center_building.jpg\" alt=\"The Paley Center for Media, Sign\" \/><\/p>\n<p>If it&#8217;s not a museum then what is it? <em>Center for Media<\/em> is open to interpretation varying from a room with a computer in a middle school to a State Department of Censorship, or (hopefully) an intriguing destination that offers rich content. It is unclear which this is. In Landor&#8217;s brand statment above, <em>Media<\/em> could be interchangable with <em>Pacifiers<\/em>, <em>Paint<\/em>, or if you dare, <em>Propoganda<\/em>.<\/p>\n<p>Best Buy is a Center for Media. YouTube is a Center for Media, the Apple Store is a Center for Media, Pearl Art Supply is a Center for Media, and so is the Public Library. This Center for Media takes on a media advocacy point-of-view which differentiates it from those consumer brands. On the Paley website and surrounding press-releases, the word <em>Media<\/em> is given presence as a proper noun to the level of an individual with indelible human rights. This is perhaps because the Museum has more accurately identified itself as a public-facing hub for professionals and &#8220;luminaries&#8221; that effect the industry. Transparently Orwellian language on the Paley Center website offers invitation-only membership to the (sub-brand) <a href=\"http:\/\/www.paleymediacouncil.org\/\" target=\"_blank\" rel=\"noopener noreferrer\">Paley Media Council<\/a> for &#8220;key decision-makers in media companies.&#8221; <\/p>\n<p>The ominous positioning strategy has a clarifying and inebriating culmination in the peppy visual identity created by Joshua Levi at Landor. <\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/paley_center_floor.jpg\" alt=\"The Paley Center for Media, Dance Floor, Baby!\" \/>\n<span class=\"small\"><strong>Projected logo + media luminaries + free cocktails = instant dance party.<\/strong><\/span><\/p>\n<p>Landor&#8217;s press release tells us what we see:<\/p>\n<blockquote>&#8220;The Paley Center for Media&#8217;s visual identity consists of the name spelled out in two concentric circles, emphasizing The Paley Center&#8217;s dedication to focusing on media and its ever-changing role in society. The circles suggest a camera lens coming into focus, a direct reference to the organization&#8217;s view of media as a lens to better understand culture and society.&#8221;<\/blockquote>\n<p>The logo is set in <a href=\"http:\/\/typographi.com\/000931.php\" target=\"_blank\" rel=\"noopener noreferrer\">Clearview<\/a> and is a nimble and energetic departure from its grumpy tuxedo-clad parent. The sugar-sweet visual system of gradients is overwhelming, but employed as necessary counterpoint to the stark logo. A lens-like widget is more apparent when you see the beginning of <a href=\"http:\/\/tv.yahoo.com\/cbs-evening-news\/show\/29462\/videos\" target=\"_blank\" rel=\"noopener noreferrer\">this animation<\/a>. It is, however, presumptuous to assume that this logo transmits the strategy &#8220;lens for media&#8221; without a written explanation. More apparent are references to a civic seal or a sewer-cover. The arrangement of type functions like a stamp of authority, protection, or endorsement on Paley collateral. The logo is read as a mumbled texture and the messaging plays the primary role on the communications<\/p>\n<p>Part of CBS&#8217;s sucess was to due to the talent that Paley enabled to build the elegantly executed CBS identity over the years. Paley&#8217;s right hand aesthete, President Frank Stanton assembled the visual accumen of William Golden, Herb Lubalin and Lou Dorfsman to build the CBS identity through design and advertising which would elevate the value of CBS, and ultimately graphic design. One wonders what would happen if the Paley Center lens were applied over its elder relative, the <a href=\"http:\/\/www.tvsquad.com\/media\/2006\/05\/cbslogo200.jpg\" target=\"_blank\" rel=\"noopener noreferrer\">CBS eye<\/a>.<\/p>\n<p>If you&#8217;re indoctrinated in a media-trance , you&#8217;ll think the name repeats itself twice (for bicoastal locations in NY and LA.) If not, you might thank the logo for doing you a favor so that you don&#8217;t have to break your neck to read it. Over time, the Paley Center will probably put its lens over a lot of media, and the Paley logo will build awareness through repetition. Either way, for now, we can all agree that this logo really turns heads.<\/p>\n<p><span class=\"small\"><strong><a href=\"\/\/www.joemarianek.com\" target=\"_blank\" rel=\"noopener noreferrer\">Joe Marianek<\/a> is a graphic designer living in New York City.<\/strong><\/span><\/p>","protected":false},"excerpt":{"rendered":"<img src=\"https:\/\/www.underconsideration.com\/brandnew\/images\/excerpt_empty.gif\" alt=\"Excerpt Empty\" \/>","protected":false},"author":5,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[9,63,26],"tags":[],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/510"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=510"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/510\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=510"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=510"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=510"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}