{"id":512,"date":"2007-06-25T10:44:49","date_gmt":"2007-06-25T15:44:49","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/score_new_school_58_-_old_scho.php"},"modified":"2007-06-25T10:44:49","modified_gmt":"2007-06-25T15:44:49","slug":"score_new_school_58___old_scho","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/score_new_school_58___old_scho.php","title":{"rendered":"Score: New School 58 &#8211; Old School 2"},"content":{"rendered":"<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/bruins_caps_logos.gif\" alt=\"Washington Capitals and Boston Bruins Logos, Before and After\" \/><\/p>\n<p>Before we start, let&#8217;s get something out of the way. I don&#8217;t watch Hockey and I can&#8217;t tell who&#8217;s who or what&#8217;s what. The closest I have come to enjoying Hockey, and knowing anything about it, was when I used to play Electronic Arts&#8217; <em>NHL Live<\/em> on my Sega Genesis back in the early 90s and my favorite team was Chicago, with its Roenick-Chelis-Belfour trifecta which allowed me to humiliate my fellow high schoolers. Perhaps it&#8217;s because I haven&#8217;t watched a game in this century and, to this day, I&#8217;m still baffled that a Disney movie became a real team, but I have always felt that Hockey (the NHL in particular) was more &#8220;Old School&#8221; than the NBA or the NFL with their hot cheerleaders, mainstream fans and flashy events. Hockey, on the other hand, seems (to me) like an acquired taste &mdash; a rugged taste, best served cold. This feeling was then confirmed when this past week, two teams unveiled new identities &mdash; designed in the 21st Century &mdash; that are decidedly (with mixed results) Old School.<\/p><!--more--><p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/bruins_caps_old_logos.gif\" alt=\"Washington Capitals and Boston Bruins Crests, Older Logos\" \/>\n<span class=\"small\"><strong>Boston Bruins logos from 1932-1949 and Washington Capitals first logo from 1974.<\/strong><\/span><\/p>\n<p>The <a href=\"http:\/\/bruins.nhl.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Boston Bruins<\/a>, the first U.S. team to join the then expanding NHL in 1924, and the <a href=\"http:\/\/capitals.nhl.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Washington Capitals<\/a>, who played their first season in 1974-75, both unveiled new identities recently. And, as a pair, they make for a great discussion as each team has come from a different place and then gone in a similar direction. First the Bruins logo. As is clear, it is simply a swift, elegant update of their previous logo with nips and tucks only where necessary. The serifs on the B and the unifying black strokes help make this logo a cohesive, and strong unit. It should be noted that the Bruins have used nothing other than a B and a spoke since the 30s as their primary logo. As an execution, it&#8217;s hard to argue against, it looks better. Strategically, it&#8217;s hard also &mdash; and laudable &mdash; as it relies on the tradition of the Bruins, without fixing anything that is not broken. <\/p>\n<p>Then, the Capitals logo. Oyoyoy, yes. Whether you look at the before or after it is hard not to feel queasy. The previous one, is simply a &#8220;New School&#8221; aberration, where too much takes center stage and bevels, shadows and highlights aim to puck you in the teeth. Using red, white and blue for any team in Washington may be cliche but, let&#8217;s face it, it works, it makes sense and it has done so across sports and ages. After the misguided color selection of the previous logo, the new one sports RWB with pride. And that&#8217;s as much praise as one can give it, as the logo becomes a train wreck from top to bottom, left to right. An italicized custom typeface, with all the wrong turns in all the wrong places, gives way to &mdash; wait for it &mdash; a hockey stick! A long, uncomfortable-looking stick that is then hitting a hyphen, which I assume is a puck. Tucked in the left shoulder are three stars and yet more italic type that, I believe, has been horizontally scaled. <em>However<\/em>, there is something to be said for the attempted return to the Old School logo, and tradition, from the 70s with its kickass italic in reverse &mdash; I love reverse italics. This is not to say that the old logo was good, it wasn&#8217;t, but the new one attempts to relive some of the giddy glory of a new team. Sadly, the result looks like shattered glass. (I wonder if <a href=\"http:\/\/www.uniwatchblog.com\/?p=531\" target=\"_blank\" rel=\"noopener noreferrer\">this guy realizes what he is getting tattooed on his neck<\/a>.)<\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/bruins_caps_crest.gif\" alt=\"Washington Capitals and Boston Bruins Crests, Before and After\" \/><\/p>\n<p>Another aspect of these identities are the secondary logos, or crests, or shoulder patches. These serve, at least in these teams&#8217; cases, as vehicles for their mascots. (Are they called mascots in Hockey too? Or is that too girlie?). The Boston Bruins&#8217; new crest is yet another direct evolution from its past with, again, a swift, elegant update. For the new crest, the priority is now placed on Bruins while Boston has gone to the bear&#8217;s feet; although, strangely, <a href=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/bruins_crest_reverse.php\" onclick=\"window.open('https:\/\/www.underconsideration.com\/brandnew\/archives\/bruins_crest_reverse.php','popup','width=216,height=135,scrollbars=no,resizable=no,toolbar=no,directories=no,location=no,menubar=no,status=no,left=0,top=0'); return false\">there is <em>another<\/em> version with Boston big, and Bruins small<\/a>. Go figure. The one decision that I found interesting, was the desire to keep the big typography over the bear&hellip; funky. It&#8217;s not bad. It&#8217;s just a little kooky and off-kilter. In a good way. In a way that harkens to tradition and what generations of Bruins&#8217; fans have known. <\/p>\n<p>The Capitals, on the other hand, are emerging from their past identity with a brand new crest that features a pretty nifty, streamlined eagle with the Capitol in its, ahem, counterspace. In contrast to the main logo, this element of the identity I find to be a wonderful and appropriate execution. Unfortunately, it goes with the main logo as easy as oil goes with water. <\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/bruins_caps_shoulder.jpg\" alt=\"Washington Capitals and Boston Bruins Shoulder Pads\" \/>\n<span class=\"small\"><strong>Shoulder pads.<\/strong><\/span><\/p>\n<p>Even after being relatively immersed in Hockey today, I still don&#8217;t find interest in the sport but after seeing these two new logos, I have hope that the snowballing of sports into a supergraphic style could be coming to an end. Or at least a respite.<\/p>","protected":false},"excerpt":{"rendered":"<img src=\"https:\/\/www.underconsideration.com\/brandnew\/images\/excerpt_empty.gif\" alt=\"Excerpt Empty\" \/>","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[9,26,87],"tags":[],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/512"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=512"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/512\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=512"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=512"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=512"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}