{"id":5209,"date":"2017-02-20T05:35:30","date_gmt":"2017-02-20T11:35:30","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/new_logo_and_website_for_brand_new_by_underconsideration.php"},"modified":"2017-02-20T05:35:30","modified_gmt":"2017-02-20T11:35:30","slug":"new_logo_and_website_for_brand_new_by_underconsideration","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/new_logo_and_website_for_brand_new_by_underconsideration.php","title":{"rendered":"New Logo and Website for Brand New by UnderConsideration"},"content":{"rendered":"<p>Established in 2006, Brand New is the best, baddest, awesomest, most best blog in the world. That&#8217;s what it would say if we had a Wikipedia page, because those are hard facts. False modesty aside, yes, Brand New is new today! Like, drastically new. I decided to post this as a Review not because it&#8217;s on par with Google or Facebook or Juventus rebranding but it is a big deal, so it gets top billing today. Some things are the same, some are very different. Read on to see what&#8217;s what; it&#8217;s a long post so you might experience some tl;dr. Oh&#8230; and to finish my opening paragraph in usual style&#8230; This week Brand New introduced a new logo and website designed by Austin, TX-based <a href=\"http:\/\/www.underconsideration.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">UnderConsideration<\/a>.<\/p>\n<!--more--><h1 class=\"friday_likes\">Website<\/h1>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/brand_new_2017_home_page_before_after.jpg\" alt=\"New Logo and Website for Brand New by UnderConsideration\" \/>\n<figcaption>Home page, before and after. Totally coincidental that both versions take up the exact height.<\/figcaption>\n<\/figure>\n<p>I will start by talking all about the website and leave the logo to the end. The previous version of Brand New was introduced in July of 2013, a relatively short 3.5 years ago. It was only the second responsive website I had built and my CSS skills were fine but limited. (They are still limited today but at least I find that I can make layouts do what <em>I<\/em> want them to do and not layouts making me do what <em>they<\/em> want.) I liked the design but I do acknowledge the home page had hierarchy issues from the start and the side column with the polls on the individual posts was far from ideal. Still, we&#8217;ve been rocking this layout and, at the end of the day, most of you have politely and thankfully put up with any limitations because the content is what matters. Still, things could be improved, so that&#8217;s what I set out to do as well as implement some important changes to accommodate more content and the growing demand of potential advertisers. Following is a run-down on the most obvious changes.<\/p>\n<figure class=\"quarter\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/brand_new_2017_home_page.jpg\" alt=\"New Logo and Website for Brand New by UnderConsideration\" \/>\n<figcaption>Home page. Kind of meta to put the home of Brand New on a Brand New post but in case someone wants to share it, here it is.<\/figcaption>\n<\/figure>\n<h6>Big ad<\/h6>\n<p>Yes, I see it too and that&#8217;s the point. Our advertiser banners have been 500 &times; 150 pixels for years and they are now getting lost easily, which is not good for business. The new ad size is common among web publications and it&#8217;s as tastefully done as possible. Compared to the onslaught of ad units, pop-ups, and pushy modal windows other sites use, we are extremely kind to you. A bigger ad will attract more advertisers and more advertisers mean better funding for this blog which takes a big portion of time. We do encourage you to click on the banners now and again to support those companies and organizations that support us.<\/p>\n<h6>Sponsored Posts<\/h6>\n<p>This is the number one request we get from advertisers. For the longest time we have tried to steer away from it but it&#8217;s become really hard to ignore. We will do our best to bring you relevant sponsored posts. Again, please consider engaging those posts, instead of just scoffing at them or ignoring them &#8212; which you have every right to do &#8212; but remember that these posts will help keep Brand New going. As you can see in the home page, the posts are not invasive and they are clearly marked. In the RSS feed they will also be clearly labeled. Heck, <a href=\"https:\/\/www.underconsideration.com\/brandnew\/sponsored-posts.php\" target=\"_blank\" rel=\"noopener noreferrer\">you might even consider buying one<\/a> now and then to promote a product, service, or even that project I refuse to include in Friday Likes.<\/p>\n<h6>New section: Spotted<\/h6>\n<p>One of the biggest reasons for the update was this, to be able to include many more logo redesigns than what we&#8217;ve done until now. For better or worse &#8212; I like to think for better &#8212; I have established a strict set of criteria of what kind of projects I write about and that leaves a lot of projects on the cutting room floor. I think I post about 50% of the tips I receive&#8230; that&#8217;s a lot of wasted sources. Spotted will have no opinion, no application images, not even an introduction. It&#8217;s just a radar for as many changes as possible. You will still be able to comment and vote on them. You might say, &#8220;Don&#8217;t be lazy, Armin, and just write a sentence&#8221;, to which I say, &#8220;Yes, in an ideal world, that would happen but there simply aren&#8217;t enough hours in the day to write about every logo&#8221;. My plan is to post 2 or 3 Spotted a day.<\/p>\n<h6>New sections: Pinned and Curated<\/h6>\n<p>Towards the bottom of every page, there will be two sets of 6 thumbnails &#8212; or 4, depending how wide your browser window is. The first are &#8220;Pinned&#8221;, which are the most big-news posts we&#8217;ve had in the last 6 to 12 months as a way to keep those big changes in the spotlight. The second are &#8220;Curated&#8221;, which will be a bi-weekly selection of common posts from our archives. We are kicking off with the best projects tagged with &#8220;blue&#8221; but we&#8217;ll refresh that section with other parameters like best projects with birds, or the best automotive projects, etc.<\/p>\n<h6>Responsiveness<\/h6>\n<p>I would like to think I did a good job on this. The site looks its best at 1,500 pixels wide, which sounds huge by 1999 standards but it even fits in my 11-inch MacBook Air so I know I&#8217;m not being extreme. The site shrinks to 1,000 pixels and drops two columns from the layout to fit nicely into iPads. Then it shrinks to 500 and drops two more columns for a pleasant experience on phones. The navigation now has any browsing options in a drop-down, full-page screen that makes it fairly easy to, well, browse.<\/p>\n<h6>Typography<\/h6>\n<p>We are rocking <a href=\"http:\/\/www.typography.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Hoefler &amp; Co.&#8217;s<\/a> <a href=\"http:\/\/www.typography.com\/fonts\/mercury-text\/styles\/screensmart\/\" target=\"_blank\" rel=\"noopener noreferrer\">Mercury Text ScreenSmart<\/a> and <a href=\"http:\/\/www.typography.com\/fonts\/operator\/styles\/screensmart\/\" target=\"_blank\" rel=\"noopener noreferrer\">Operator ScreenSmart<\/a>, served from their Cloud.typography service. Mercury has always been one of my favorite serifs and I have been wanting to use Operator since it came out; it works amazingly well at small sizes and I was surprised at how readable it is, despite having an off-beat structure.<\/p>\n<h6>RSS \/ Feedly<\/h6>\n<p>It&#8217;s not perfect, because each RSS reader now interprets content in their own way, but I&#8217;ve done what I can to optimize our RSS feed and for Feedly in particular. Still, we encourage you to read posts on the site because not only do they look better here but I worked really hard on it : ).<\/p>\n<h6>Twitter Cards<\/h6>\n<p>Someone had mentioned that we needed this, so individual posts will now convert to Twitter cards when you copy our URLs.<\/p>\n<h6>Big Announcements<\/h6>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/brand_new_2017_mega_announced.jpg\" alt=\"New Logo and Website for Brand New by UnderConsideration\" \/>\n<figcaption>Big announcements like, say, the redesign of this website, will eventually appear on the home page like this.<\/figcaption>\n<\/figure>\n<p>I didn&#8217;t want to do a big announcement on the redesign because I wanted y&#8217;all to experience the home page in its usual layout. Whenever we have news, whether it&#8217;s taking a week off or Brand New Conference updates, they will appear on the home page big like the image above and will stay like that for a couple of days, then moving to the left column.<\/p>\n<h6>Individual posts<\/h6>\n<p>Gone is the sidebar. Individual posts are now one, long, wide-ish center column that shows off the content a lot better. With the polls at the end. I hope you like the polls, btw, that took one full day of styling! And now that the cookie issue has been resolved, you can vote like mad!<\/p>\n<h6>&#8220;Key Visuals&#8221;<\/h6>\n<p>One of the recurring pieces of feedback on the site was somehow have the ability to see the &#8220;before\/after&#8221; image once you had scrolled past it. I tried floating it as you scroll but it felt very inelegant and I tried putting it to the side but that was too small. My proposed solution is a floating corner bug that gives you access to the before\/after image and a key application:<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/brand_new_2017_key_visuals.gif\" alt=\"New Logo and Website for Brand New by UnderConsideration\" \/>\n<figcaption>&#8220;Key Visuals&#8221; for quick access to the before\/after logo images and a key application.<\/figcaption>\n<\/figure>\n<p>You can turn it on and off when you want and it&#8217;s mostly out of the way of the content &#8212; except for the mobile version, where it&#8217;s really tight; there is a chance I might take it off the mobile version if many of you find it obtrusive. The toggle button appears after you get into the first paragraph and disappears AFTER the last paragraph hits the top of the browser.<\/p>\n<h6>I think that&#8217;s it<\/h6>\n<p>Those are the major changes, I think, I don&#8217;t know, I&#8217;ve been working so non-stop on this I can&#8217;t tell things apart. Obviously, bugs are to be expected so if you find any, please let me know in the comments or by email.<\/p>\n<h1 class=\"friday_likes\">Logo<\/h1>\n<p>The old logo &#8212; now is a good time to click on the Key Visuals so you can glimpse the old logo &#8212; was typeset in <a href=\"http:\/\/vllg.com\/constellation\/apex-serif\" target=\"_blank\" rel=\"noopener noreferrer\">Village&#8217;s Apex Serif<\/a>, all in small caps. I constantly received emails asking what font it was so I had a vague sense of achievement about it but truth be told I don&#8217;t even remember why I chose that font or why a chunky slab serif was the way to go, but it had been like that since the very beginning. I know I liked the font, so that&#8217;s as deep as the concept behind the old logo went.<\/p>\n<p>In a way, I wanted to keep a similar attitude in not obsessing about the right logo &#8212; there is really no &#8220;right&#8221; logo for a blog about logo changes &#8212; so I kept my eyes open for options as I was designing the website and focused most of the energy on the site, knowing that I could very well revert to the old logo.<\/p>\n<p>Because I end up on <a href=\"https:\/\/lineto.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Lineto.com<\/a> often, usually getting the link to Circular or Brown, I decided to poke through all their fonts, especially the display fonts. <a href=\"https:\/\/lineto.com\/The+Fonts\/Font+Categories\/Headline+Fonts\/Prismaset\/\" target=\"_blank\" rel=\"noopener noreferrer\">Prismaset<\/a> caught my attention (because I have a thing <a href=\"https:\/\/www.fastcodesign.com\/3063992\/whats-the-greatest-logo-of-all-time\" target=\"_blank\" rel=\"noopener noreferrer\">for concentric letterforms<\/a>) and the style with five lines was starting to look pretty cool.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/brand_new_2017_logo.png\" alt=\"New Logo and Website for Brand New by UnderConsideration\" \/>\n<figcaption>Logo. Based on Lineto&#8217;s <a href=\"https:\/\/lineto.com\/The+Fonts\/Font+Categories\/Headline+Fonts\/Prismaset\/Five\/\" target=\"_blank\" rel=\"noopener noreferrer\">Prismaset Five<\/a>.<\/figcaption>\n<\/figure>\n<p>I am the first to acknowledge that this is a geometric sans serif &#8212; a style I consistently label as unsurprising &#8212; but I wanted to see if there was something I could do within that trend that would look good and be somewhat unique for Brand New. I know it&#8217;s not unique-unique as there are dozens of concentric stroke logos like this but I knew that at least, technique-wise I could deploy it in a unique-unique way. So&#8230;<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/brand_new_2017_grid.png\" alt=\"New Logo and Website for Brand New by UnderConsideration\" \/>\n<figcaption>Underlying grid.<\/figcaption>\n<\/figure>\n<p>That&#8217;s not a gratuitous underlying grid, there is a point! When I typeset &#8220;Brand New&#8221; in Prismaset Five I immediately liked it but I hated how fuzzy it got once I used it as a web graphic, even as an SVG because those strokes start to show up as 1.5pt thick and they get fuzzy. So, based on Prismaset Five &#8212; I paid for a license, yes &#8212; I redrew the characters so that the vertical and horizontal lines would render, <em>always<\/em>, as 1-pixel-thick lines and look perfectly sharp. So each line is 1 pixel thick with 3 pixels in between. This forced me to change some of the original shapes of Prismaset, primarily the &#8220;B&#8221; but pretty much all letters are different as the proportions changed. As an SVG file the logo looks even crisper and it&#8217;s only the diagonals and circles that have a little bit of unavoidable fuzz. As the site shrinks responsively, the logo stays at the same size, keeping its 1-pixel lines intact. (Except for the mobile version; that had to budge.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/brand_new_2017_grid_wireframe.png\" alt=\"New Logo and Website for Brand New by UnderConsideration\" \/>\n<figcaption>Command-Y on the grid. Vectors on point. Literally.<\/figcaption>\n<\/figure>\n<p>I don&#8217;t know if it&#8217;s a logo that will last another ten years; maybe it will outgrow the trend maybe not, but, for now, I like it and I like how it complements the thin sharp lines of the site and the overall airiness.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/brand_new_2017_colors.png\" alt=\"New Logo and Website for Brand New by UnderConsideration\" \/>\n<figcaption>Colors.<\/figcaption>\n<\/figure>\n<p>For the colors, you might say, &#8220;Hey, you lifted those off directly <a href=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/new_logo_and_identity_by_and_for_saffron.php\" target=\"_blank\" rel=\"noopener noreferrer\">from the Saffron redesign<\/a>&#8221; but I can honestly say I have had this color palette since December, before the Saffron project came out. I&#8217;m not saying I did it first but I just want to make sure no one thinks I stole someone else&#8217;s color palette. Why pastels? Because Brand New has been so stark and black and red for so many years that I wanted something softer. I needed to color-code each of the editorial categories &#8212; Reviewed, Noted, Linked, etc. &#8212; and by default I ended up with light colors that could support dark gray type on top.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/brand_new_2017_monogram.png\" alt=\"New Logo and Website for Brand New by UnderConsideration\" \/>\n<figcaption>Monogram.<\/figcaption>\n<\/figure>\n<p class=\"end\">Finally, I did a monogram for social media and other purposes. There is a version for bigger avatars with the full five lines and there is a small version with only three lines, which you can see at the end of this paragraph, service as the closing monogram of each post. Both monograms have slightly different proportions between them and the main logo, trying to keep each letter to half of a square. In the big version, the letters touch to create a more unified monogram but in the small version there is one line of space between them because otherwise it looks like a smushed fly. So, that&#8217;s it! I hope you like the new version!<\/p>","protected":false},"excerpt":{"rendered":"Established in 2006, Brand New is the best, baddest, awesomest, most best blog in the world. That&apos;s what it would say if we had a Wikipedia page, because those are hard facts. False modesty aside, yes, Brand New is new&#8230;","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[9,26,91],"tags":[1123,1364,944,1235,1365],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/5209"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=5209"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/5209\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=5209"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=5209"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=5209"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}