{"id":524,"date":"2007-08-14T16:53:34","date_gmt":"2007-08-14T21:53:34","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/short_sweet_and_to_the_point.php"},"modified":"2007-08-14T16:53:34","modified_gmt":"2007-08-14T21:53:34","slug":"short_sweet_and_to_the_point","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/short_sweet_and_to_the_point.php","title":{"rendered":"Short, Sweet and to the Point"},"content":{"rendered":"<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/biography_logo.gif\" alt=\"Biography Channel Logo, Before and After\" \/><\/p>\n<p>Three-letter cable channel identifications seem to be all the rage lately. One merely has to channel surf to find plenty of three letter abbreviations for different networks: CNN, TNT, TBS, TLC, TNN, A&amp;E; and the list goes on. Apparently network execs think that their viewers don&rsquo;t have the mental capacity or intelligence to recall their favorite channels &mdash; or perhaps this trend is the result of an instant gratification society in which the proliferation of instant messaging has diminished our ability to read, write and think in complete thoughts and sentences.<\/p><!--more--><p>The latest example of this &ldquo;dumbing down&rdquo; of channel identifications can be seen through <a href=\"http:\/\/www.biography.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">The Biography Channel&rsquo;s<\/a> new brand. Reduced to &ldquo;bio&rdquo; and set in all lowercase letters in a slab serif face, this new identity is a far departure from its former incarnation; one that is crisp, clean, and simply executed. Whereas the old typeface was an elegant serif set within a pill-shaped field, the new characters are more pronounced and easy to read, as well as friendly and personable. <\/p>\n<p>One of my biggest complaints, typographically speaking, is that the square dot of the &ldquo;i&rdquo; is clunky and seems out of place&#8211;a more appropriate solution would have been to mimic the shape of the circular period after &ldquo;bio.&rdquo; And speaking of periods, I will never be able to look at a red dot at the end of a word or sentence the same way again thanks to the Kotex&reg; feminine hygiene commercials that aired a few years back&#8211;and, unfortunately, it is the red dot that is supposed to link the old and new identities. <\/p>\n<p>The black and white lozenge shape has disappeared from the identity, which is a major improvement. What exactly was that supposed to be, anyway: a pill? A paper clip? It didn&rsquo;t help that, until August of last year, Biography was also a documentary series that aired weekly on A&amp;E network (&ldquo;Biography&rdquo; started in 1962 on CBS to chronicle the lives of historical figures, was picked up by A&amp;E Network in 1987 with new episodes, and then was finally spun off into the cable channel in 1999). The old Biography Channel logo had to be different from the television series of the same name, because other types of programming, including mysteries such as &ldquo;Murder, She Wrote&rdquo; were aired (and who doesn&rsquo;t love Angela Landsbury?). <\/p>\n<p>Instead of differentiating between the two, the channel and the television program shared the exact same logotype and color scheme. The only difference was that <a href=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/biography_logo_orig.php\" onclick=\"window.open('https:\/\/www.underconsideration.com\/brandnew\/archives\/biography_logo_orig.php','popup','width=178,height=93,scrollbars=no,resizable=no,toolbar=no,directories=no,location=no,menubar=no,status=no,left=0,top=0'); return false\">the TV series logo<\/a> had a red field behind &ldquo;Bio&rdquo; and then the rest of the type was reversed out of the background or a black field. The new mark, on the other hand, utilizes gray instead of using all black and white, which subconsciously makes that suggestion that when it comes to history, things are often open to interpretation through the lens of the culture in which we live.<\/p>\n<p>Though not perfect in execution, the new Biography Channel identity is a vast improvement over the old. It pays homage to the original television series brand by once again calling attention to the &ldquo;bio&rdquo; in biography (after all, these are not full blown, Benjamin Franklin length documentaries, rather short &ldquo;bios&rdquo; on current individuals). It appeals to a target audience who may not be as intellectual as past viewers (those who see things in only black and white, fact or fiction). And even though I hate to see more damage done to the English language by catering to the IM&rsquo;ing crowd, this is one identity that is short, sweet, and to the point.<\/p>","protected":false},"excerpt":{"rendered":"<img src=\"https:\/\/www.underconsideration.com\/brandnew\/images\/excerpt_empty.gif\" alt=\"Excerpt Empty\" \/>","protected":false},"author":17,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[9,66,26],"tags":[],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/524"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/17"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=524"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/524\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=524"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=524"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=524"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}