{"id":5250,"date":"2017-03-02T15:02:28","date_gmt":"2017-03-02T21:02:28","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/a_polish.php"},"modified":"2017-03-02T15:02:28","modified_gmt":"2017-03-02T21:02:28","slug":"a_polish","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/a_polish.php","title":{"rendered":"A Polish"},"content":{"rendered":"<p>I have done some tweaks based on feedback received and some of the performance of the site in the last week and a half. <strong>Important: <\/strong> Do a hard refresh on your browser (usually by holding down Option + Shift keys while clicking the refresh icon). Here is a change log:<\/p>\n<!--more--><ul>\n<li>Fixed the &#8220;e&#8221; on the logo.<\/li>\n<li>Chose an alternate version of the logo I had since the beginning that I had actually pulled out at the last minute. This version has some light shadows in the intersection of the lines that match the shadows on the post modules. Better, not better&#8230; at this point, that&#8217;s what I&#8217;m sticking with.<\/li>\n<li>Not reverting to the old logo. Why? Because I&#8217;m not.<\/li>\n<li>Updated the favicon.<\/li>\n<li>Changed the color coding on the home page because the red\/pink for noted was confusing. Maintaining color coding because having everything white makes it hard to differentiate between posts.<\/li>\n<li>Darkened the body background by, like, 1%.<\/li>\n<li>Changed the hover and link behavior of the post modules&#8230; now the whole thing is clickable instead of just the image or just the headline or just the subheadline.<\/li>\n<li>Spotted moved to the bottom of every page instead of just the top of the home page. Moving it below helps air out the home page and keep the Reviewed\/Noted combo higher on the page AND I like how Spotted can now be easily accessed right after you are done with the comments.<\/li>\n<li>Moved the &#8220;Key Visuals&#8221; to the left side of each page because on the right it was conflicting with the scrolling bar that appears and disappears in some browsers.<\/li>\n<li>Fixed the layering issue with the Key Visuals where they were going underneath the Spotted\/Pinned\/Curated section.<\/li>\n<li>Changed the quote styling to be white text on dark background&#8230; still on the fence about that one&#8230; will give it a few days to see how it feels.<\/li>\n<\/ul>\n<p>That&#8217;s about it. There might still be a few bugs here and there, so keep reporting them; I have gotten a lot of helpful emails on the side from people who stumble on weird stuff.<\/p>\n<p>I did not make every single request because a lot of it is personal preference &#8212; i.e., &#8220;make the header sticky&#8221;, &#8220;the header is too much in the way&#8221;, &#8220;the header smells like pee&#8221; &#8212; that it&#8217;s just not feasible to try and please everyone.<\/p>\n<p class=\"end\">I know some of you still don&#8217;t like the new design &#8212; perhaps even hate it &#8212; and that&#8217;s okay. It will be okay. After a few shaky hours to my confidence with all the feedback coming in last week &#8212; the good and the bad &#8212; and having some time to reflect on the change and see it in action I am very pleased with the outcome and have confidence in it for the long run&#8230; including the logo that was called all kinds of crazy mean stuff and including the choice of Operator which, I am sorry, but I think it&#8217;s a pretty boss typeface on its own and in use here. Anyway, point being: my cage was rattled but all my feathers are in place and I&#8217;m going to keep on squawking about logos for the near and far future&#8230; and I&#8217;ll stop using weird bird metaphors.<\/p>","protected":false},"excerpt":{"rendered":"I have done some tweaks based on feedback received and some of the performance of the site in the last week and a half. Important: Do a hard refresh on your browser (usually by holding down Option + Shift keys&#8230;","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[23],"tags":[43],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/5250"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=5250"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/5250\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=5250"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=5250"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=5250"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}