{"id":5293,"date":"2017-03-15T05:18:58","date_gmt":"2017-03-15T10:18:58","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/new_logo_identity_and_on_air_look_for_movistar_by_mucho_and_comodo.php"},"modified":"2017-03-15T05:18:58","modified_gmt":"2017-03-15T10:18:58","slug":"new_logo_identity_and_on_air_look_for_movistar_by_mucho_and_comodo","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/new_logo_identity_and_on_air_look_for_movistar_by_mucho_and_comodo.php","title":{"rendered":"New Logo, Identity, and On-air Look for Movistar+ by Mucho and Cómodo"},"content":{"rendered":"<p>Launched in 2015, <a href=\"http:\/\/www.movistar.es\/particulares\/movistarplus\" target=\"_blank\" rel=\"noopener noreferrer\">Movistar+<\/a> is a subscription platform for digital television that resulted from the merger of Canal+ and Movistar TV (originally launched in 2003 and 2001, respectively). Owned by Telefónica and available in various Spanish-speaking countries with its biggest audience in Spain, Movistar+ is the equivalent of subscribing to Sky or DirecTV and offers a wide range of mainstream popular channels as well as its own Movistar-branded theme channels for sports, movies, and other premium content. Coinciding with <a href=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/new_logo_and_identity_for_movistar_by_lambie_nairn.php\" target=\"_blank\" rel=\"noopener noreferrer\">the update to the main Movistar identity<\/a>, the Movistar+ identity was designed by Barcelona-based <a href=\"http:\/\/wearemucho.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Mucho<\/a> and <a href=\"http:\/\/comodoscreen.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Cómodo<\/a>.<\/p>\n<!--more--><blockquote>The Canal+ and MovistarTV logos come together to create the new Movistar+. The M+ symbol is a new way of understanding a corporate icon. Instead of functioning as a corporate sign-off, the symbol becomes a talking avatar which embodies the brand values and engages directly with its audience in an everlasting conversation. The icon is the symbol of a superfollower, of recognition and relation with the viewer, of a reposting multiplatform. The &#8216;movistar+&#8217; logo then signs communication at the bottom. With this structure in mind we developed a consistent and organized brand architecture.<br \/><br \/>The corporate identity also uses a new typography which produces a corporate visual voice, the vehicle of the conversation. The new brand comes to life with emotion through a real conversation with the user, talking about the shared content, becoming creative, expresive and close, and ultimately generating a community for the brand to live with.<\/blockquote><h3><a href=\"http:\/\/wearemucho.com\/project\/movistarplus\/\" target=\"_blank\" rel=\"noopener noreferrer\">Mucho project page<\/a><\/h3>\n<figure class=\"full\"><div class=\"video-container\"><video controls><source src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/movistar_plus_main_logo_animation.mov\" type=\"video\/mp4\">Your browser does not support the video tag.<\/video><\/div>\n<figcaption>Logo animation and principal behavior.<\/figcaption>\n<\/figure>\n<p>I won&#8217;t spend too much time on the logo as most of the opinions follow the same train of thought as the main Movistar logo: cleaner shape, same wordmark, bolder user of the goopy &#8220;M&#8221;. In this case there is the addition of the plus symbol, which is a &#8220;+&#8221; in static form but breaks apart to become &#8220;› ‹&#8221; and function as framing devices for graphics and messaging. It&#8217;s a nice update that serves as the foundation for some crazy-comprehensive motion and on-air work.<\/p>\n<blockquote>The graphic language is inspired by the multiscreen culture which surrounds us. We are always connected through different devices such as smartphones, laptops, tablets, televisions, or printed matter&#8230; The multiscreen language allows the brand to reflect this on\/off reality, and also express itself through a myriad of channels. The multiscreen graphics develop a rich moving image and photographic language. By combining different pictures in various ways it produces different meanings, different versions of the same stories or jokes, told in different ways. Images are connected, constructed, reflected, related or antagonised making the conversation fun and entertaining, and effectively transforming the corporate identity into a layer of visual content in its own right.<\/blockquote><h3><a href=\"http:\/\/wearemucho.com\/project\/movistarplus\/\" target=\"_blank\" rel=\"noopener noreferrer\">Mucho project page<\/a><\/h3>\n<figure class=\"full\"><div class=\"video-container\"><video controls><source src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/movistar_plus_panels.mp4\" type=\"video\/mp4\">Your browser does not support the video tag.<\/video><\/div>\n<hr \/>\n<div class=\"video-container\"><video controls><source src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/movistar_plus_chewie.mp4\" type=\"video\/mp4\">Your browser does not support the video tag.<\/video><\/div>\n<figcaption>&#8220;Multiscreen&#8221; language.<\/figcaption>\n<\/figure>\n<p>The main visual element and leading motion behavior is a series of &#8220;screens&#8221; or panels that follow the shapes of common devices like smartphones, tablets, TVs (both 4:3 and 16:9 ratios), or just plain squares. These can accommodate text or images and they spring around the screen, creating fun interactions while also delivering programming information or promotional messaging. The screens introduce a mix of studio-provided imagery (say, Chewbacca) coupled with &#8220;user&#8221; imagery &#8212; which for now look like stock photos and footage but ideally these would be generated\/provided by real users &#8212; for an interesting mix of corporate-ness and human-ness. The language can get a little too playful or annoyingly hashtag-y but since it has to work in quick bursts I can see why it would be kept somewhat simple. All the typography is handled in a custom (I think) version of <a href=\"https:\/\/www.colophon-foundry.org\/typefaces\/apercu\/\" target=\"_blank\" rel=\"noopener noreferrer\">Aperçu<\/a>, which is undeniably effective.<\/p>\n<blockquote>In addition, the &#8217;emovicons&#8217; were produced based on the proportions of the &#8216;M+&#8217; icon, to further develop an emotional voice for the brand, and a sense of human appearence. The sum of the graphic language elements enhances the conversation, to back up and connected with content which is produced by the viewer, making him the center of the identity.<\/blockquote><h3><a href=\"http:\/\/wearemucho.com\/project\/movistarplus\/\" target=\"_blank\" rel=\"noopener noreferrer\">Mucho project page<\/a><\/h3>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/movistar_plus_emovicons.png\" alt=\"New Logo, Identity, and On-air Look for Movistar+ by Mucho and Cómodo\" \/>\n<hr \/>\n<div class=\"video-container\"><video controls><source src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/movistar_plus_emovicons_animated.mp4\" type=\"video\/mp4\">Your browser does not support the video tag.<\/video><\/div>\n<figcaption>&#8220;Emovicons&#8221;.<\/figcaption>\n<\/figure>\n<p>To add some spice to the identity, there is the addition of the &#8220;E<em>movi<\/em>cons&#8221; that use &#8220;› ‹&#8221; as the basis to create a series of funny faces that, I think, are the best part of the identity in that they introduce something completely new, unexpected, and with plenty of personality. The whole identity is overly colorful and, at times, the Emovicons make things look like a kid&#8217;s or teenager&#8217;s programming block&#8230; I would love to see these evolve into something a little darker, perhaps literally being black and white to serve as a clear point of contrast to the rest of the aesthetic. But I may also be completely wrong in that idea; I just feel like it&#8217;s too much of one tone &#8212; Playful! We are friends! Still, love the Emovicons.<\/p>\n<blockquote>The new Movistar+ identity reaches its full potential on air, behaving as an expressive tv multiplatform language. The on air avatar logo comes to life with the &#8216;M&#8217; acting as a visual narrator, and the &#8216;+&#8217; sign becoming a cursor. The avatar sets the pace and introduces the &#8217;emovicons&#8217;. The multiscreen language develops into an endless canvas of scalable content boxes. The combination of these elements creates a seamless identity system, easy to use and to integrate texts, pictures an videos, with chanel information and user content.<br \/><br \/>The identity pieces use social media codes, using popular internet content or the platform&#8217;s own content to generate a fun and surprising language, aimed at talking with the viewer in a natural way. In the ids, the divide between on and offline is blurred by a series of visual metafors. Finally the audiobranding has been concieved as a puzzle of interchanging sounds. This generates an open system, which can grow along with the future communication needs of the platform.<\/blockquote><h3><a href=\"http:\/\/wearemucho.com\/project\/movistarplus\/\" target=\"_blank\" rel=\"noopener noreferrer\">Mucho project page<\/a><\/h3>\n<figure class=\"full\"><div class=\"video-container\"><iframe src=\"https:\/\/player.vimeo.com\/video\/205587461?title=0&#038;byline=0&#038;portrait=0\" width=\"500\" height=\"281\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen><\/iframe><\/div>\n<figcaption>Full case study in motion.<\/figcaption>\n<\/figure>\n<p>The full range of motion and on-screen behavior is overwhelming&#8230; in a good way. There is so much to see and break down from the video above that I have actually put off writing this post for a few days because I couldn&#8217;t process all the materials both in terms of preparing them for publication and in figuring out what to say about them. (I have posted about half the materials of what&#8217;s available in the 53-slide project page at Mucho.) There are plenty of things to like here, from the audio beeps and bloops that accentuate the animations, to the expanding-shifting screens, to the overlaying of animated Emovicons, to the cohesive user interfaces across devices. In a way, we&#8217;ve seen some of these aesthetics and motion behaviors in bits and pieces of other on-air work but the consistency and breadth of application in this case is impressive and entertaining.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/movistar_plus_various_materials.jpg\" alt=\"New Logo, Identity, and On-air Look for Movistar+ by Mucho and Cómodo\" \/>\n<hr \/>\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/movistar_plus_various_materials_02.jpg\" alt=\"New Logo, Identity, and On-air Look for Movistar+ by Mucho and Cómodo\" \/>\n<hr \/>\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/movistar_plus_box.jpg\" alt=\"New Logo, Identity, and On-air Look for Movistar+ by Mucho and Cómodo\" \/>\n<figcaption>Various, colorful materials.<\/figcaption>\n<\/figure>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/movistar_plus_newspaper_ads.jpg\" alt=\"New Logo, Identity, and On-air Look for Movistar+ by Mucho and Cómodo\" \/>\n<figcaption>Newspaper ads.<\/figcaption>\n<\/figure>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/movistar_plus_outdoor_ads.jpg\" alt=\"New Logo, Identity, and On-air Look for Movistar+ by Mucho and Cómodo\" \/>\n<figcaption>Outdoor ads.<\/figcaption>\n<\/figure>\n<p class=\"end\">In print, the panels and Emovicons translate quite well and they make good use of white space to create focus for the identity elements &#8212; the newspaper ads are a particularly good representation, it would be hard <em>not<\/em> to notice them if you are flipping through a newspaper (if you read newspapers, that is) &#8212; and there is a great flexibility to it that allows for something full bleed like the bearded basketball ad to something purely graphic like the top-left ad above. Overall, this is a difficult project as it&#8217;s an identity that has to stay consistent across way too many mediums and get the attention of viewers with very different tastes and interests and it has all been done with what is an apparent sense of joy and playfulness.<\/p>","protected":false},"excerpt":{"rendered":"Launched in 2015, Movistar+ is a subscription platform for digital television that resulted from the merger of Canal+ and Movistar TV (originally launched in 2003 and 2001, respectively). Owned by Telefónica and available in various Spanish-speaking countries with its biggest&#8230;","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[9,66,26],"tags":[617,932,1188,290,627,395],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/5293"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=5293"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/5293\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=5293"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=5293"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=5293"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}