{"id":5447,"date":"2017-05-01T06:21:21","date_gmt":"2017-05-01T11:21:21","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/we_are_moving.php"},"modified":"2017-05-01T06:21:21","modified_gmt":"2017-05-01T11:21:21","slug":"we_are_moving","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/we_are_moving.php","title":{"rendered":"We are Moving!"},"content":{"rendered":"<p>Over the course of the Summer, UnderConsideration headquarters will relocate from Austin, TX, to Bloomington, IN. A few more thoughts about the change below, but first the main reason why I am sharing this: This Thursday, I get in a minivan with our two dogs, my desktop computer, a printer, and hard drives with our life&#8217;s work and drive to Indiana. Between now and then I have to finish packing and finalize the 2017 Brand New Conference website &#8212; launching this Wednesday &#8212; so there will be no new posts until May 8.<\/p>\n<!--more--><p>If you are curious about this move:<\/p>\n<p>Brand New is powered by UnderConsideration, UnderConsideration is powered by two single human beings, those human beings being me and my wife (and business partner) Bryony. We have two daughters, two dogs, and we do everything we do from home. (Our daughters are finishing the school year here with Bryony, then taking our annual trip to Mexico, then we will all be officially moved to Indiana).<\/p>\n<p>One of the keys to doing what we do, which is an unconventional and highly unlikely way of earning an income &#8212; an income that is sufficient for a few extravagances like an HBO subscription (I know, living large!) &#8212; for two adults, two kids, and two dogs, is to have a low cost of living. When we moved from New York, NY, to Austin, TX, in 2009, we achieved this because New York is ridiculous, we had a single kid (and no dogs), and the value of our Austin house compared to that of our New York semi-shithole was amazing. Over the next 8 years our life has expanded to include an extra kid and canines. Over these same 8 years, the cost of living in Austin has increased, our property taxes are off the roof, and the traffic has become pretty insane. Even the Austin airport, which was super chill is now nearing JFK levels at peak hours. In principle though we still love Austin; it&#8217;s a fantastic city but it&#8217;s not working for us anymore. We are in no way against Austin and it&#8217;s a city like few others, as the year-over-year exponential population growth has demonstrated.<\/p>\n<p>So, why Bloomington? Before we started thinking about a move, I had never heard of Bloomington. A friend of ours from New York, who grew up and now lives there again, recommended it. After some Googling: it is home to Indiana University, one of the top ten biggest and best-est universities in the U.S.; the population is 80,000+ (not counting the 40,000+ transient students); like Austin, it is a college town-slash-blue-bubble-in-a-red-state; it has tremendously good public schools; it is fucking beautiful. Oh, and the houses are twice the size and half the mortgage.<\/p>\n<p>That last bit is super important for us; cutting our monthly costs will allow us to keep this unconventional trajectory and allow us to keep the focus on this blog, the other blogs, the conference, our kids, our dogs &#8212; OUR FAMILY &#8212; and other projects with less financial burden. There are a ton of other reasons why we are excited about Bloomington, but I&#8217;ll spare you from many more details; follow us on Instagram to see what we are seeing in this new land if you are curious: <a href=\"https:\/\/www.instagram.com\/arminvit\/\" target=\"_blank\" rel=\"noopener noreferrer\">@arminvit<\/a> \/ <a href=\"https:\/\/www.instagram.com\/bryonygp\/\" target=\"_blank\" rel=\"noopener noreferrer\">@bryonygp<\/a>.<\/p>\n<p>We may lose some &#8220;street cred&#8221; for being in a tiny, middle-of-the-country town but we choose lifestyle and peace of mind over any external pressure to be in a cool hub. We would rather use the money we save to travel with our kids and have us all experience a little bit of everything than keep paying the high price cities like Austin now demand.<\/p>\n<p>We are half-lucky, half-worked-our-asses-off to do what we do from anywhere in the country so as long as we have an internet connection we will continue doing what we are doing and Brand New will keep on keeping on, regardless of location.<\/p>\n<p class=\"end\">So: No new posts until next week; Brand New Conference speaker announcement on Wednesday. Thanks for your continued readership and interest in Brand New!<\/p>","protected":false},"excerpt":{"rendered":"Over the course of the Summer, UnderConsideration headquarters will relocate from Austin, TX, to Bloomington, IN. A few more thoughts about the change below, but first the main reason why I am sharing this: This Thursday, I get in a&#8230;","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[23],"tags":[1235],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/5447"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=5447"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/5447\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=5447"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=5447"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=5447"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}