{"id":550,"date":"2007-10-29T00:00:01","date_gmt":"2007-10-29T05:00:01","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/toys_r_us_grows.php"},"modified":"2007-10-29T00:00:01","modified_gmt":"2007-10-29T05:00:01","slug":"toys_r_us_grows","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/toys_r_us_grows.php","title":{"rendered":"Toys R Us Grows"},"content":{"rendered":"<p><\/a><img  src=\"https:\/\/www.underconsideration.com\/brandnew\/before_after_toysrus_1.gif\" alt=\"Toys R Us Logo, Before and After\" \/><\/p>\n<p>Toys R Us, Inc. finally trimmed a thread of frivolous grammatical imposition from their logo. The company&#8217;s new legal name is Toys R Us&#8230;(no quotation marks around the backwards R). The star has been stuffed into the engorged R in order to make a tight and simple(r) wordmark which is less patriotic, more bulbous and more <em>fun<\/em>.<\/p><!--more--><p>This cleanup of the standby colloquial faux-mistake &#8220;R&#8221; is the result of a re-branding process which puts the company and its family of sub-brands right up-to-date with the implicit actions of their audience: kids who don&#8217;t dwell on writing mistakes or punctuation, and would rather just get lost in toys and acting their age. So the famous jingle by ad-veteran <a href=\"http:\/\/www.kaplanthaler.com\/\">Linda Kaplan Thaler<\/a> goes:<\/p>\n<blockquote>I don&#8217;t want to grow up, I&#8217;m a Toys R Us kid. There&#8217;s a million toys at Toys R Us that I can play with! More bikes, more trains, more video games, it&#8217;s the biggest toy store there is! I don&#8217;t want to grow, because then if I did, I wouldn&#8217;t be a Toys R Us kid!<\/blockquote>\n<p>If you need a reminder <a href=\"https:\/\/www.youtube.com\/watch?v=-WEqNkKX7Rw\">try this,<\/a> <a href=\"https:\/\/www.youtube.com\/watch?v=-WEqNkKX7Rw\">or this<\/a> ad from 1986.  The Jingle is gone&hellip; but not forgotten.<\/p>\n<p>Founder Charles Lazarus punned the brand name out of his own: Laz &#8220;R&#8221; Us owned a kids furniture store during the post-war baby boom era; kids and parents started asking for toys and so it came to be&#8230;Toys &#8220;R&#8221; Us. The backward-ness of the R was meant to evoke child&#8217;s naivet&eacute;. Curiously, in the Russian Alphabet, the letter (?) pronounced &#8220;ya,&#8221; is the personal pronoun &#8220;I.&#8221; One <em>could<\/em> wonder if Mr. Lazarus had an affinity for the commy-tongue, as he was a cryptologist in WWII. It&#8217;s goofy to have any sign spelled wrong, and kids crack the code. &#8220;We at Toys R Us are young and like toys, also, when it comes to matters of spelling&#8211;well, this is a toy store&#8211;not a classroom.&#8221;<\/p>\n<p>The festive appearance of what would be a box of a store communicates play and experience. Even in small spaces, the backlit signs do the job. The authority of its sign&#8217;s huge letters not only accurately hint to the kids at the fun contents of the box, but it nods to parents who turn to it as a one-stop experiential pacifier: a commercial playground at which their family can pass the afternoon. Toys R Us remains the bright beacon of hope, the reward to end any 4-hour shopping spree.<\/p>\n<p><img loading=\"lazy\" alt=\"store_1.gif\" src=\"https:\/\/www.underconsideration.com\/brandnew\/store_1.gif\" width=\"470\" height=\"200\" \/>\n<img loading=\"lazy\" alt=\"store_2.gif\" src=\"https:\/\/www.underconsideration.com\/brandnew\/store_2.gif\" width=\"470\" height=\"200\" \/>\n<img loading=\"lazy\" alt=\"store_3.gif\" src=\"https:\/\/www.underconsideration.com\/brandnew\/store_3.gif\" width=\"470\" height=\"200\" \/>\n<img loading=\"lazy\" alt=\"store4.gif\" src=\"https:\/\/www.underconsideration.com\/brandnew\/store4.gif\" width=\"470\" height=\"200\" \/><\/p>\n<p>Apparently, 400 of these stores will receive facelifts soon&#8230; <em>in light<\/em> of the new branding campaign by <a href=\"http:\/\/www.leoburnett.com\/\">Leo Burnett<\/a>. A beautiful collection of their old stores can be seen on <a href=\"http:\/\/ccsu.facebook.com\/album.php?aid=2024573&#038;l=9382b&#038;id=48807574\">here<\/a>.<\/p>\n<blockquote>&#8220;For the past 18 months we&#8217;ve been rebuilding our business to provide our customers with stores that are easier to navigate and feature exclusive products that they can&#8217;t get anywhere else combined with a superior shopping experience that&#8217;s second to none,&#8221; said John Eyler, Chairman and CEO of Toys &#8220;R&#8221; Us, Inc. &#8220;Now, with about 60% of the chain in the new store formats &mdash; the balance will be ready by holiday 2002 &mdash; we&#8217;re ready to tell the world about what&#8217;s been going on at Toys &#8220;R&#8221; Us through our new branding campaign.&#8221;<\/blockquote>\n<p><a href=\"https:\/\/www.youtube.com\/watch?v=QMj24bORaMs&#038;NR=1<br \/>\n&#8220;>Just as he did in 1978<\/a>, Geoffrey the Giraffe remains a rigorous mascot who has accompanied the store to lend a friendly, safe, non-corporate tone, though the other day my friend actually saw Geoffrey chasing some scared pedestrians down Broadway near the new Toys R Us <a href=\"http:\/\/copyranter.blogspot.com\/2007\/09\/closest-ive-ever-come-to-firebombing.html\">popup<\/a> location. Geoff&#8217;s evolution is striking: he has gone from a cartoon to a realistic to a 14-foot animatronic Stan Winston creation, with the distinctive buttery voice of Jim (brother-of-Tom) Hanks. <\/p>\n<p><img loading=\"lazy\" alt=\"geoff.gif\" src=\"https:\/\/www.underconsideration.com\/brandnew\/geoff.gif\" width=\"250\" height=\"250\" \/>\nThis <em>may<\/em> be the new animatronic Geoffrey.<\/p>\n<p>Cheryl Berman, chairman and creative officer at Leo Burnett USA says in this <a href=\"http:\/\/www.allbusiness.com\/construction\/4266768-1.html\">article on the rebranding<\/a>&#8230; &#8220;Geoffrey&#8217;s just what we need in today&#8217;s world to remind us of the delight we experience in making our children happy.&#8221; <\/p>\n<p>So, to recap, slight and often imperceptible cleanups include:<br \/>\n-The loss of the quotation marks. (redundant?)<br \/>\n-Moving the big marshmellow holding-shape star into the counter of the R (for less cutesy patriotism?)<br \/>\n-Redrawn, rescaled and re-spaced lettering (to signal more extreme and varied toys?)<br \/>\n-Shifting wordmark colors to simpler equivalents (more timeless and easier to control on screen.?)<br \/>\n-Neutral blue for background-control (to harness the white stroke on the web?)<br \/>\n-Cleanup of related brand logos, such as the clothes store &#8216;Babies R Us&#8217;. <\/p>\n<p><img loading=\"lazy\" alt=\"babies.gif\" src=\"https:\/\/www.underconsideration.com\/brandnew\/babies.gif\" width=\"467\" height=\"112\" \/><\/p>\n<p>Overall, this is an improvement over the former mark. They didn&#8217;t toss any real equities, and it seems that they&#8217;re guidelining it so that it can look the same in Detroit as it does in Dubai. Both the current and former operate on a necessary visceral level&#8230;and carries multiple burdens very well. The logo still has a background control issue, which are almost solved by squishing the letters together. Nonetheless, the white outline won&#8217;t always be necessary, and at times will be critical in providing visibility against the beige stucco\/crag storefronts. Those quotation marks have long played a belt-and-suspenders role to parse the R; so it is logical and pleasing to see it without. In fact, it elucidates the R and just lets in all the goofy. Also, these new colors will probably be easier to manage now that yellow is gone (usually a nightmare to achieve in print and light).<\/p>\n<p>One would hope for the sake of environmental sensibility that the company does not hastily remake every single piece of signage and business collateral in their big box stores across 30 countries&#8230; There can&#8217;t possibly be a pressing need or benefit to shareholders and audiences to communicate this nearly imperceptible change. Rather, this could be a sober implementation that is installed on new stores, and so-forth on an as-needed basis.<\/p>\n<p>Young users of the metaverse, or internet as it were, have long-used shorthand chat-room English to communicate casually and quickly-kids today know this sh*t cold; and it&#8217;s dorky to use quotes, save that for 7th grade.<\/p>\n<p><strong>Bonus<\/strong>: Here&#8217;s that fun balloon font, <a href=\"http:\/\/www.free-font-downloads.com\/13.Company-Fonts\/1337.Toys-R-Us.html\">ToyBox<\/a>.<\/p>","protected":false},"excerpt":{"rendered":"<img src=\"https:\/\/www.underconsideration.com\/brandnew\/images\/excerpt_empty.gif\" alt=\"Excerpt Empty\" \/>","protected":false},"author":8,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[9,86,26],"tags":[],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/550"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/8"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=550"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/550\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=550"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=550"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=550"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}