{"id":553,"date":"2007-11-06T12:26:37","date_gmt":"2007-11-06T18:26:37","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/enterprise_gets_unionized.php"},"modified":"2007-11-06T12:26:37","modified_gmt":"2007-11-06T18:26:37","slug":"enterprise_gets_unionized","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/enterprise_gets_unionized.php","title":{"rendered":"Enterprise gets Unionized"},"content":{"rendered":"<p><img loading=\"lazy\" alt=\"TBU_beforeafter.jpg\" src=\"https:\/\/www.underconsideration.com\/brandnew\/TBU_beforeafter.jpg\" width=\"470\" height=\"192\" \/><\/p>\n<p>The toughest task a designer can undertake is creating an identity for oneself. Who hasn&#8217;t taken endless months to decide on just the right symbol, the perfect typography, the best paper stock, and, of course, that extra cool finishing touch: which letterpress printer to use?  Most of us only have ourselves to please in this regard (and maybe our significant others).  So imagine when a global identity consultant decides that not only do they need a new identity, they&#8217;re going to change the name as well. Fare thee well, Enterprise IG. The powers-that-be have elected to join <a href=\"http:\/\/www.thebrandunion.com\" target=\"_blank\" rel=\"noopener noreferrer\">The Brand Union.<\/a><\/p><!--more--><p><img loading=\"lazy\" alt=\"TBU_symbol.jpg\" src=\"https:\/\/www.underconsideration.com\/brandnew\/TBU_symbol.jpg\" width=\"470\" height=\"281\" \/><\/p>\n<p>Brand agencies are notorious for not exactly embracing the notion of a visual identity for themselves.  Landor, Interbrand and even Pentagram get by with a classic red serif typeface.  A few sport some, if not overly dramatic, symbol.  Futurebrand has its circle-F. CoreBrand waves the flag. Sterling has a cute pointer. And DesGrippes Gobe has a small star.  And to top it all, I don&#8217;t think Wolff Olins even has a single visual identifier anymore.  The overall message they are all saying is that our identity is really our clients&#8217; identities.  The client defines the agency, instead of the agency defining itself.  No wonder the land of branding seems a bit muddled these days.<\/p>\n<p>As a bit of background, Enterprise IG, a part of the WPP holding group, was built from design agencies that were merged in 1996, including legendary NY studio Anspach Grossman Portugal (look &#8217;em up, kids, they defined corporate identity in NY in the 80s), SBG from San Francisco and Sampson Tyrrell in London. Unfortunately, what happened was not atypical: they all merged together under a generic brand that neither clients nor internal staff ever really embraced or knew much about. Leadership finally recognized this and have made a great step in defining themselves as clear as possible.<\/p>\n<p>With their new logo, The Brand Union (and don&#8217;t leave out the &#8220;The&#8221;) wanted to set themselves apart from the other identity-less firms. US CEO Rita Rodriguez says that the refined positioning of the company reflects a dedication &#8220;to mastering the art and science of brand building&#8221;. That the word &#8220;art&#8221; was actually included is, frankly, shocking to me. I have always gotten the impression that art, being so subjective, is better left in the backroom while the focus is on the more nebulous, but business-approved, notion of branding, where you can at least offer some metrics. What I&#8217;ve been told is that the senior executives truly wanted the company&#8217;s creativity to be expressed in their logo, to ensure that clients understood that side of the equation. I think they&#8217;ve done it. Building the symbol out of the counters and negative space suggests a creative way at looking at a design problem and supports the overall positioning of a company with a wide breadth of offerings and a global network to support it. In <a href=\"http:\/\/www.prnewswire.com\/cgi-bin\/stories.pl?ACCT=104&#038;STORY=\/www\/story\/11-05-2007\/0004698056&#038;EDATE=\" target=\"_blank\" rel=\"noopener noreferrer\">press-release-speak<\/a>, this is noted as symbolizing &#8220;the process of bringing together the people, ideas, and touchpoints that brands need to thrive.&#8221; Not exactly unique language, but the logo speaks better for itself. The blue and gray, while conservative, are nonetheless nice and pleasing. At least it&#8217;s something, considering the previous color was black. Overall, it&#8217;s a nice left-brain\/right-brain balance.<\/p>\n<p><img loading=\"lazy\" alt=\"tbu_pattern1.jpg\" src=\"https:\/\/www.underconsideration.com\/brandnew\/tbu_pattern1.jpg\" width=\"470\" height=\"209\" \/><\/p>\n<p>To further express the creative nature of the organization, the shapes within the mark are used as a graphic language, from patterns to maps to anything you can make out of it.  Some ideas for using the shapes that were kicked around internally ranged from post-it notes to ice cube trays. Seriously. And while those might seem a bit nutty, having a visual language where pretty much anything can be created gives this identity a long life and the ability to be refreshed and updated along the way.<\/p>\n<p>\n<img loading=\"lazy\" alt=\"tbu_map.jpg\" src=\"https:\/\/www.underconsideration.com\/brandnew\/tbu_map.jpg\" width=\"470\" height=\"237\" \/><\/p>\n<p>\nSo while the symbol is a nice breath of fresh air in this space, I can&#8217;t say as much for the name. Clearly, Enterprise IG had to go.  They had a name conflict with Enterprise rental cars. And while that seems odd, it caused conflicts when legally naming the organization in different countries of operation. Hence the &#8220;IG&#8221; tacked on that never really made sense. But the biggest issue was that the name just didn&#8217;t explain enough what they did, causing a lot of confusion and making business development a still harder task. But, &#8220;The Brand Union&#8221;?  Hmm. With the proliferation of &#8220;Brand&#8221; in every agency name out there, it risks being lost in the crowd.  Interbrand. Futurebrand. Corebrand. BrandLogic. Brandient. BrandEquity International. Yes, we get it. You guys do branding. But I like the &#8220;Union&#8221; portion, as it&#8217;s very clear, not elitist, and to the point: a merging of client and agency with a singular focus.  <\/p>\n<p>The agency is based in London, but the final design was developed in the New York office by Jaime Burns and led by Executive Creative Director Wally Krantz.<\/p>\n<p><img loading=\"lazy\" alt=\"TBU_ice.jpg\" src=\"https:\/\/www.underconsideration.com\/brandnew\/TBU_ice.jpg\" width=\"470\" height=\"292\" \/>\n<strong>Those ice cube trays.<\/strong><\/p>","protected":false},"excerpt":{"rendered":"<img src=\"https:\/\/www.underconsideration.com\/brandnew\/images\/excerpt_empty.gif\" alt=\"Excerpt Empty\" \/>","protected":false},"author":16,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[9,71,26],"tags":[],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/553"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/16"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=553"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/553\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=553"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=553"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=553"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}