{"id":573,"date":"2008-01-02T20:59:22","date_gmt":"2008-01-03T02:59:22","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/branding_apple_pie_and_chevrol.php"},"modified":"2008-01-02T20:59:22","modified_gmt":"2008-01-03T02:59:22","slug":"branding_apple_pie_and_chevrol","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/branding_apple_pie_and_chevrol.php","title":{"rendered":"Branding, Apple Pie and Chevrolet"},"content":{"rendered":"<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/upperdeck_logo.gif\" alt=\"Upper Deck Logo, Before and After\" \/><\/p>\n<p><span class=\"small\"><strong>Guest Editorial by Von Glitschka<\/strong><\/span><\/p>\n<p>As a kid I grew up collecting baseball trading cards. I never worried about getting the entire set, I just collected the players I liked best. As far as the product was concerned it was pretty low-grade card stock, cheap full-color printing on the front with a one spot color uncoated back. The rock hard stick of chewing gum that came with each pack would often ruin the card next to it, or stain it with the white powder that coated the gum. This went on year in and year out throughout my childhood with a few new companies coming on the scene but still using the same tired methodology. In 1989 a new rookie company entered the trading card game. Its name was <a href=\"http:\/\/www.upperdeck.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Upper Deck<\/a>.<\/p><!--more--><p>They created a new breed of trading cards, high-grade card stock, full color both sides, unique die-cuts, foil stamping, holographics, jersey insert cards and no lame ex-cuse for gum. Simply put they changed the rules of the game to their own liking and soon became the favorite of collectors everywhere. (Having the Ken Griffey Jr. rookie card in their premiere set didn&#8217;t hurt their efforts either.)<\/p>\n<p>Upper Deck was the first trading card company to sign specific athletes as spokesper-sons for their product, first to offer high-end specialty cards featuring actual pieces of player jerseys and other game-used memorabilia. Upper Deck has not only created fun collectible content they have also pioneered technology to prevent counterfeiting and forgery to ensure that the collectibles they create retain their value.<\/p>\n<p>When I first started collecting cards it cost me about $.05 per pack and when I stopped it was at $.50 per pack. Now serious collectors can buy ultra premium packs that guaran-tee you&#8217;ll get game-used insert cards for $100 a pack. Needless to say things have changed and as collectors grow up and become more sophisticated new product lines are developed to cater them.<\/p>\n<p>Since Upper Deck is now the world&#8217;s best known creator of sports collectibles it was time to update their own identity. But unlike other large corporations that turn to big branding agencies to solve this problem, Upper Deck looked within, to their own lineup of in-house designers to step up to the plate.<\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/uppderdeck_logo_detail.jpg\" alt=\"Upper Deck Logo Detail\" \/><\/p>\n<p><span class=\"small\"><strong>Up Close and personal with Upper Deck&rsquo;s new mark.<\/strong><\/span><\/p>\n<p>VP of Creative Martin Welling led Upper Deck&rsquo;s re-design efforts for the new brand logo and shares their design direction on this project.<\/p>\n<p><em>&#8220;Not wanting to diminish our brand promise of authenticity, superior content, innovation and quality, we knew there was a visual legacy associated with our mark that we did not want to walk away from. We determined very early in the process that several visual cues needed to be retained in the new solution; that the assignment was more of updating and not replacing,&#8221; said Welling.<\/em><\/p>\n<p><em>&#8220;Specifically in the design process, we wanted to accomplish three things: make our branding more contemporary to create a stronger emotional link with our customers; make our mark more legible to improve our presence at retail; and make our mark more prominent and bold to stand out against our competitors.<\/em><\/p>\n<p><em>&#8220;Although we considered outside resources in helping design the new mark, we came to the conclusion that only we had the history and insight necessary to accomplish the redesign.<\/em><\/p>\n<p><em>&#8220;We feel our new logo successfully improves and updates our branding. Most importantly, it unifies the sports, entertainment and collectibles business groups under one mark.&#8221;<\/em><\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/secondaryupperdeck_logos.jpg\" alt=\"Upper Deck Secondary Logos\" \/><\/p>\n<p><span class=\"small\"><strong>Secondary logos.<\/strong><\/span><\/p>\n<p>Like a professional athlete that continues to play well beyond his prime, the old logo simply needed to be retired. It&#8217;s static, the interaction of the type and shapes cause vis-ual tension, the color palette had become antiquated and the type itself was hard to read at smaller sizes due to the interior areas being too small. And, like a new all-star rookie prospect, the new logo reflects what Upper Deck has become. Active, bold, pro-gressive and powerful all the while retaining enough equity from its former incarnation to remain recognizable.<\/p>\n<p>The same designers that have facilitated Upper Deck&rsquo;s success over the past 20 years stepped up to the plate and hit it out of the park. There are a lot of so-called branding agencies that can&#8217;t say the same with the multi-national brands they&#8217;ve re-designed of late. Like the Yankees, a big budget doesn&#8217;t always translate to success.<\/p>\n<p>Upper Deck is now a seasoned pro and has moved well beyond mere sports trading cards. They are an entertainment company too, designing limited edition collectible toys &mdash; think <a href=\"http:\/\/www.kidrobot.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Kid Robot<\/a> &mdash; developing their own brands of trading card games as well as licensing some of the best known fantasy brands like &#8220;World of Warcraft&#8221;, &#8220;Yu-Gi-Oh!&#8221;, &#8220;Hell Boy&#8221; and &#8220;Marvel.&#8221;<\/p>\n<p>One color, spot with gold metallic and an etched version for foil stamping.<\/p>\n<p>With so many diverse product lines and levels of consumer cost, Upper Deck needed a new logo that was flexible enough to adapt to each. The Upper Deck designers created a logo that could easily work into any design context whether it was being knocked out of a color background, printed in metallic spot colors or foil stamped. (The etched art above is used on foil stamping at around .25 inches in size.)<\/p>\n<p>Upper Deck&rsquo;s brand positioning is now well equipped to further the company growth for at least another twenty years. I may no longer collect trading cards, but if I did, I&#8217;d buy Upper Deck if for no other reason then because they are so well designed.<\/p>\n<p><span class=\"small\"><strong><a href=\"http:\/\/www.glitschka.com\" target=\"_blank\" rel=\"noopener noreferrer\">Von Glitschka<\/a> has worked in the communication arts industry for 20 years. His modus operandi is that of a hired gun for both in-house art departments and medium to large creative agencies working on projects for such clients as Microsoft, Adobe, Pepsi, Rock &#038; Roll Hall of Fame, Major League Baseball, Hasbro, Bandai Toys, Merck, Disney, and HGTV.<\/strong><\/span><\/p>","protected":false},"excerpt":{"rendered":"<img src=\"https:\/\/www.underconsideration.com\/brandnew\/images\/excerpt_empty.gif\" alt=\"Excerpt Empty\" \/>","protected":false},"author":5,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[9,26,87],"tags":[],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/573"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=573"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/573\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=573"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=573"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=573"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}