{"id":578,"date":"2008-01-20T09:02:05","date_gmt":"2008-01-20T15:02:05","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/a_torch_is_a_terrible_thing_to.php"},"modified":"2008-01-20T09:02:05","modified_gmt":"2008-01-20T15:02:05","slug":"a_torch_is_a_terrible_thing_to","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/a_torch_is_a_terrible_thing_to.php","title":{"rendered":"A Torch is a Terrible Thing to Waste"},"content":{"rendered":"<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/uncf_logo.gif\" alt=\"UNCF Logo, Before and After\" \/><\/p>\n<p>When I was younger and living in Mexico City I used to have a constant tan due to my family&#8217;s recurring vacations in the seaside town of Acapulco and the ever present sun amplified by Mexico&#8217;s choking pollution. Because of that, and because I grew up in a Jewish community where everybody&#8217;s skin hue was remarkably light, my nickname was &#8220;Negro&#8221; (pronounced, more or less, &#8220;neh-graw&#8221;) or its diminutive version, &#8220;Negrito&#8221; (&#8220;neh-gree-taw&#8221;) for closer friends. To this day, my parents still call me that. But just at home or on the phone. When I first moved to the U.S. and was working for Internet conglomerate marchFIRST, my dad was worried that during our e-mail exchanges someone scanning our correspondence would think that using the word Negro or Negrito was done in a pejorative way. In the last seven years, my lovely tan has distilled due to all the fluorescent light and lack of sunlight and, certainly, no one here in the U.S. would call me by my old nickname so it is now a thing of the past &mdash; and something that the <a href=\"http:\/\/www.uncf.org\/\" target=\"_blank\" rel=\"noopener noreferrer\">United Negro College Fund<\/a> (UNCF) hopes to achieve soon with its first major rebranding since 1972, lead by <a href=\"http:\/\/www.landor.com\" target=\"_blank\" rel=\"noopener noreferrer\">Landor Associates<\/a>.<\/p><!--more--><p>While the <a href=\"http:\/\/www.landor.com\/?do=aboutus.pressrelease&#038;storyid=554&#038;r=2006_2008\" target=\"_blank\" rel=\"noopener noreferrer\">press release<\/a> and this Landor-prepped <a href=\"http:\/\/www.uncf.org\/HowWeGotHere.htm\" target=\"_blank\" rel=\"noopener noreferrer\">slide show<\/a> &mdash; which, by the way, would be lovely if every logo came with something like this available publicly instead of being held close to the chest, since presentations like this are usually the best way to &#8220;sell&#8221; a logo and demonstrate what happened from Point A to Point B &mdash; tiptoe around the obvious issue with the name and the negative connotations that the word &#8220;Negro&#8221; carries today and focuses on ambiguous things like &#8220;heritage&#8221;, it&#8217;s Michael L. Lomax, UNCF&#8217;s president and chief executive, comment that summarizes the change best in <a href=\"http:\/\/www.nytimes.com\/2008\/01\/17\/business\/media\/17adco.html\" target=\"_blank\" rel=\"noopener noreferrer\">this <em>New York Times<\/em> article<\/a>:<\/p>\n<blockquote>&#8220;Forty-plus years ago, when I started at Morehouse, I thought of myself as a Negro. By the time I graduated in 1968, I was black. And then in the last 15 to 20 years I&#8217;ve become an African-American.&#8221;<\/blockquote>\n<p>Beyond the updated visual identity, the strategic decision to move into an acronym brand is the strongest change UNCF has signaled allowing it to outgrow its uncomfortable-to-say-nowadays name and be recognized as an organization devoted to allow students to excel in education regardless of race. The visual change is, of course, a welcome one. The old torch symbol &mdash; referred to as the Leadership Torch &mdash; was clunky and heavy handed, despite a very Saulbassian UNCF lock-up acting as the handle of the torch. As we discussed in the <a href=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/start_with_trust_simmer_in_des.php\" target=\"_blank\" rel=\"noopener noreferrer\">Better Business Bureau post<\/a>, drawing torches is no easy task, but Landor has done a remarkable job in creating one that feels energetic (the flame blowing to the side with the wind was a nice touch) and authoritative in a good way, even if the handle may be too big and the flame too small. The typography in general is a vast improvement, the old upper\/lowercase application set in that phototypesetting-era serif is replaced with a modern sans, including the curvy &#8220;l&#8221;s that seem to be all the rage these days. I&#8217;m not sure what that typeface is nor what UNCF is set in, but I <em>think<\/em> they are different typefaces &mdash; not something too worrisome, but they just feel a little different from each other.<\/p>\n<p>And speaking of my formative years in Mexico, where I learned most of what I know now about American culture through a satellite dish on the roof of my parents&#8217; house, there are two advertising slogans that I remember: <strong>1)<\/strong> &#8220;<a href=\"http:\/\/en.wikipedia.org\/wiki\/This_is_Your_Brain_on_Drugs\" target=\"_blank\" rel=\"noopener noreferrer\">This is your Brain on Drugs<\/a>&#8221; and <strong>2)<\/strong> &#8220;<a href=\"http:\/\/www.adcouncil.org\/default.aspx?id=134\" target=\"_blank\" rel=\"noopener noreferrer\">A Mind is a Terrible Thing to Waste<\/a>&#8220;. And I must admit, that until today, I did not associate the latter with UNCF, possibly because at the time my awareness interest in social and educational issues was minimal and mostly because it was a phrase that everyone everywhere seemed to repeat as the ultimate zinger for people doing dumb things. The new logo turns up the volume on the slogan and makes it an integral part of the identity, instead of treating it like a footnote, hoping for more association between UNCF and the slogan. As far as my nickname&hellip; that too is a terrible thing to waste, it fit me so well.<\/p>","protected":false},"excerpt":{"rendered":"<img src=\"https:\/\/www.underconsideration.com\/brandnew\/images\/excerpt_empty.gif\" alt=\"Excerpt Empty\" \/>","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[9,29,26],"tags":[],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/578"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=578"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/578\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=578"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=578"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=578"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}