{"id":579,"date":"2008-01-14T21:57:17","date_gmt":"2008-01-15T03:57:17","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/were_going_to_pump_clap_your_l.php"},"modified":"2008-01-14T21:57:17","modified_gmt":"2008-01-15T03:57:17","slug":"were_going_to_pump_clap_your_l","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/were_going_to_pump_clap_your_l.php","title":{"rendered":"We&#8217;re Going to Pump&hellip; [Clap!]&hellip; Your Logo Up!"},"content":{"rendered":"<p><img loading=\"lazy\" src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/ag-before-after-men.jpg\" width=\"470\" height=\"200\" \/><\/p>\n<p><span class=\"small\"><strong>Guest Editorial by Sam Becker<\/strong><\/span><\/p>\n<p>My best friend from high school wants to be the next American Gladiator, and I can&rsquo;t blame him. He called me last month to mention he was applying, and asked if I would critique his video audition. Now Jon is not the most athletic person (as his <a href=\"http:\/\/www.youtube.com\/watch?v=0aBcNGsj58E\" target=\"_blank\" rel=\"noopener noreferrer\">video<\/a> serves to illustrate), but it&rsquo;s clear to me why he wants to take part in the reincarnation of one of television&rsquo;s most engaging, wholesome, unpretentious and downright zany entertainment-sports franchises of our time. And as we all know, with new leotards come new brands.<\/p><!--more--><p><a href=\"http:\/\/en.wikipedia.org\/wiki\/American_Gladiators\" target=\"_blank\" rel=\"noopener noreferrer\">American Gladiators<\/a> is a television program that ran from 1989 to 1996 and began at Universal Studios. Each episode featured amateur contestants who appeared nightly to battle the incumbent gladiators with names like Gemini, Nitro, Blaze, or anything else you might find written in your local GNC. See for yourself.<\/p>\n<p><object width=\"425\" height=\"355\"><param name=\"movie\" value=\"https:\/\/www.youtube.com\/v\/TLfACqLDeTM&#038;rel=1\"><\/param><param name=\"wmode\" value=\"transparent\"><\/param><embed src=\"https:\/\/www.youtube.com\/v\/TLfACqLDeTM&#038;rel=1\" type=\"application\/x-shockwave-flash\" wmode=\"transparent\" width=\"425\" height=\"355\"><\/embed><\/object><\/p>\n<p>The original show achieved its iconic status through a simple yet consistently over-the-top approach to televised combat. It featured catchy theme show music, a memorable emcee and spandex that stretched as far as the eye can see. <a href=\"http:\/\/www.nbc.com\/American_Gladiators\/\" target=\"_blank\" rel=\"noopener noreferrer\">NBC optioned the show last year and gave it a facelift and possibly calf implants<\/a>.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/ag-merchandise.jpg\" width=\"470\" height=\"176\" \/><\/p>\n<p>So, does the new show still have what it takes? Is it still relevant? Is it heavily affected by the writer&rsquo;s guild strike? Yes, yes and no! And what about the logo?<\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/ag-before-after.jpg\" \/><\/p>\n<p>In most ways these two marks are opposites: one is white; one is black. One triangle points up, the other down. One is rectilinear with bumper sticker type and contained within a severe holding shape reminiscent of a jockstrap. The other is a slick, whirling transformer made of shiny steel and breaks out all over the place. The triangle (which now rightly mimics an A) is merely suggested by three smaller triangles. The new logo is certainly more complex, but arguably more cohesive.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/ag-explode.jpg\" width=\"470\" height=\"264\" \/><\/p>\n<p>The original type certainly has a more impressive pedigree. It makes use of unmodified Univers extended complimented by ITC Machine. The new mark features customized versions of Eigenstate, which you can&rsquo;t even buy <a href=\"http:\/\/www.typophile.com\/node\/19513\" target=\"_blank\" rel=\"noopener noreferrer\">anymore<\/a>, and Xenotron, which is <a href=\"http:\/\/home.luna.nl\/~xino\/fonts\/xenotron\/index.html\" target=\"_blank\" rel=\"noopener noreferrer\">available<\/a> for free on the web and designed by a Dutch video game artist.<\/p>\n<p>The original is modern (as in modernism), the current is modern (as in contemporary). But more importantly, if they got in a fight, who would win?<\/p>\n<p>The redesign is stronger, smarter, sleeker and possibly taking human growth hormones. It is more proprietary with its hand-tooled type and custom shapes. It is also more versatile. Like most successful recent brands, this program is based more on its applications than any one single logo. The brand shape is used to frame everything from event titles and instant replays to corporate sponsors, which have also been metalicized! Everything serves to intensify the atmosphere. No weak sponsors allowed! Switch Subway with American Cancer Society. It just doesn&#8217;t work.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/ag-holding-shape.jpg\" width=\"470\" height=\"264\" \/><\/p>\n<p>So which logo does my friend like more? The old one, of course! To him, the new one is too dark,  techy and I quote, &ldquo;unamerican.&rdquo; In other words, it has lost much of its character.<\/p>\n<p>It is true, the new logo is not without its faults. It has too many fussy effects and superfluous details. The logo actually wears a cape, which you have to pause your TV in order to catch a glimpse of it. The type is difficult to read (especially on TV and the web). The words American Gladiators are held in a bizarre gemlike shape too proprietary for its own good.<\/p>\n<p>And yes, they deemphasized the &quot;American&quot; aspect by dispensing with most of the colors and shrinking the word down to the point of illegibility. And that&#8217;s fine with me. Who reads their TV anyway? <\/p>\n<p>Was there anything really American about the show to begin with?  I don&rsquo;t exactly swell up with pride, thinking of AG as one our great pastimes. I prefer the remaining connection, as dubious as it may be, to ancient Rome.<\/p>\n<p>Check out this tongue-in-cheek promo to see the brand in action.<\/p>\n<p><object width=\"425\" height=\"355\">\n    <param name=\"movie\" value=\"https:\/\/www.youtube.com\/v\/Py-cf0Ktj3k&#038;rel=1\">\n    <\/param>\n    <param name=\"wmode\" value=\"transparent\">\n    <\/param>\n    <embed src=\"https:\/\/www.youtube.com\/v\/Py-cf0Ktj3k&#038;rel=1\" type=\"application\/x-shockwave-flash\" wmode=\"transparent\" width=\"425\" height=\"355\"><\/embed>\n  <\/object>\n  <br \/>\nI&rsquo;m going to go out on a limb here and say the new mark strikes a good balance between past equities and new opportunities. It just feels right&hellip; as does the show. The logo fits nicely within the NBC ecosystem, and looks like a strong contender in a world of <em>Deal or No Deals<\/em> and <em>Apprentices<\/em>.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/ag-nbc_black_shows.jpg\" width=\"470\" height=\"220\" \/><\/p>\n<p>The old logo looks dated. And the new one probably will too. Only time will tell. But I would venture to say that each design was the right choice at the right time. If the new logo is  like Kanye West&rsquo;s <em>Stronger<\/em>, then the original is definitely the <em>Rocky<\/em> theme. Both get me off my ass when I want to go jogging.<\/p>\n<p><span class=\"small\">The logo and animations were most likely developed in house by the production studio Reveille, which produces, among other things, American Gladiators for NBC. At the time of this writing, both NBC and Reveille could not confirm specific ownership of the brand design. They also thought it strange that anyone would want to know who designs this stuff.<\/span><\/p>\n<p><span class=\"small\"><strong>Sam Becker has spent the past few years at <a href=\"http:\/\/www.cbx.com\" target=\"_blank\" rel=\"noopener noreferrer\">CBX<\/a> designing logos, packages with logos on them, and retail spaces. He is an avid programmer and new media designer&#8211;though he hates the term. His previous position was with the Crate and Barrel graphics department.<\/strong><\/span><\/p>","protected":false},"excerpt":{"rendered":"<img src=\"https:\/\/www.underconsideration.com\/brandnew\/images\/excerpt_empty.gif\" alt=\"Excerpt Empty\" \/>","protected":false},"author":5,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[9,66,26],"tags":[],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/579"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=579"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/579\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=579"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=579"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=579"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}