{"id":595,"date":"2008-03-12T12:42:34","date_gmt":"2008-03-12T17:42:34","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/the_camels_new_clothes.php"},"modified":"2008-03-12T12:42:34","modified_gmt":"2008-03-12T17:42:34","slug":"the_camels_new_clothes","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/the_camels_new_clothes.php","title":{"rendered":"The Camel&apos;s New Clothes"},"content":{"rendered":"<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/camel_pack.jpg\" alt=\"Camel Pack, Before and After\" \/><\/p>\n<p>A large percentage of mass consumer packaging has embraced the More is More approach when it comes to packaging design: More starbursts, more swooshes, more information, more graphics, more, more, and more in hopes of getting your attention. Besides fragrances and perfumes, one of the few categories that has amazingly maintained a level of graphic sophistication and restraint is cigarette packaging. From the underrated simplicity of Marlboro, to the indefatigable Lucky Strike, to the sophisticated Gauloises, cigarette packs are remarkably simple &mdash; a feat all the more impressive given that most cigarette packs are only seen through heavy armorage behind counters, and next to Tylenol and Alka-Seltzer mini packs. Some cigarette brands haven&#8217;t even changed their design in ages, including Camel, whose design has remained mostly consistent since its introduction in 1913. Until this past month when <a href=\"http:\/\/www.iht.com\/articles\/ap\/2008\/02\/21\/business\/NA-FIN-COM-US-RJ-Reynolds-Promotion.php\" target=\"_blank\" rel=\"noopener noreferrer\">the R.J. Reynolds Tobacco company updated its Camel packaging line<\/a> as well as updated its blend (here is an article about Camel not running print ads anymore, <a href=\"http:\/\/www.nytimes.com\/2007\/11\/29\/business\/media\/29adco.html?adxnnl=1&#038;adxnnlx=1205336567-SdkYzbXiqSyG5QLX1vWNZw\" target=\"_blank\" rel=\"noopener noreferrer\">where you can see a teaser for the new pack and blend<\/a>) &mdash; I am not a smoker, so I can&#8217;t vouch for the quality of the new formula.<\/p><!--more--><p>The new design maintains the most iconic element of the pack: The camel stoically walking through the desert with an oasis and pyramids in the background. These elements come from Camel&#8217;s use of Turkish tobacco, so somehow that translated into a camel and Egyptian pyramids &mdash; if I am mistaken and these kind of pyramids exist in Turkey do let me know and I will admonish my own unworldly knowledge. <a href=\"http:\/\/www.trivia-library.com\/a\/history-of-product-names-and-trademarks-camel-cigarettes.htm\" target=\"_blank\" rel=\"noopener noreferrer\">This source<\/a> may only be as reliable as the internet allows, but it explains where the actual image of the camel comes from. &#8220;When &#8216;Old Joe,&#8217; a camel traveling with the Barnum and Bailey circus, came to town, [Richard Joshua Reynolds (as in R.J. Reynolds] dispatched an employee to get a picture of the dromedary for an advertising campaign.&#8221; True or not, Camel&#8217;s camel is instantly recognizable and it is interesting to see it evolve almost 95 years later within the context of a twenty-first century package redesign. The camel itself looks untouched, but the pyramids and oasis are slightly bigger in the new design, and the desert floor looks to be a little bit more shiny &mdash; you can thank Apple&#8217;s iTunes and the OSX Dock for that. The surrounding design and visual elements is what really takes Camel into new, interesting territory that I think makes for a very handsome line of packaging that nicely exploits a soft, layered feel.<\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/camel_pack_new_line.jpg\" alt=\"Camel Pack, Full Line\" \/><\/p>\n<p><span class=\"small\"><strong>Full line of new Camel packs. Taken from <a href=\"http:\/\/www.camelcollector.com\/catalogo.asp?pais=USA-Regulars\" target=\"_blank\" rel=\"noopener noreferrer\">camelcollector.com<\/a>.<\/strong><\/span><\/p>\n<p>The framing circle helps focus attention on the camel, while also allowing the rest of the information to be quickly and easily graspable and the decorative elements that ripple outward into the shelves are a welcome addition that provide the exotic feeling that Camel stands for, and it does so without being distracting. The typography also experienced a nice improvement, starting with the tightening of the Camel wordmark that takes emphasis away from the heavy stroke of the previous version, and the dark color adds a touch of elegance. The most interesting part is the vertical and horizontal type treatments of the information, giving it a fresh broadside feel that ties back (maybe) to the Barnum and Baily lore mentioned above. The color palette works well in separating the different options. The Wides versions, however, do not seem as well resolved: The camel steps out from the desert and onto the pack, the flourishes on the corners are too evident and the supporting typography starts to feel more like automotive oil packaging &mdash; it succeeds in separating Wides from regulars, but perhaps this is not a compliment.<\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/camel_pack_flat_old_sm.jpg\" alt=\"Camel Pack Old, Flat\" \/><\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/camel_pack_flat_new_sm.jpg\" alt=\"Camel Pack New, Flat\" \/><\/p>\n<p><span class=\"small\"><strong>One of our readers, <a href=\"http:\/\/www.furtherstudios.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Lester Nelson<\/a>, did us the awesome favor of flattening two packs of Camels and scanning them for us. You can see bigger versions on his Flickr page, <a href=\"http:\/\/www.flickr.com\/photos\/lnelson\/2325820336\/sizes\/o\/\" target=\"_blank\" rel=\"noopener noreferrer\">here<\/a> and <a href=\"http:\/\/www.flickr.com\/photos\/lnelson\/2324999985\/sizes\/o\/\" target=\"_blank\" rel=\"noopener noreferrer\">here<\/a>.<\/strong><\/span><\/p>\n<p>While the new packs for Camel actually opt for the More is More approach, they managed to do it in an elegant fashion that creates a unique design for the brand. And for a brand operating in one of the harshest industries, this design leap is pretty remarkable. Kids: Don&#8217;t smoke.<\/p>","protected":false},"excerpt":{"rendered":"<img src=\"https:\/\/www.underconsideration.com\/brandnew\/images\/excerpt_empty.gif\" alt=\"Excerpt Empty\" \/>","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[9,51,26],"tags":[],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/595"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=595"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/595\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=595"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=595"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=595"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}