{"id":651,"date":"2008-06-18T06:10:00","date_gmt":"2008-06-18T11:10:00","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/optima_wont_be_running_for_pre.php"},"modified":"2008-06-18T06:10:00","modified_gmt":"2008-06-18T11:10:00","slug":"optima_wont_be_running_for_pre","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/optima_wont_be_running_for_pre.php","title":{"rendered":"Optima Won&apos;t be Running for President"},"content":{"rendered":"<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/mccain_logo.gif\" alt=\"McCain Logo, Before and After\" \/><\/p>\n<p><strong><span class=\"red\">Update, 06.18.2008:<\/span> It has been brought to my attention that The Spalding Group&#8217;s McCainStore.com &#8220;is not authorized by any candidate or candidate&#8217;s committee,&#8221; and that the merchandise sold is representative of their own version of Sen. John McCain&#8217;s campaign logo (and not the official one). I had received an e-mail announcing the new store the day after John McCain&#8217;s interview on ABC, and I made the assumption (in part based on a visit to the company <a href=\"http:\/\/www.spalding-group.com\/about.html\" target=\"_blank\" rel=\"noopener noreferrer\">web site<\/a>) that the campaign had indeed updated its brand. I apologize for any confusion that this may have caused. <br \/>&mdash; Ryan Hembree<\/strong><\/p>\n<p>Now that the dust has settled on the Democratic Presidential Primaries, the general election for the office of President of the United States has finally begun. Senator Barack Obama, with his populist message of hope and change for America, will challenge Republican senator <a href=\"http:\/\/www.johnmccain.com\" target=\"_blank\" rel=\"noopener noreferrer\">John McCain<\/a> for America&#8217;s vote. Between now and November, signs, banners and billboards will proliferate across the land, from shop windows to front lawns, pitting neighbors, families and friends against one another as politics take center stage.<\/p><!--more--><p>In terms of branding, Obama has a clear advantage over McCain. His iconic &#8220;sunrise within an O&#8221; mark is symbolic of hope and the dawn of a new day in politics. Until recently, McCain&#8217;s brand, while more conservative in execution, was very appropriate to the candidate&#8217;s background, drawing inspiration from a naval officer&#8217;s uniform. McCain himself admitted during a recent interview with Charlie Gibson on ABC&#8217;s <em>World News Tonight<\/em> that he has a &#8220;brand issue&#8221; to contend with and, because of it, is clearly the underdog. <\/p>\n<p>In response to this admission, the McCain campaign has launched a new identity, one that we can assume is meant to help improve his image with younger voters and Independents, two demographics that will make a difference in this year&#8217;s election. One of the biggest issues each candidate is campaigning for or against is the war in Iraq, which has become quite unpopular among constituents. It seems that McCain&#8217;s new brand is meant to downplay the aspects of his military background, as well as the idea that he would continue the &#8220;war mongering&#8221; policies of President Bush.<\/p>\n<p>Motivation for the brand revision aside, it is interesting to note the differences between the graphic qualities of the old and new brand that make it, in my opinion, more generic and much less effective for the candidate. The new McCain identity was developed by <a href=\"http:\/\/www.spalding-group.com\" target=\"_blank\" rel=\"noopener noreferrer\">The Spalding Group<\/a>, a firm that has designed campaign identities for the past six Republican presidential candidates. As such, it falls back on the conventions of  &#8220;politics as usual&#8221; by incorporating a single, flattened star with drop shadow as the brand&#8217;s logomark (not a very unique solution). This star appears in varying sizes depending on application, sometimes overshadowing the candidate&#8217;s name, and contrasts with the old, dimensional star that looked as if it came right off of a general&#8217;s uniform. <\/p>\n<p>Eurostile is used as the logotype (along with a fake small cap for the &#8220;Mc&#8221;), apparently to make it look more progressive or innovative &mdash; <a href=\"http:\/\/campaignstops.blogs.nytimes.com\/2008\/04\/21\/mccains-optimum-look\/\" target=\"_blank\" rel=\"noopener noreferrer\">and, as designers know, Optima is not a popular choice<\/a>. And while the white and yellow on a color background color scheme has been maintained, it is not used in all applications, falling victim to the patriotic red, white, and blue color scheme preferred by every politician running for elected office. <\/p>\n<p>Will this new, &#8220;improved&#8221; campaign identity for John McCain help him connect with the younger, more sophisticated voters that he needs to win the White House this November? Or will this new brand that downplays his military background and conservatism be seen as an attempt to manipulate voters? Only time will tell.<\/p>","protected":false},"excerpt":{"rendered":"<img src=\"https:\/\/www.underconsideration.com\/brandnew\/images\/excerpt_empty.gif\" alt=\"Excerpt Empty\" \/>","protected":false},"author":17,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[9,63,26],"tags":[],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/651"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/17"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=651"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/651\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=651"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=651"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=651"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}