{"id":660,"date":"2008-07-02T22:13:05","date_gmt":"2008-07-03T03:13:05","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/its_a_green_world_after_all.php"},"modified":"2008-07-02T22:13:05","modified_gmt":"2008-07-03T03:13:05","slug":"its_a_green_world_after_all","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/its_a_green_world_after_all.php","title":{"rendered":"It&apos;s a Green World After All"},"content":{"rendered":"<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/planet_green_logo.gif\" alt=\"Planet Green Logo, New\" \/><\/p>\n<p>On June 4th, Discovery Communications launched <a href=\"http:\/\/planetgreen.discovery.com\" target=\"_blank\" rel=\"noopener noreferrer\">Planet Green<\/a>, the &#8220;first and only 24-hour eco-lifestyle television network,&#8221; and with original programming on TV and a robust online presence Planet Green demonstrates that there is more than just gloomy, end-of-the-world content surrounding the environment. The new identity, designed by New York-based <a href=\"http:\/\/www.notclosed.com\" target=\"_blank\" rel=\"noopener noreferrer\">Open<\/a>, is a green circle paired with a heavy-duty (and beautiful) sans serif designed by <a href=\"http:\/\/www.vllg.com\" target=\"_blank\" rel=\"noopener noreferrer\">Chester Jenkins of Village<\/a>. The logo, to some, may seem like an over-simplified or easy solution, but with a name like Planet Green, I doubt there was a more perfect &mdash; and most importantly, ad hoc &mdash; solution. And unlike <a href=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/cat_media.php\">the recent circle logo from Euronews<\/a> this one doesn&#8217;t feel pretentious nor operate on pure quirk &mdash; the quirk actually comes from things like their <a href=\"http:\/\/www.planetgreenpress.com\" target=\"_blank\" rel=\"noopener noreferrer\">green or greener press web site<\/a> and <a href=\"http:\/\/www.thornbergandforester.com\/projects\/motion\/planetgreennetworklaunch\/\" target=\"_blank\" rel=\"noopener noreferrer\">the on-air graphics by Thornberg &amp; Forester<\/a>. How does such a simple and effective logo come to be in the twenty-first century? I asked Open&#8217;s proprietor and recent winner of the Cooper-Hewitt&#8217;s National Design Award for Communication Design, Scott Stowell, a few questions. Oh, and before anyone cries foul, this logo was designed <em>before<\/em> the <a href=\"http:\/\/www.wecansolveit.org\/\" target=\"_blank\" rel=\"noopener noreferrer\">We<\/a> logo but both happened to be released at similar times.<\/p><!--more--><p><span class=\"red\"><strong>Armin Vit:<\/strong> Without sacrificing any secrets from this part of the process, how did you bring in the project to Open?<\/span><\/p>\n<p><strong>Scott Stowell:<\/strong> Last year, we were hired (along with some other design and advertising firms) to develop some ideas for Planet Green. We showed lots of work on the identity, on-air design, and advertising, most of which didn&#8217;t get used. But we did a lot of thinking about the point of view and tone of the channel, some of which I think comes through in the logo.<\/p>\n<p><span class=\"red\"><strong>AV:<\/strong> How long was the project, from briefing to launch? And what were some of the key benchmarks that you had to meet throughout (logo, on-air graphics, etc.)?<\/span><\/p>\n<p><strong>SS:<\/strong> The whole project took about six months. For the first couple of months we developed and presented concepts, and the rest of the time was filled with issues related to the logo: color, typography, guidelines, etc. We also produced a package of animated elements for Planet Green to use in ad-sales presentations before the launch.<\/p>\n<p><span class=\"red\"><strong>AV:<\/strong> Could you also describe the type of decision-making process? Who was involved in it? Was there focus groups or other type of testing for the work?<\/span><\/p>\n<p><strong>SS:<\/strong> Open was connected to Planet Green through a consultant with whom we&#8217;ve worked on many projects for television. She brought us in to work with a marketing team that had been put together for the launch of the network. Ultimately, though, we presented our ideas to Eileen O&#8217;Neill, the president of the channel. We weren&#8217;t involved in any testing at all.<\/p>\n<p><span class=\"red\"><strong>AV:<\/strong> What was the thinking that led to the final logo? Was there any apprehension towards the simplicity of a circle?<\/span><\/p>\n<p><strong>SS:<\/strong> We came up with that logo idea very quickly after we first heard from Planet Green. Serifcan Ozcan, one of the designers here at Open, first thought of the green dot right away. We spent a lot of time coming up with reasons why they had to pick it, but surprisingly they went for it without much hesitation. Once they did, we had a lot more work to do (see below).<\/p>\n<p><object width=\"425\" height=\"344\"><param name=\"movie\" value=\"https:\/\/www.youtube.com\/v\/5KwlHMWhK4c&#038;hl=en&#038;fs=1\"><\/param><param name=\"allowFullScreen\" value=\"true\"><\/param><embed src=\"https:\/\/www.youtube.com\/v\/5KwlHMWhK4c&#038;hl=en&#038;fs=1\" type=\"application\/x-shockwave-flash\" allowfullscreen=\"true\" width=\"425\" height=\"344\"><\/embed><\/object><\/p>\n<p><span class=\"small\"><strong>Tom Green gives his opinion of the logo.<\/strong><\/span><\/p>\n<p><span class=\"red\"><strong>AV:<\/strong> Talk to us about some of the geekier details, where the following questions are all followed by &#8220;why?&#8221;: What typeface did you choose? What PMS number is the green? How did you arrive at the final lock-up with the circle on the right? (Yes, geeky).<\/span><\/p>\n<p><strong>SS:<\/strong>\n&bull; Many, many options for the type were considered, including the idea of no type (I hope that will still happen some day) and the idea that it could be any typeface at all. In the end we realized that such a surprising logo needed solid, consistent typography.<\/p>\n<p>&bull; We were looking at <a href=\"http:\/\/www.vllg.com\/Thirstype\/ApexSans\/mudTyper+Weights\/\" target=\"_blank\" rel=\"noopener noreferrer\">Chester Jenkins&#8217; Apex family<\/a>, and he suggested we look at a new version that was still in development. That one was perfect: clean, fresh, friendly, and really efficient, thanks to its large x-height. Planet Green licensed it and renamed it Planet Green (for now).<\/p>\n<p>&bull; The green is PMS 376, but it started as a CMYK tint: c50 y100. For reasons of ecology and efficiency, we wanted to make sure the logo could be printed in as few colors as possible, and reproduce in pretty much any context. Plus we like the limited\/flexible palette of four-color process.<\/p>\n<p>&bull; As for the type lock-up, that grew out of the need for the logo to exist as a bug in the lower right corner of the screen &mdash; as well as a desire to have the lockup to be a solid unit. There are two different main lock-ups &mdash; the type can also sit on top &mdash; and lots of ancillary ones for HD, on demand, etc.<\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/planet_green_logo_colors.gif\" alt=\"Planet Green Logo Lock-ups\" \/><\/p>\n<p><span class=\"small\"><strong>Sample lock-ups and color applications<\/strong><\/span><\/p>\n<p><span class=\"red\"><strong>AV:<\/strong> In the past you&#8217;ve designed the identities of Bravo and the now-defunct  Trio. What did you learn from those projects that helped you this time around?<\/span><\/p>\n<p><strong>SS:<\/strong> Trio, Bravo, and Planet Green all had different parameters. On Trio we were given a new logo (by <a href=\"http:\/\/www.numberseventeen.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">No. 17<\/a>) and had to build a world around it. For Bravo, we got to create the logo and its environment. And for Planet Green, we just made the logo and set it free. Then <a href=\"http:\/\/www.thornbergandforester.com\/projects\/motion\/planetgreennetworklaunch\/\" target=\"_blank\" rel=\"noopener noreferrer\">Thornberg &amp; Forester made a fun on-air package<\/a> that works really well with the logo.<\/p>\n<p>It was interesting this time around to put some of the things we figured out from working with a logo (made by someone else or by us) into action. We made sure that some things were simple and consistent, but that there would be a lot of opportunities for motion that was appropriate and surprising. Thornberg &amp; Forester did a great job taking advantage of that.<\/p>\n<p><span class=\"red\"><strong>AV:<\/strong> What were the biggest challenges about designing this identity, given that &#8220;green&#8221; is something that everyone&#8217;s doing with dozens of &#8220;green&#8221; initiatives popping up everywhere with new identities?<\/span><\/p>\n<p><strong>SS:<\/strong> Planet Green&#8217;s mission is to make green living as mainstream as possible. The logo had to work anywhere and everywhere. And we had to get through not just the clutter of tv, but all the other &#8220;green&#8221; messages out there too. This was a perfect opportunity to make the biggest statement we could with the simplest possible solution.<\/p>\n<p><span class=\"red\"><strong>AV:<\/strong> Thanks for your time Scott.<\/p>","protected":false},"excerpt":{"rendered":"<img src=\"https:\/\/www.underconsideration.com\/brandnew\/images\/excerpt_empty.gif\" alt=\"Excerpt Empty\" \/>","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[66,12,26],"tags":[],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/660"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=660"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/660\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=660"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=660"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=660"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}