{"id":661,"date":"2008-07-07T08:42:00","date_gmt":"2008-07-07T13:42:00","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/a_glass_half_full.php"},"modified":"2008-07-07T08:42:00","modified_gmt":"2008-07-07T13:42:00","slug":"a_glass_half_full","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/a_glass_half_full.php","title":{"rendered":"A Glass Half Full"},"content":{"rendered":"<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/millercoors_logo.gif\" alt=\"MillerCoors Logo, New\" \/><\/p>\n<p>On June 30th, <a href=\"http:\/\/www.sabmiller.com\" target=\"_blank\" rel=\"noopener noreferrer\">SABMiller plc<\/a> and <a href=\"http:\/\/www.molsoncoors.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Molson Coors<\/a> announced their joint venture <a href=\"http:\/\/www.millercoors.com\" target=\"_blank\" rel=\"noopener noreferrer\">Miller Coors<\/a> to consolidate resources and compete with greater combined force in the U.S. market. From their first press release Chief Executive Leo Kiely states &ldquo;MillerCoors will be entrepreneurial, with the ability to operate with speed and agility in the marketplace, backed by the powerful combined resources of two exceptionally successful companies.  We will drive profitable growth and bring new energy to the U.S. beer industry. Our focus now is to deliver on the $500 million in identified annualized cost synergies by improving sourcing across our eight major breweries, building a streamlined organization and leveraging the scale of the new company. Our talented people are experienced and passionate about this business and &mdash; importantly &mdash; are determined to win.&rdquo; For the face of this new company, <a href=\"http:\/\/pentagram.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Pentagram&rsquo;s<\/a> partner Michael Bierut, and designers Katie Repine and Ben King developed a logo based upon the view of a glass of beer from above.<\/p><!--more--><p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/millercoors_corporate_logos.gif\" alt=\"Coors and Miller Corporate Logos\" \/><\/p>\n<p><span class=\"small\"><strong>Corporate logos.<\/strong><\/span><\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/millercoors_consumer_logos.gif\" alt=\"Coors and Miller Consumer Logos\" \/><\/p>\n<p><span class=\"small\"><strong>Consumer logos.<\/strong><\/span><\/p>\n<p>It&rsquo;s important to note that this is not a product logo planned for the consumer marketplace, but for corporate communication and as a parent brand for the U.S. representation of beer brands such as Coors, Miller Genuine Draft, Molson Canadian, Foster&rsquo;s, and, a personal italian favorite, Peroni. I have to admit, I didn&rsquo;t see the glass of beer immediately and was briefly stumped until that ah-ha!-arrow-in-the-FedEx-logo moment (I&rsquo;m not comparing the two, they have different contexts and goals and time spent for that arrow to become an almost mythic example). Of course, the logo animation developed by <a href=\"http:\/\/www.favoritecolor.tv\/\" target=\"_blank\" rel=\"noopener noreferrer\">Favorite Color<\/a> and seen <a href=\"http:\/\/blog.pentagram.com\/2008\/07\/new-work-millercoors.php\" target=\"_blank\" rel=\"noopener noreferrer\">here on Pentagram&rsquo;s blog<\/a> best illustrates this representation, and once seen makes the visualization unforgettable. In addition to the half-full pint of libation is the name &ldquo;MillerCoors&rdquo; locked up in a respectable, grey sans serif with tight kerning (perhaps too tight in the example of the quasi-ligated &ldquo;rCo&rdquo; which creates an overly compressed and noisy typographic quirk), creating a rather neutral visual palette as a strong foundation for the diverse brands they will sell. <br \/>\n <br \/>\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/millercoors_photo.jpg\" alt=\"c\" \/><\/p>\n<p><span class=\"small\"><strong>Tom Long, President of MillerCoors, enjoys a cold one. <a href=\"http:\/\/www.jsonline.com\/story\/index.aspx?id=767575\" target=\" target=\"_blank\">Photo Bloomgberg News<\/a><\/strong><\/span><\/p>\n<p>This logo is undoubtedly smart and unique in its approach to representing beer and its consumption, and is miles beyond most of its competing corporations&rsquo; visual brands. One of the most impressive attributes of the branding is the color palette that emerges from generating a flattened glass of suds &mdash; an amber and grey combination with amazing screen accuracy and own-ability. However, there are some open questions about how this logo will hold up in all the familiar corporate contexts required. While we do live in an increasingly digital world, as a corporate brand that will work hard between the product brands and in B2B environments, this is a logo that will likely need to live at small and large sizes, in one-color and four-color environments and on everything from newsprint and embroidered shirts to bottle labels &mdash; a tough line-up for a graphic story that relies on the subtleties of a multi-color environment. I look forward to experiencing this logo out there in the world and seeing how Michael and company&rsquo;s work will answer all these contexts of use.  <\/p>\n<p>I asked Michael about the process involved, the origins of the idea for this visualization of a glass of beer, about the typography used and how they approached the reproduction constraints including the digital ones. Herein are some of his insights:<\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/images\/divider_hor_single.gif\" alt=\"---\" \/>\n <br \/>\n<span class=\"red\"><strong>Michael Bierut:<\/strong><\/span> We worked directly with the company&#8217;s marketing leadership in developing a wide range of possibilities for the identity, and then presented what we agreed were the most promising directions to CEO Leo Kiley and President Tom Long. The most important thing about the identity is that it represents a business operation, not a brewing operation. You won&#8217;t be able to go into a bar and buy MillerCoors beer. The mark won&#8217;t replace any of the brands, won&#8217;t appear on any bottles, and will be largely invisible to the beer consuming public. It will be seen by the employees, business partners, investors, and other business-to-business audiences.<br \/>\n <br \/>\nSo the trick was to come up with a mark that would seem to be all about beer while looking distinct from the iconography of the Miller and Coors brands. This pretty much sabotaged my first idea, which was to somehow merge the two iconic script logos. I was sure it could be done, but it turns out it was impossible to make it work visually, even if it was a good idea. Plus, our clients really wanted to signal that this wasn&#8217;t just about consolidating the heritage of the two families, but about creating something new.<br \/>\n <br \/>\nThe idea of the beer glass came from a couple of remarks about the new company being &#8220;focused on beer.&#8221; The move from focus to lens to beer glass was a natural transition that happened in the series of iterations.<br \/>\n <br \/>\nBecause of the limited, and relatively controllable, number of applications, we were confident that the relatively complex color rendition would work in most cases. There is also a flat, one color, black and white version which is very abstract but which a lot of people like a lot.<\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/images\/divider_hor_single.gif\" alt=\"---\" \/>\n <br \/>\nMillerCoors&rsquo; June 30th press release can be found <a href=\"http:\/\/www.millercoors.com\/news\/press-releases\/release\/millercoors-joint-venture-launch.aspx\" target=\"_blank\" rel=\"noopener noreferrer\">on their site<\/a> as well as a brief <a href=\"http:\/\/www.millercoors.com\/news\/facts-and-resources\/miller-coors-brands.aspx\" target=\"_blank\" rel=\"noopener noreferrer\">historical timeline<\/a> and their complete <a href=\"http:\/\/www.millercoors.com\/who-we-are\/miller-coors-history\/timeline\/PanelId\/0.aspx\" target=\"_blank\" rel=\"noopener noreferrer\">list of beers on tap<\/a>.<\/p>","protected":false},"excerpt":{"rendered":"<img src=\"https:\/\/www.underconsideration.com\/brandnew\/images\/excerpt_empty.gif\" alt=\"Excerpt Empty\" \/>","protected":false},"author":4,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[51,12,26],"tags":[],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/661"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=661"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/661\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=661"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=661"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=661"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}