{"id":662,"date":"2008-07-08T04:55:21","date_gmt":"2008-07-08T09:55:21","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/episode_vii_return_of_the_doub.php"},"modified":"2008-07-08T04:55:21","modified_gmt":"2008-07-08T09:55:21","slug":"episode_vii_return_of_the_doub","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/episode_vii_return_of_the_doub.php","title":{"rendered":"Episode VII: Return of the Double-Ds"},"content":{"rendered":"<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/dolby_logo.gif\" alt=\"Dolby Logo, Before and After\" \/><\/p>\n<p><span class=\"small\"><strong><span class=\"red\">Update July 8, 2008:<\/span> Roberto Landazuri, Corporate Archivist for Dolby was kind enough to contact us and provide some corrections and further insights into the background information we received about this logo from Turner Duckworth. Landazuri noted that the original logo was created in 1967 or 1968 by the graphic design partner of a two-man advertising shop in Surrey. The designer is quoted as saying &#8220;[Dr. Dolby] explained in simple terms that sounds were directed down a funnel and emerged from an inverted funnel as a cleaner, clearer sound.  It was then that the initial idea of the Double &#8216;D&#8217; came to me, thus making two double funnels. I returned to my studio and finally submitted three designs on my original idea. He immediately chose my first idea, saying &#8216;That says it all.'&#8221; According to Ray Dolby, this is the specific conceptual underpinning for the original logo: the complementary nature of the Dolby noise reduction process. We were also informed by Landazuri that Ray mentioned that there is, coincidentally, a secondary significance to the double Ds: The two Dolby brothers, Ray and Dale, who cofounded the company in 1965.<\/strong><\/span><\/p>\n<p>Having grown up around media that included the presence of the <a href=\"http:\/\/www.dolby.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Dolby logo<\/a> &mdash; as I&#8217;m sure many of us have &mdash; I now recall that my impression of the double-d logo lead me to believe they had something to do with general tape and reel-to-reel technology, given the cassette-like look of the logo. My impression was likely not rooted in corporate intention as the original logo was designed by the founder, Ray Dolby, and had no specific conceptual underpinning. Either way the double-d has become a rather ubiquitous fixture in modern media environments, having successfully made the recent transition into the digital world. While we continue to see the presence of &#8220;Dolby Digital&#8221; in and around the movies, their brand presence with the stroked rectangle around &#8220;DOLBY&#8221; and uncomfortably justified &#8220;DIGITAL&#8221; has seemed a bit stale for a company that is trying to continue to define high-quality and audio surround sound. Enter <a href=\"http:\/\/www.turnerduckworth.com\" target=\"_blank\" rel=\"noopener noreferrer\">Turner Duckworth<\/a>, with their experienced touch and attention to brand and collateral details we have a refined update to the logo and respective visual identity system that retains the brand equity Dolby has established.<\/p><!--more--><p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/dolby_starwars.jpg\" alt=\"Dolby Logo, Way Way Way Before\" \/><\/p>\n<p><span class=\"small\"><strong>In a galaxy far, far away this is how the logo looked in its application.<\/strong><\/span><\/p>\n<p>The double-ds have been merged together, removing the visual separation and additional noise that was present in a logo that has to appear at extremely small sizes. This merger allows more lateral space for the Ds to have a wider form that marries well with the new typography. In addition, the &#8220;DOLBY&#8221; wordmark has been liberated from its bounding rectangle, employing a lighter-weight typeface for better legibility. The letterforms are boxier, with more squared-off and larger open counters, which lends itself to a more current &#8220;tech&#8221; feeling (whether the face is as timeless as the previous typography remains to be seen&hellip; 50 years is a good run, and what&#8217;s &#8220;techy&#8221; today is easily dated tomorrow!). The only detail of &#8220;DOLBY&#8221; that rubs me noisily is the separation of the &#8220;B&#8221; crossbar which, while certainly quirky and ownable, becomes more of a distraction overall and hurts the otherwise supreme legibility Turner Duckworth has crafted at small sizes. <\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/dolby_logo_family.gif\" alt=\"Dolby Logo, Before and After\" \/><\/p>\n<p>The other consideration for this logo is its extended family of lock-ups comprised of stacked product and service divisions. It is certainly a tough challenge to set up a system for these names and descriptors which often find themselves in the company of others, and while the typeface reads well at these small sizes, the structural rule\/s in place seem more of a visual crutch than a visual element that is helping the overall hierarchy or brand. Overall, while there may be some details that don&#8217;t seem quite ironed out yet, I think this rebranding shows impressive restraint and intelligent handling of the existing brand equity.<\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/dolby_logo_detail.gif\" alt=\"Dolby Logo, Detail\" \/><\/p>\n<p><span class=\"small\"><strong>If you are curious, a closer look at the typography.<\/strong><\/span><\/p>","protected":false},"excerpt":{"rendered":"<img src=\"https:\/\/www.underconsideration.com\/brandnew\/images\/excerpt_empty.gif\" alt=\"Excerpt Empty\" \/>","protected":false},"author":4,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[9,26,88],"tags":[],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/662"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=662"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/662\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=662"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=662"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=662"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}