{"id":697,"date":"2008-09-15T09:29:43","date_gmt":"2008-09-15T14:29:43","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/metallica_the_brand.php"},"modified":"2008-09-15T09:29:43","modified_gmt":"2008-09-15T14:29:43","slug":"metallica_the_brand","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/metallica_the_brand.php","title":{"rendered":"Metallica, the Brand"},"content":{"rendered":"<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/metallica_logo.gif\" alt=\"Metallica Logo, Before and After\" \/><\/p>\n<p>It may or may not come as a surprise, but I&#8217;m a die hard Metallica fan. Well, was. At the beginning of my teenage years with the release of the <em>Black Album<\/em> in 1991 I was immediately hooked and bought every album that had come before it &mdash; <em>Kill &#8217;em all<\/em> became a thrashy favorite. When they played in Mexico in 1993, me and my friends had seats in the first ten rows and through some Heavy Metal miracle I was handed a pass to be transferred to the &#8220;<a href=\"http:\/\/rocknheavy.free.fr\/metallica\/photos\/metallica92live.jpg\" target=\"_blank\" rel=\"noopener noreferrer\">snakepit<\/a>,&#8221; a hole in the middle of the stage where even crazier head-banging occurred &mdash; the amazing <a href=\"http:\/\/en.wikipedia.org\/wiki\/Live_Shit:_Binge_&#038;_Purge\" target=\"_blank\" rel=\"noopener noreferrer\"><em>Live Shit: Binge &amp; Purge<\/em><\/a> set came from the five shows they played there. Then it took five years for the next release, <em>Load<\/em>, which didn&#8217;t quite catch my attention and its sequel <em>ReLoad<\/em> felt even more out of touch from Metallica&#8217;s true sound &mdash; it didn&#8217;t help that, by now, the cast had all gotten haircuts that made them look like they should be <a href=\"http:\/\/messageboards.ivillage.com\/n\/mb\/message.asp?webtag=iv-mcentertain&#038;msg=645.1&#038;ctx=0\" target=\"_blank\" rel=\"noopener noreferrer\">playing for Jethro Tull<\/a>. After <em>ReLoad<\/em> I lost track, in part because Metallica did not seem to fit in my post-&#8217;99 life (work, girlfriend, no more mullet) but to this day, when I need to haul-ass on a production task I <em>will<\/em> crank the vintage Metallica, and it does still sound good. Clearly, all this has nothing to do with the logo &mdash; well, I did draw it extensively on my school notebooks and ripped jeans &mdash; but it felt rather therapeutic to get it out there.<\/p><!--more--><p>Back in July, Brand New reader Chris Dunshee alerted me to the revised logo on Metallica&#8217;s latest album <em>Death Magnetic<\/em>, their first in five years. I originally thought that, sure, it was a funny change for a very niche subject, but at the time decided to let it go. Last night, though, the story got juicier.<\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/metallica_dm_turnerduckworth.jpg\" alt=\"Metallica Death Magnetic Packaging by Turner Duckworth\" \/><\/p>\n<p><span class=\"small\"><strong>Metallica Death Magnetic Packaging by Turner Duckworth. For the full press release you can go to their site, and click on &#8220;news.&#8221;<\/strong><\/span><\/p>\n<p>It turns out that design firm <a href=\"http:\/\/www.turnerduckworth.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Turner Duckworth<\/a> &mdash; who did the <a href=\"http:\/\/www.designboom.com\/weblog\/cat\/13\/view\/3176\/coca-cola-brand-re-design-by-turner-duckworth-wins-at-cannes.html\" target=\"_blank\" rel=\"noopener noreferrer\">earth-shatteringly-simple, Cannes-award-winning Coca-Cola packaging<\/a> as well the identities for Palm, Amazon and Dolby &mdash; designed the new logo, album and supporting identity materials for the release of Metallica&#8217;s new album. <\/p>\n<blockquote>With the music industry in a state of rapid change, the band were looking for new ideas. &#8220;This time, we wanted to work with professionals who understand iconography,&#8221; said James Hetfield, Metallica&#8217;s lead singer. Lars Ulrich, the band&#8217;s drummer and frequent spokesperson added, &#8220;We wanted somebody who commanded respect in branding but were not jaded by the music business. Someone who would bring fresh ideas. Enter Turner Duckworth. Enter happy days.&#8221;<br \/><br \/>[&hellip;]<br \/><br \/>Turner Duckworth re-worked the classic Metallica logo, created a signature typographic style and designed key promotional materials including a flag, a coffin shaped special edition and a vinyl boxed set. A design kit including logos, imagery and graphics was distributed to the band&#8217;s record companies to produce a vast array of promotional materials around the world.<\/blockquote>\n<p>It&#8217;s very interesting that Metallica turned to TD: Musicians have long had symbiotic relationships with designers (Hipgnosis\/Pink Floyd, Tibor Kalman\/Talking Heads, Jamie Reid\/Sex Pistols, etc.) but it&#8217;s rarely been a clear-cut case of a brand initiative executed by a specialized design firm &mdash; especially one that, on the surface, is as Heavy Metal as Winnie the Pooh. This is not to knock TD but to emphasize the outstanding work that they did in applying design and branding principles for their client. <\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/metallica_old_logos.gif\" alt=\"Metallica Old Logos\" \/><\/p>\n<p><span class=\"small\"><strong>Metallica logos 1981 &ndash; 1995, 1995 &ndash; 2003 and 2003 &ndash; 2008.<\/strong><\/span><\/p>\n<p>We can talk about the logo, which is a cleaner iteration of the original Metallica logo created by lead singer James Hetfield &mdash; and, actually, <a href=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/metallica_logo_actual.php\" onclick=\"window.open('https:\/\/www.underconsideration.com\/brandnew\/archives\/metallica_logo_actual.php','popup','width=470,height=200,scrollbars=no,resizable=no,toolbar=no,directories=no,location=no,menubar=no,status=no,left=0,top=0'); return false\">the before\/after image at the top of the post should be this<\/a>, but for me, the two other logos were just silly diversions from the original that should have never happened &mdash; although it loses impact with the lower x-height and wider spreading MA. And we can talk about the album cover, which is a very striking and cool image, especially in contrast to the old highly-illustrated covers (although not to the Black Album). And we can talk about the iconography of the white coffin icon and the sideways Metallica M, which is ideal for merchandise. <\/p>\n<p>But the real topic of interest is the evolution of Metallica into a brand with a fully developed style guide and kit of parts. I&#8217;m not implying Metallica has sold out, I think it&#8217;s difficult for Heavy Metal to be sold out&hellip; in any case, it signals the final and full embrace of branding, the word that sent shivers down the spine of everyone in the early 2000s. Heavy Metal has always been a brand: The sound, the volume, the dress code, the air guitar, the hair-dos, the rebellion, and the skulls, thorns, spikes and other angry visual elements that compose it. But it had never been deployed in such an upfront matter and, to some (not me, I think), this may be a shift better summed up by track two of the Black Album: Sad but True.<\/p>\n<p><strong>Bonus:<\/strong> To attest to my circa 1995 bad-assedness, here is a picture of me rocking out in my bedroom. Guns N&#8217; Roses, Iron Maiden and Metallica posters for ambiance.<\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/armin_vit_rocking_out_1990s.jpg\" alt=\"Me, circa 1995\" \/><\/p>\n<p><span class=\"small\"><strong>Me, circa 1995.<\/strong><\/span><\/p>","protected":false},"excerpt":{"rendered":"<img src=\"https:\/\/www.underconsideration.com\/brandnew\/images\/excerpt_empty.gif\" alt=\"Excerpt Empty\" \/>","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[9,66,26],"tags":[],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/697"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=697"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/697\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=697"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=697"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=697"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}