{"id":6987,"date":"2018-10-22T10:01:39","date_gmt":"2018-10-22T15:01:39","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/brand_new_co_op_shop_introduction.php"},"modified":"2018-10-22T10:01:39","modified_gmt":"2018-10-22T15:01:39","slug":"brand_new_co_op_shop_introduction","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/brand_new_co_op_shop_introduction.php","title":{"rendered":"Brand New Co-op Shop: Introduction"},"content":{"rendered":"<h1 class=\"friday_likes red\" style=\"margin: 40px 0 10px;\">The preamble<\/h1>\n<p>Earlier this year we started a conversation with the folks at <a href=\"https:\/\/cottonbureau.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Cotton Bureau<\/a> &#8212; a wonderful platform that allows anyone to design, print, sell, and distribute high-quality t-shirts &#8212; about the potential of launching a dedicated Brand New shop through them and we&#8217;ve been trying to figure out the best possible approach, which we think we may have figured out and it involves you! &#8220;You&#8221; being anyone who reads Brand New and enjoys the content.<\/p>\n<!--more--><p>Cotton Bureau, if you are unfamiliar, works based on &#8220;campaigns&#8221;: a design for a t-shirt is offered for a 2-week, pre-order period with a minimum amount of 12 t-shirts sold needed to go to print. If 12 t-shirts are pre-sold, they print 12. If 1,200 t-shirts are pre-sold, they print 1,200. So it&#8217;s all based on popularity and demand. Given the liveliness of our audience and how vocal you are in voting things up and down, we think there is a fun opportunity here.<\/p>\n<h1 class=\"friday_likes red\" style=\"margin: 40px 0 10px;\">The idea<\/h1>\n<p>Rather than us making Brand New-<em>branded<\/em> t-shirts we instead want to open up the campaigns to anyone with an idea for Brand New-<em>related<\/em> t-shirts. There could be a t-shirt that says &#8220;Before\/After&#8221; in a clever way, or one that has a drawing of a tote bag mock-up, or one with a geometric sans serif that says &#8220;Your logo here&#8221;. It&#8217;s not about promoting Brand New but celebrating the insider stuff you come to Brand New for.<\/p>\n<p>The end goal is to have an active, dedicated store on Cotton Bureau (of which there are only a few) similar to those of other content generators like <a href=\"https:\/\/cottonbureau.com\/stores\/the-west-wing-weekly\" target=\"_blank\" rel=\"noopener noreferrer\">The West Wing Weekly<\/a> and <a href=\"https:\/\/cottonbureau.com\/stores\/mkbhd#\/shop\" target=\"_blank\" rel=\"noopener noreferrer\">MKBHD<\/a>. Eventually we could grow the offerings to include more than t-shirts &#8212; tote bags anyone?<\/p>\n<h1 class=\"friday_likes red\" style=\"margin: 40px 0 10px;\">The process<\/h1>\n<p>This is the first draft. Feedback is welcome.<\/p>\n<p><strong>Step 1: T-shirt Submissions and Upvoting<\/strong><br \/>\nEvery two months we will start a new post. In the comments section you will upload your idea(s) for a t-shirt. These can be fairly loose ideas or as finished as you want them to be. Everyone is encouraged to upvote and downvote (as ethically as possible).<\/p>\n<p><strong>Step 2: Top Vote-getters Refinement<\/strong><br \/>\nAfter 1 or 2 weeks (to be determined) I will work with the top vote-getters to either refine the idea or get it prepared for possible print production. (We reserve the right to deny any top-voted t-shirt if we feel it&#8217;s offensive, inappropriate, or irrelevant to the logo, identity, and branding focus of Brand New.)<\/p>\n<p><strong>Step 3: Launch Campaigns<\/strong><br \/>\nWhen the designs are ready, we will launch 2, 3, or 5 (or maybe just 1) Cotton Bureau campaign(s) at once, letting anyone pre-order.<\/p>\n<p><strong>Time-sensitive campaigns<\/strong><br \/>\nIf a regular post on Brand New were to yield a great t-shirt idea on the spot and it got a big reaction, we could launch a campaign right away.<\/p>\n<h1 class=\"friday_likes red\" style=\"margin: 40px 0 10px;\">The profit sharing<\/h1>\n<p>Regardless of how many t-shirts are sold &#8212; 12 or 1,200 &#8212; we will give the designer of the t-shirt 40% of the profit from the campaign. (IMPORTANT: profits only kick in after 25 shirts are sold). So, let&#8217;s assume the production cost of your t-shirt was $20 and we sold it for $30. That is a $10 profit per t-shirt. If we sell 125 t-shirts, that&#8217;s a $1,000 profit. You get $400, we get $600*. The great thing about Cotton Bureau campaigns is that they are finite; there are no further sales after the pre-order period so it&#8217;s completely transparent how many t-shirts sold and what your cut is.<\/p>\n<p>* Why do we get more? Because we have spent thousands of hours and invested much more than time into building this blog.<\/p>\n<h1 class=\"friday_likes red\" style=\"margin: 40px 0 10px;\">Design considerations<\/h1>\n<p>We will post a more detailed set of guidelines, access to Cotton Bureau&#8217;s design template, and criteria for the first call for submissions but in general you must keep in mind that you are designing for designers, so your execution has to be tight. We will most likely set a limit of 2 ink colors (plus whatever t-shirt color you want) as a way to keep things under control in terms of production and cost &#8212; the more colors, the higher the cost, the harder it is to sell. Obviously, don&#8217;t steal anything from anyone. Keep it fun, loose, and civil!<\/p>\n<p>Logo parodies will not be accepted (e.g., using the LEGO wordmark to write out &#8220;LOGO&#8221;) because even though parodies are mostly protected by law we do not want to invite legal action from any major corporation &#8212; a simple cease and desist letter can cost us a few thousand dollars to deal with. And we don&#8217;t want to deal with anything of the sort.<\/p>\n<p>Let us know what you think of the idea and if there is anything we can do to improve it.<\/p>\n<h1 class=\"friday_likes red\" style=\"margin: 40px 0 10px;\">First call for submissions<\/h1>\n<p class=\"end\">We are planning on starting next Monday, October 29, so that potentially we can have a handful of campaigns live and ready for some Holiday shopping. So start thinking about some possible ideas!<\/p>","protected":false},"excerpt":{"rendered":"The preamble Earlier this year we started a conversation with the folks at Cotton Bureau &#8212; a wonderful platform that allows anyone to design, print, sell, and distribute high-quality t-shirts &#8212; about the potential of launching a dedicated Brand New&#8230;","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[23],"tags":[1623],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/6987"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=6987"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/6987\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=6987"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=6987"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=6987"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}