{"id":7658,"date":"2019-05-21T04:32:55","date_gmt":"2019-05-21T09:32:55","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/new_logo_and_identity_for_foilco_by_studio_dbd.php"},"modified":"2019-05-21T04:32:55","modified_gmt":"2019-05-21T09:32:55","slug":"new_logo_and_identity_for_foilco_by_studio_dbd","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/new_logo_and_identity_for_foilco_by_studio_dbd.php","title":{"rendered":"New Logo and Identity for Foilco by Studio DBD"},"content":{"rendered":"<p>Established in 1987, <a href=\"http:\/\/www.foilco.co.uk\/\" target=\"_blank\" rel=\"noopener noreferrer\">Foilco<\/a> is a supplier of stamping foil to the print industry in the UK. Based in Warrington, England, the company supplies eight different types of foil &#8212; including classics like gold and silver as well as more exotics like transparent and holographic &#8212; and is a well-known and well-regarded supporter of the graphic design industry in the UK, sponsoring events as well as holding their own, called <a href=\"https:\/\/multiplicitybyfoilco.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Multiplicity<\/a>. Foilco was recently awarded The Queen&#8217;s Award for Enterprise: International Trade 2019, the highest official UK awards for British businesses and also recently introduced a new identity designed by <a href=\"http:\/\/www.studiodbd.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Studio DBD<\/a> in Manchester, UK.<\/p>\n<!--more--><p>Disclaimer: I realize this isn&#8217;t a huge company but the love of foil stamping I think is universal and we can all appreciate a nice identity for a company that spreads the joy of foil.<\/p>\n<blockquote>The first step was to simplify Foilco&#8217;s message. We wanted to clarify as much as possible what Foilco offered. Most people know they supply hot stamping foils but when we broke it down we wanted to consider what that actually meant. We worked together to understand that there were eight key types of foil that Foilco offered. This gave us a starting point.<br \/><br \/>Whilst spending a lot of time within the company we saw rolls upon rolls of foil being stacked, cut, packed and dispatched. The rolls are extremely impactful in various sizes but from a creative point of view they are simplified by a circle shape. This shape gave us another element to start experimenting with. By looking at a roll of foil from the end we could see various circles and the roll mimicked the trunk of a tree with it&#8217;s many lines representing the years the tree has been growing for. This symbolised the element of knowledge for us as Foilco have over 30 years working in foil we wanted that to be apparent within the brand.<br \/><br \/>The next thing the circle was able to do was create the number eight, therefore representing the the key types of foil again. By simply placing two circles over each other we could create this number. A little research also suggested the number was synominous with the infinity symbol. This was ideal for the brand as Foilco offer over 250 colours and infinite possibilities of use. By using a simple fact of focussing on what Foilco offered we had been able to highlight knowledge and range, two key values that the company believe and helps to set them apart from competitors.<br \/><br \/>We looked harder at the company values and were able to ascertain eight key aspects that the company stood for. They are Knowledge, Discovery, Possibility, Inspiration, Innovation, Conduct, Process and Responsibility. We made sure that each word had a letter O in it to help connect the eight circles.<\/blockquote><h3>Studio DBD provided text<\/h3>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/foilco_logo_concept.png\" alt=\"New Logo and Identity for Foilco by Studio DBD\" \/>\n<figcaption>The concept around the 8 rings, 8 foil styles, 8 values to create the 8-pointed starburst.<\/figcaption>\n<\/figure>\n<figure class=\"full\"><div class=\"video-container\"><video controls controlsList=\"nodownload\" poster=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/foilco_logo_concept_animation.jpg\"><source src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/foilco_logo_concept_animation.mp4\" type=\"video\/mp4\">Your browser does not support the video tag.<\/video><\/div>\n<figcaption>Concept, animated.<\/figcaption>\n<\/figure>\n<blockquote>These eight circles (representing the foil types and brand values) are all interlinked and connected. Each of them share the exact same value, each as important as the other one. The shape that is created within these circles is the Foilco mark. Foilco is at the heart of the values and the product. The shape is unique to Foilco. We deliberately wanted it to be bold and classic. We needed to make sure it foiled well (of course) but could also work at various sizes. One of the issues with the original logo was the way it sat on the page. We made sure the new logo could work in a variety of ways, whilst at all times staying iconic.<\/blockquote><h3>Studio DBD provided text<\/h3>\n<figure class=\"quarter\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/foilco_logo.png\" alt=\"New Logo and Identity for Foilco by Studio DBD\" \/>\n<figcaption>Logo.<\/figcaption>\n<\/figure>\n<p>The old logo was bland and generic while also making no sense while attempting to mean something: what exactly were those three oblique bars trying to represent? And the wordmark was so thin it was the kind of typographic treatment most foil stamp printers would tell you you need to make bolder because the foil won&#8217;t hold. The new logo is a literal burst of joy at first glance, with a flared octagon that could metaphorically convey the impact of foil stamping. Deep within it, though, are five long paragraphs that explain why the number 8 matters, which I respect as a process to get to a solution that is rooted in something relevant but that could have probably been explained in one paragraph. Yet, we are not here to critique the write-up but the logo, which I really like. The &#8220;F.&#8221; looks great inside the shape and I love how they tucked the period under the &#8220;F&#8221; to get the monogram neatly centered. The wordmark is nice enough but I do question the kerning on this one, which is a problem caused by the wide &#8220;L&#8221;, leaving a huge gap between it and the &#8220;C&#8221; but a tight gap between it and the &#8220;I&#8221;. Nonetheless, a lovely logo overall and I&#8217;m somewhat surprised we haven&#8217;t seen that burst holding shape before on Brand New &#8212; seems like it should be more popular.<\/p>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/foilco_logo_on_foil_01.jpg\" alt=\"New Logo and Identity for Foilco by Studio DBD\" \/>\n<hr \/>\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/foilco_logo_on_foil_02.jpg\" alt=\"New Logo and Identity for Foilco by Studio DBD\" \/>\n<figcaption>Logo on foil because foil.<\/figcaption>\n<\/figure>\n<blockquote>We decided to go for a black and white colour scheme for the logo and only use colour through foil itself. Therefore we needed to create a series of images of foil. The main brief for the photographer was to make the foil look appealing and interesting whilst also appealing to a creative audience. The rolls are iconic in themselves and we wanted to make the product stand out as much as possible. We worked closely with the London based photographer Andy Mackie to shoot some creative imagery. Andy worked alongside set builder Elena Horn to help produce some really innovative shots that allow foil to be seen in a different light. As well as some delicately balanced and art directed shots we also asked Andy to shoot some more abstract images to help us create the brand for the company. Foil needed to be at the forefront of the new identity and the use of these images allows it to be just that.<\/blockquote><h3>Studio DBD provided text<\/h3>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/foilco_photography_abstract_01.jpg\" alt=\"New Logo and Identity for Foilco by Studio DBD\" \/>\n<hr \/>\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/foilco_photography_abstract_02.jpg\" alt=\"New Logo and Identity for Foilco by Studio DBD\" \/>\n<figcaption>Abstract foil photography.<\/figcaption>\n<\/figure>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/foilco_photography_product_01.jpg\" alt=\"New Logo and Identity for Foilco by Studio DBD\" \/>\n<hr \/>\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/foilco_photography_product_02.jpg\" alt=\"New Logo and Identity for Foilco by Studio DBD\" \/>\n<hr \/>\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/foilco_photography_product_03.jpg\" alt=\"New Logo and Identity for Foilco by Studio DBD\" \/>\n<figcaption>Product photography.<\/figcaption>\n<\/figure>\n<p>When your product looks as great as it does in its raw form it would be a disservice to not highlight it through photography and both approaches &#8212; the abstract and literal &#8212; here really make the foils mouthwatering.<\/p>\n<blockquote>As well as imagery we suggested to Foilco that they would benefit from a bespoke typeface to help the company stand out even further from their competitors. We worked with UK based <a href=\"https:\/\/www.f37foundry.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Rick Banks (F37)<\/a> to create a totally crafted and unique typeface. Rick visited Foilco and we discussed various ways in which the typeface needed to reflect the movement and flow of foil. Rick presented a number of initial solutions and after feedback we settled on the creation of a typeface named Pamela (The wife of founder David Hornbys and the mother to the two directors Paul and Matt). Pamela works so well with the brand logo we created and the two compliment each other in many ways.<\/blockquote><h3>Studio DBD provided text<\/h3>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/foilco_font_01.png\" alt=\"New Logo and Identity for Foilco by Studio DBD\" \/>\n<hr \/>\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/foilco_font_02.jpg\" alt=\"New Logo and Identity for Foilco by Studio DBD\" \/>\n<figcaption>Custom typeface.<\/figcaption>\n<\/figure>\n<p>The custom typeface is super weird and I mean that as an effusive compliment. When I first received the project in my inbox, saw the logo, and then read there was also a custom typeface, I thought it would be another &#8220;proprietary&#8221; geometric sans serif to match the wordmark. But no! It&#8217;s a&#8230; something. It&#8217;s a high-contrast-flared-sans-serif-with-half-inverted-slab-chiseled-serifs thing. I would never buy it if it were retail but it&#8217;s kind of awesome and it definitely has zero fucks to give &#8212; just look at that &#8220;I&#8221;! I wasn&#8217;t sure about their statement that &#8220;Pamela works so well with the brand logo we created and the two compliment each other in many ways&#8221; but, as seen in the applications below, it&#8217;s kind of amazing that the statement holds true. The logo and Pamela are strange bedfellows.<\/p>\n<blockquote>Finally we needed a series of statements and messages to launch the new brand. We ascertained a number of reasons why people use foil in their design work. Often it&#8217;s to make something stand out or focus someones attention. The tone of voice and copy is key to the new brand and again we wanted foil to be at the heart of this. The messages such as &#8216;I WAS MADE TO STAND OUT&#8217; and &#8216;I WASN&#8217;T MADE TO BE QUIET&#8217; are bold statements written as if the foil itself it saying them. However they are also relating to Foilco in the way that the company is innovative, confident and prepared to be different without being arrogant or egotistical.<\/blockquote><h3>Studio DBD provided text<\/h3>\n<figure class=\"full\">\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/foilco_messaging_01.jpg\" alt=\"New Logo and Identity for Foilco by Studio DBD\" \/>\n<hr \/>\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/foilco_messaging_02.jpg\" alt=\"New Logo and Identity for Foilco by Studio DBD\" \/>\n<hr \/>\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/foilco_messaging_03.jpg\" alt=\"New Logo and Identity for Foilco by Studio DBD\" \/>\n<hr \/>\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/foilco_messaging_04.jpg\" alt=\"New Logo and Identity for Foilco by Studio DBD\" \/>\n<hr \/>\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/foilco_messaging_05.jpg\" alt=\"New Logo and Identity for Foilco by Studio DBD\" \/>\n<hr \/>\n<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/foilco_messaging_06.jpg\" alt=\"New Logo and Identity for Foilco by Studio DBD\" \/>\n<figcaption>Various messaging.<\/figcaption>\n<\/figure>\n<figure class=\"full\"><div class=\"video-container\"><video controls controlsList=\"nodownload\" poster=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/foilco_identity_introduction.png\"><source src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/foilco_identity_introduction.mp4\" type=\"video\/mp4\">Your browser does not support the video tag.<\/video><\/div>\n<figcaption>Identity introduction video.<\/figcaption>\n<\/figure>\n<p class=\"end\">This is certainly an identity that can take more visual risks given that graphic designers are the client&#8217;s main audience but it&#8217;s easy for that to devolve into gratuitous eye candy and here all the elements have been well thought out, they are wild but restrained, and help make foil stamping even more of an offer you can&#8217;t refuse.<\/p>","protected":false},"excerpt":{"rendered":"Established in 1987, Foilco is a supplier of stamping foil to the print industry in the UK. Based in Warrington, England, the company supplies eight different types of foil &#8212; including classics like gold and silver as well as more&#8230;","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[9,71,26],"tags":[857,1515,40,228,446],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/7658"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=7658"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/7658\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=7658"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=7658"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=7658"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}