{"id":7766,"date":"2019-07-08T10:11:22","date_gmt":"2019-07-08T15:11:22","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/seeking_two_charitiesnon-profits.php"},"modified":"2019-07-08T10:11:22","modified_gmt":"2019-07-08T15:11:22","slug":"seeking_two_charitiesnon_profits","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/seeking_two_charitiesnon_profits.php","title":{"rendered":"Seeking Two Charities\/Non-profits for BNConf (Updated)"},"content":{"rendered":"<p><strong class=\"red\">Update July 12:<\/strong> We have found two awesome organizations to work with and once it&#8217;s all settled behind the scenes we will announce who they are. We seriously could not have done this without your help. Most, if not all, of the applications we received were from referrals and only a few were people who directly saw this post. So, many thanks for spreading the word!<\/p>\n<p>&mdash; &mdash; &mdash;<\/p>\n<p>As part of a new initiative within the Brand New Conference <a href=\"https:\/\/www.underconsideration.com\/brandnewconference\/BNConfDoesGood.php\" target=\"_blank\" rel=\"noopener noreferrer\">to try to do some good in the world<\/a> (in a small way at least), we are looking for two charities\/non-profit organizations who are interested in kickstarting a rebranding process. Over the last three months we have been trying on our own to identify (and engage with) organizations like these, local to Las Vegas, but have come up empty so we are turning to you for help in case you know someone or happen to be that someone working inside a charity\/non-profit in a design\/marketing\/branding capacity. So&#8230;<\/p>\n<p><strong>What we are looking for<\/strong><br \/>One representative of a 501(c) organization &#8212; focused on social causes (as opposed to an arts\/culture organization) &#8212; in the United States that is interested and willing to kickstart a rebranding process.<\/p>\n<p><strong>Costs to you<\/strong><br \/>None. We will cover flight and accommodation for one person.<\/p>\n<p><strong>The goals of this initiative<\/strong><br \/>1) Help you connect with potential creative partners &#8212; graphic designers, copywriters, illustrators, web designers, etc. &#8212; at the conference that would be inclined to offer their services pro-bono to help you rebrand your charity.<\/p><p>2) Provide a forum to share the mission and work of your charity to shine a spotlight on it and, ideally, get some donations on-site.<\/p>\n<p><strong>How we plan on making these goals happen<\/strong><br \/>Our conference is single track &#8212; all 1,000+ attendees are in the same room, seeing them same content. Each day, we have 8 sessions, 45 minutes each, for guest speakers, each talking about their work. We are dedicating one of the eight sessions of each day, in the morning, to Doing Good: 2 designers will each share (for 15 minutes) a rebranding they did pro-bono for a charity or nonprofit. Then you would get the other 15 minutes to talk about all the good you do so that the audience can get to know you.<\/p>\n<p>During the rest of the day, we will set up a table in the lobby where people can approach you to learn more, offer their help, and\/or make a donation. The main goal at this point would be for you to make connections, have conversations, and perhaps meet an ideal creative partner (or a handful of them). The next day it would be the same, but for the other charity.<\/p>\n<p>We are expecting between 1,000 and 1,250 people so it&#8217;s not a huge conference like other Vegas events, making it more intimate. Our audience is super nice and they are a very talented bunch. It&#8217;s a great opportunity to meet some people that could really make a positive impact on your organization.<\/p>\n<p><strong>What we are looking for from you<\/strong><br \/>As a reminder, this does not cost you anything and there is no hidden ask. The main requirement to participate is having an interest in rebranding your charity\/organization and the willingness to make it happen. We are not going to make you sign a contract or anything formal like that and we understand if something were to stop you from actually seeing this through but we want to make sure that the charity\/nonprofit we feature really benefits from this and does not take away the opportunity from another organization.<\/p>\n<p>Prepare a 15-minute presentation about your organization and its recent design\/branding\/marketing efforts and what your challenges are as you look to evolve.<\/p>\n<p><strong class=\"red\">If interested<\/strong><br \/>Please reach out to me at armin@underconsideration.com with a brief intro to your organization, your role in it, and expressed willingness to make some connections at the conference!<\/p>\n<p>We don&#8217;t have a set deadline for this but the sooner we can figure this out, the better.<\/p>","protected":false},"excerpt":{"rendered":"Update July 12: We have found two awesome organizations to work with and once it&apos;s all settled behind the scenes we will announce who they are. We seriously could not have done this without your help. Most, if not all,&#8230;","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[23],"tags":[248],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/7766"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=7766"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/7766\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=7766"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=7766"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=7766"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}