{"id":786,"date":"2009-03-10T06:34:12","date_gmt":"2009-03-10T11:34:12","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/comments_the_day_after.php"},"modified":"2009-03-10T06:34:12","modified_gmt":"2009-03-10T11:34:12","slug":"comments_the_day_after","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/comments_the_day_after.php","title":{"rendered":"Comments: The Day After"},"content":{"rendered":"<p>Not to dwell much longer on the subject, but just to bring some conclusions so that we can move on with our regularly scheduled posts. I have never considered our blogs to be one-way discussions where what we say is the last word, so I want to thank everyone that shared their opinion, and they are all taken into account.<\/p><!--more--><p><strong>Negative vs. Positive<\/strong>\nThere was a misunderstanding that I was trying to skew the comments toward being all positive. This is not the intention. I signaled out the &#8220;This sucks.&#8221; vs. &#8220;This rocks.&#8221; because those are the most, in my mind, shallow type of comments. I understand that &#8220;This rocks.&#8221; is as empty. As is clear, I am the first to provide a negative review where one warrants it, so you can rest assured that Brand New is not the place to come solely for praise. So&hellip;<\/p>\n<p><strong>Elaborate<\/strong>\nIt&#8217;s not about whether something sucks or rocks, it&#8217;s about why you think it does so. Hearing your opinions is helpful for the designer of the project being discussed and for those reading. No one can grow otherwise. However, I had not realized until I read the comments that there is indeed a need to just share gut reactions. Which brings us to&hellip;<\/p>\n<p><strong>Quickie Opinions \/ Rating System<\/strong>\nThis is not a bad idea, and done right, not just a thumbs up\/thumbs down option, it could be a smart addition. This will take some time to implement, but I&#8217;ll look into it. In the meantime&hellip;<\/p>\n<p><strong>Short opinions<\/strong>\nI will ask, again, that you elaborate as much as you can, but while I am able to provide an alternative for the gut reactions, I will be much more relaxed about the two-word reviews. Speaking of which&hellip;<\/p>\n<p><strong>Censorship<\/strong>\nThe misunderstanding that I would censor just bad reviews is also wrong. I can see how it would read that way, but I want to assure you that wasn&#8217;t the intention. As most pointed out, censorship will happen on hurtful and asinine comments. The idea of &#8220;hiding&#8221; the bad comments is interesting, I will look into that, but it looks like more work than it deserves. Where I will be more strict is in&hellip;<\/p>\n<p><strong>Anonymity<\/strong>\nI am not asking to get anyone&#8217;s social security number or to tell us their birthday and, yes, anyone can create a fake e-mail and profile, etc. It&#8217;s about accountability and taking responsibility for your words. If you want to post under LogoCrapper, that&#8217;s fine, but give us the option to look for LogoCrapper on Twitter, Flickr, Facebook, wherever, so that we can get a sense that we are interacting with a person that actually cares about what words come out of their keyboards. Most of the stupidest and meanest comments come from anonymous posters, which I believe is no small coincidence. And&hellip;<\/p>\n<p><strong>Registration \/ Profiles<\/strong>\nMight help, but as user I have always hated sites that require registration, I just end up not commenting at all, so I really don&#8217;t want to have that barrier.<\/p>\n<p><strong>Deal?<\/strong>\nLet&#8217;s move on with the premise that we will all be more considerate in our opinions, whether they are positive or negative. They are all welcome as long as they are thoughtful and respectful.<\/p>","protected":false},"excerpt":{"rendered":"<img src=\"https:\/\/www.underconsideration.com\/brandnew\/images\/excerpt_empty.gif\" alt=\"Excerpt Empty\" \/>","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[29,10,26],"tags":[],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/786"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=786"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/786\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=786"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=786"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=786"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}