{"id":806,"date":"2009-04-03T06:33:58","date_gmt":"2009-04-03T11:33:58","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/you_dont_know_dick.php"},"modified":"2009-04-03T06:33:58","modified_gmt":"2009-04-03T11:33:58","slug":"you_dont_know_dick","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/you_dont_know_dick.php","title":{"rendered":"You Don&apos;t Know Dick"},"content":{"rendered":"<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/dick_smith_logo.gif\" alt=\"Dick Smith Logo, Before and After\" \/><\/p>\n<p><span class=\"small\"><strong>Guest Review by Chris Thorpe<\/strong><\/span><\/p>\n<p>Since 1968, <a href=\"http:\/\/www.dse.com.au\" target=\"_blank\" rel=\"noopener noreferrer\">Dick Smith Electronics<\/a> has provided Australian consumers with a wide range of electronic products, from transistor radio kits and cables to computers and cameras. Founded by entrepreneur (and more recently aviator) Dick Smith, it used a series of marketing gimmicks (including creating a fake iceberg and sailing it into Sydney Harbour) to raise its public profile until it was sold to <a href=\"http:\/\/www.woolworthslimited.com.au\" target=\"_blank\" rel=\"noopener noreferrer\">Woolworths<\/a> in 1980. As part of Woolworths&#8217; <a href=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/person_or_apple_discuss.php\">recent rebranding<\/a>, the identity has been changed to reflect the updated style of the rest of the Woolworths Group. It is also an attempt to counter general perceptions of the company as a budget retailer, along with absorbing Dick Smith Powerhouse and Tandy Electronics, creating a unified electronics store for the Woolworths Group under the name Dick Smith. This logo, designed by <a href=\"http:\/\/www.hoyne.com.au\" target=\"_blank\" rel=\"noopener noreferrer\">Hoyne Design<\/a>, is part of an attempt to move the retailer towards a consumer electronics brand, and also includes substantial changes to the store displays and graphics.<\/p><!--more--><p>Here&#8217;s a statement from Dick Smith&#8217;s spokesman:<\/p>\n<blockquote>Dick Smith is a successful business and brand but we needed to ensure we are relevant to modern consumers. The objective of the rebrand was to make the Dick Smith brand relevant in today&#8217;s market and support the business moving from electronics to technology. Research conducted over past 18 months confirmed the Dick Smith Brand was dated and considered old fashioned. The word electronics had us stuck in the 1970s. We&#8217;re in the technology and entertainment business and we realised we needed a contemporary brand to match that.<br \/><br \/>Our new branding invites customers to come talk to us &mdash; after all we have been talking technology for 40 years. We are solution providers and we are about humanizing technology and making the category exciting not daunting &mdash; that&#8217;s why we like to call ourselves Techxperts!<\/blockquote>\n<p>And we have also received some insight from Hoyne Design:<\/p>\n<blockquote>To Dick Smith their predicament was obvious. Their brandmark featured the head of a man no longer connected to the business. They were famous as suppliers of electronic components but their current product range featured more desirable modern gadgets such as mobile phones, iPods, laptops and plasma screens. Their target audience thought of them as &#8220;geeks.&#8221; So how do you reboot a 30-year old icon?<br \/><br \/>Fast-moving technology can be confusing and intimidating. Hoyne capitalised on Dick Smith&#8217;s &#8220;geeky&#8221; reputation by repositioning them as trusted specialists, with the new tagline, &#8220;Talk to the Techxperts.&#8221; Hoyne&#8217;s new strategy included a decapitated brandmark, featuring a &#8220;d&#8221; styled like a speech bubble, a friendly, quirkier communication tone and new-look stores that have increased visitation and are expected to save Dick Smith over $3 million in fit-out costs.<br \/><br \/>Sales at Dick Smith&#8217;s 33 newly refurbished stores grew 11.7%, outperforming a major competitor&#8217;s 101 bigger-format outlets.<\/blockquote>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/dick_smith_detail.gif\" alt=\"Dick Smith Logo, Detail\" \/><\/p>\n<p>Given that the literal image of its founder was so central to the branding for Dick Smith Electronics, the choice to remove his grinning, omniscient head is a little strange. Admittedly, the old logo looked a little dated and cheap, but this newer logo, while more contemporary, seems unresolved. The typography is unbalanced, and even though I can see the idea behind the speech bubble &#8220;d&#8221; working well, it doesn&#8217;t fit with the rest of the typeface&mdash;it feels a lot thinner, particularly when compared with the ascenders of the other letters. The difference in sizes across the counter forms creates a logotype that feels unfinished. The use of what looks like an unmodified version of The Sans, combined with stacking it under &#8220;Smith&#8221; only serves to unbalance the logo even further. And what is going on with that &#8220;s&#8221;? The type does express the technology angle of the store well, but the tag line is just too questionable; I keep getting stuck on how I&#8217;m meant to pronounce it. It appears as though the tag line was crafted <em>before<\/em> the logo, and that the designer was told to integrate their design with it.<\/p>\n<p>In spite of these criticisms, I think the redesign makes sense &mdash; the company has appeared dated for a long time and was overdue for an update &mdash; though I can&#8217;t help but feel that some of the qualities that made Dick Smith unique have been lost.<\/p>\n<p><span class=\"small\"><strong>Chris Thorpe is a Melbourne based graphic design student and freelancer. He is also to be thanked for first tip.<\/strong><\/span><\/p>","protected":false},"excerpt":{"rendered":"<img src=\"https:\/\/www.underconsideration.com\/brandnew\/images\/excerpt_empty.gif\" alt=\"Excerpt Empty\" \/>","protected":false},"author":5,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[9,86,26],"tags":[],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/806"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=806"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/806\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=806"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=806"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=806"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}