{"id":809,"date":"2009-04-08T08:21:07","date_gmt":"2009-04-08T13:21:07","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/how_things_end_up_on_brand_new.php"},"modified":"2009-04-08T08:21:07","modified_gmt":"2009-04-08T13:21:07","slug":"how_things_end_up_on_brand_new","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/how_things_end_up_on_brand_new.php","title":{"rendered":"How Things End Up on Brand New"},"content":{"rendered":"<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/process_explained.gif\" alt=\"Process Explained\" \/><\/p>\n<p>No one has really asked, but given that my brandnew@ e-mail account is swelling with unanswered e-mails about tips and suggestions, I feel a self-imposed burden to explain a little bit of how I choose which identities we review here on Brand New.<\/p><!--more--><p><strong>Replying<\/strong>\nFirst things first: I have found it impossible to reply to every single e-mail that comes in. Since I started Speak Up back in 2002 I made it a point to answer every conceivable question or inquiry that came through my inbox as a way of paying back the attention that people have paid to our web sites. But I never expected to get up to 15 or 20 e-mails a day just for Brand New. Which is undeniably great, because those e-mails become the main source of our content. But let&#8217;s all agree that unless you are asking a specific question or have some concerns or feedback I will not be able to reply to all tips sent in. Consider this paragraph my eternal reply button extending my gratitude.<\/p>\n<p><strong>Tips<\/strong>\nKeep them coming at <em>brandnew [@] underconsideration [.] com<\/em>. I receive everything from &#8220;I was driving down the road and saw a new logo on this building&#8221; to fully researched e-mails. They are all welcome. You send them in, we will do the hard work.<\/p>\n<p><strong>Mainstream<\/strong>\nOkay, so on to some criteria. One of the first things I try to look at is if the product, service or corporation is relevant to a large number of people. Is it well known? Does it have history? Why should we care? If it&#8217;s a well known brand, chances are we will put it up.<\/p>\n<p><strong>Not so mainstream<\/strong>\nFor every major brand, there are a handful of lesser known identities that we have posted. Whether they are corporations that we may have never heard of but that have 10,000 employees worldwide or whether it&#8217;s product only sold regionally, we will review it if it&#8217;s an interesting story and there is something to learn from it.<\/p>\n<p><strong>Not mainstream at all<\/strong>\nIf I have never ever heard of the corporation, product or service and further Google-ing reveals that it is small or very local, we will not post it. There is nothing wrong with that kind of work and I do it myself all the time, but as far as Brand New content, it doesn&#8217;t work. It has to be a <em>very<\/em> compelling design story for us to post something very small.<\/p>\n<p><strong>International<\/strong>\nMost of the identities we review are American. That&#8217;s because, the majority of our readers are in the U.S., but we have an increasingly international audience and I really enjoy posting work from around the world. If you are tipping us from afar, please let us know what kind of relevance any given identity would have in your motherland, so that we can have a better understanding of it.<\/p>\n<p><strong>Timeliness<\/strong>\nI have broken this rule a few times, but anything that is more than three or six months old will not be posted.<\/p>\n<p><strong>Packaging<\/strong>\nThis year, I think we have already shown more packaging than last year. There is no plan to turn into a packaging-heavy web site, I do want to keep it focused on the identity aspect. But there are some products that are so defined by their label and packaging, beyond just their logo, that it&#8217;s very interesting for discussion. So we will post packaging somewhat selectively and not every box of crackers that redesigns will be posted.<\/p>\n<p><strong>General discussions<\/strong>\nEvery now and then I get e-mails with suggestions of broader discussions about logo and identity topics. Nothing wrong with those, but Brand New is not the place for them. It&#8217;s either a Before\/After post or New or an In Brief.<\/p>\n<p><strong>Summing up<\/strong>\nThe identities we review most be interesting and relevant, something that we care to see discussed whether it&#8217;s because we are familiar with the brand or because we are interested in the visual result. There is no real formula for selecting and, at the end of the day, it all comes down to my whims &mdash; for example, I know <a href=\"http:\/\/www.healthychoice.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Healthy Choice<\/a> redesigned, but I just don&#8217;t feel like posting it for some reason. So, that&#8217;s it, nothing else to report, I just wanted to get this all off my chest assuming someone might be curious.<\/p>","protected":false},"excerpt":{"rendered":"<img src=\"https:\/\/www.underconsideration.com\/brandnew\/images\/excerpt_empty.gif\" alt=\"Excerpt Empty\" \/>","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[82,26],"tags":[],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/809"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=809"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/809\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=809"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=809"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=809"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}