{"id":813,"date":"2009-04-14T06:29:40","date_gmt":"2009-04-14T11:29:40","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/the_great_white_wash.php"},"modified":"2009-04-14T06:29:40","modified_gmt":"2009-04-14T11:29:40","slug":"the_great_white_wash","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/the_great_white_wash.php","title":{"rendered":"The Great White Wash"},"content":{"rendered":"<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/greatValue_packaging.jpg\" alt=\"Great Value Packaging, Before and After\" \/><\/p>\n<p><a href=\"http:\/\/www.walmart.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Walmart<\/a> has taken some of their 250 billion dollars in sales and invested it in improving their own line of products. This initiative has involved extensive product and consumer testing, the introduction of new formulas and products, a staffed number for consumers&#8217; product inquiries, the ability to rate and review their products on on their site, and of course <a href=\"http:\/\/walmartstores.com\/FactsNews\/Photos\/Gallery.aspx?id=605\" target=\"_blank\" rel=\"noopener noreferrer\">new packaging<\/a>.<\/p><!--more--><p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/greatValue_3.jpg\" alt=\"Great Value Packaging, New\" \/><\/p>\n<blockquote>Walmart redesigned Great Value packaging graphics to create a consistent, recognizable look throughout the store, making it easier for customers to find their favorite products. The new Great Value packaging offers easy-to-read nutrition labels and more appetizing food photography. Walmart also reduced packaging when possible as part of the company&#8217;s sustainability goals.<br \/>&mdash; <a href=\"http:\/\/walmartstores.com\/FactsNews\/NewsRoom\/9028.aspx\" target=\"_blank\" rel=\"noopener noreferrer\">Press Release<\/a><\/blockquote>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/greatValue_Old_1.jpg\" alt=\"Great Value Packaging, Old\" \/><\/p>\n<p>I&#8217;m overwhelmed trying to assess the old packaging to set the stage. It&#8217;s horrendous. Inconsistent colors and illustration styles, terribly handled typographic compositions, varied photography styles &mdash; some of which remind you that you can make terrible looking food look even worse (just look at that luncheon meat shot!). The one loose thread holding it together, aside from consistent disparity, is the clunky use of Rotis Serif. <\/p>\n<p>There is hardly any comparison between the old packaging and the new packaging &mdash; there is a universe of improvement between them &mdash; though there are still some not-so-good things going on here. Let&#8217;s start with the good. The packaging makes great use of white space, often allowing an airy environment for the product photography and enabling the typography to be visually scanned and parsed with ease. The photography has a tasty aesthetic and often moderately interesting product compositions. The color palette, while utilizing a wide range of hues, employs relatively consistent values and saturation levels, seems to choose colors with care (orange for orange juice, a vibrant purple for the Concord grape jelly, etc.) and combined with the large quantity of white and navy blue in the packaging, creates a readily identifiable palette. And let&#8217;s hope we see more fun illustrations like the one on the Fruity Puffs cereal.<\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/greatValue_2.jpg\" alt=\"Great Value Packaging, New\" \/><\/p>\n<p>Then we get to the not-so-good. The product typography, while clear and neatly arranged in all its Myriad glory, is as plain and uninspirational as the white bread it serves. While uninflected, sans serif type can work well in letting other graphic elements sing <a href=\"http:\/\/assets.stepinsidedesign.com\/stepicons\/14359.jpg\" target=\"_blank\" rel=\"noopener noreferrer\">in some grocery contexts<\/a>, it doesn&#8217;t here. Don&#8217;t get me wrong, I appreciate the restraint and lack of starbursts (though I&#8217;m sure some will come soon enough), agree that the nutrition information is easy-to-read, and understand that this setup is easy to implement and control &mdash; it just feels antiseptic. The other not-so-good part is the &#8220;Great Value&#8221; logo, whose typographic implementation has nothing going for it. Outlined letters + bad kerning always = disaster. For all the good work that&#8217;s gone into this system I can&#8217;t imagine what they were thinking with this wordmark.<\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/greatValue_1.jpg\" alt=\"Great Value Packaging, New\" \/><\/p>\n<p>I won&#8217;t get into the actual packaging forms and materials, they&#8217;re cost effective and I wouldn&#8217;t expect to see them change much for that very reason. They&#8217;ve mentioned that they made an effort to reduce materials where possible, maybe they could have made more of an effort, but we can certainly be thankful for what reduction we get and ask for more. Spending a lot of time in the service and experience design fields myself, I always appreciate companies wiling to invest in testing and understanding their products in an effort to improve them for the consumers. <\/p>\n<p>When I first heard that Walmart had redesigned this line of products, I&#8217;ll admit to having an expectation that while low, I wouldn&#8217;t have expected many corporate giants of this size (or near this size) to surpass. While their are some shortcomings &mdash; overall I stand impressed. <\/p>\n<p><span class=\"small\"><strong>Thanks to Tom Lucero for the tip.<\/strong><\/span><\/p>","protected":false},"excerpt":{"rendered":"<img src=\"https:\/\/www.underconsideration.com\/brandnew\/images\/excerpt_empty.gif\" alt=\"Excerpt Empty\" \/>","protected":false},"author":4,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[9,51,26],"tags":[],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/813"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=813"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/813\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=813"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=813"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=813"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}