{"id":819,"date":"2009-04-23T07:28:44","date_gmt":"2009-04-23T12:28:44","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/omg_packard_bell_is_like_so_co.php"},"modified":"2009-04-23T07:28:44","modified_gmt":"2009-04-23T12:28:44","slug":"omg_packard_bell_is_like_so_co","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/omg_packard_bell_is_like_so_co.php","title":{"rendered":"OMG, Packard Bell is, Like, so Cool"},"content":{"rendered":"<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/packard_bell_logo.gif\" alt=\"Packard Bell Logo, Before and After\" \/><\/p>\n<p>When the e-mail popped into my inbox with the subject &#8220;Packard Bell&#8221; I was magically transported to my early teenage years, maybe even younger or, at least, to a time before Apple ruled the earth and beige expensive beige PCs were the household norm. I don&#8217;t know much about <a href=\"http:\/\/www.packardbell.com\" target=\"_blank\" rel=\"noopener noreferrer\">Packard Bell<\/a> and, all things considered, it&#8217;s a brand that is as memorable as the pigeon waddling outside the window of the coffee shop I am writing this from. But I do remember the one kid in my class who had the Packard Bell at home. I can&#8217;t remember what brand we had at our home. I know it wasn&#8217;t Packard Bell. Because this kid&#8217;s computer, a Packard Bell, sucked. Big time. We couldn&#8217;t play any games on this computer. It was slow and it was dull. Poor kid. Apparently Packard Bell has a whole other appreciation of its brand.<\/p><!--more--><blockquote>The Packard Bell brand is where simplicity, trends and technology meets to create fashionably new ways of living and ultra smart forms for working. Across all products and segments, Packard Bell sets the standard for cool, design-driven technology.<br \/>&mdash; <a href=\"http:\/\/www.packardbell.com\/NR\/rdonlyres\/8636FEBD-DD8F-4C1C-9045-348040B61BBB\/1066\/2PuredesirePackardBellsMakeover.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">Press Release [PDF]<\/a><\/blockquote>\n<p>I&#8217;m not alone in this low perception of the brand: In a 2007 article ranking the 10 Worst PCs of All Time, <em>PC World<\/em> ranked not one but the whole oeuvre of Packard Bell from 1986 to 1996 as <a href=\"http:\/\/www.pcworld.com\/article\/129857-11\/the_10_worst_pcs_of_all_time.html\" target=\"_blank\" rel=\"noopener noreferrer\">the number one worst PC(s) of all time<\/a>. Certainly, that hasn&#8217;t stopped it from producing desktops, notebooks, netbooks, MP3 players, monitors and storage devices over the years. And whether Packard Bell recently changed their identity to keep evolving their own, somewhat deluded, image of cool or they were trying to distance themselves from some of these lasting perceptions the new logo is somewhat of a train-wreck. But, of course, Packard Bell does not see it that way.<\/p>\n<blockquote>The Packard Bell brand has undergone an incredible makeover that would leave anybody breathless, adapting its visual identity to the brand value proposition deriving from the group&#8217;s multi-brand strategy.<br \/>&mdash; Press Release<\/blockquote>\n<p>When it comes to things happening to my breath, I really prefer when it is <a href=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/in_brief_the_wrong_kind_of_bre.php\">taken away from me<\/a>&hellip; but seriously, &#8220;breathless&#8221;? Wow. The release goes on:<\/p>\n<blockquote>The new visual identity of Packard Bell is furthermore expressing the brand&#8217;s understanding of trends and its ability to reinvent them, understanding the origins of desire and transformation, evolving and creating thanks to its unlimited imaginative mind: the Packard Bell spirit reinvents today&#8217;s trends and set the stage for tomorrow&#8217;s breakthroughs. This is more than technology. It&#8217;s a lifestyle, a life experience, and a reflection of the way we see the world.<\/blockquote>\n<p>And on, now about the change from purple to red:<\/p>\n<blockquote>While purple connotes luxury and sophistication but also mystery, envy and introspection, red is associated with heat, energy and blood, and also emotions such as excitement, passion, love and more. Purple does not energize the outside world, but relaxes and calms it. Red communicates ambition, power, vitality, enthusiasm and a desire to conquer. Red speaks to the outside world in a clear, distinctive and visually appealing language. Red is a personality amplifier, a life enhancer. It draws attention, captures it and keeps it there. Red is colour at its best. Red is the perfect colour to infuse the Packard Bell brand with the personality and strength of identity to position it as the leader in its particular segment.<\/blockquote>\n<p>And what insight may we read on the change from Packard Bell to PB you ask? Well:<\/p>\n<blockquote>Moving from <em>Packard Bell<\/em> to &#8220;<em>PB<\/em>&#8220;: <em>That&#8217;s so cool<\/em>!!<\/blockquote>\n<p>Apologies if I have quoted more than usual from the press release, but it&#8217;s not everyday that we get so much hot air in a single PDF. The first thing you will notice about the new logo is just how rounded it is all around, and there is a perfectly good explanation in the press release that states that not just the logo but the whole product line is changing &#8220;[from] sharp edges to more rounded ones.&#8221; And, boy, it&#8217;s rounded. The three-dimensional PB is probably meant to look like a cool notebook or at least that&#8217;s what I see. It comes with some gratuitous (or, perhaps, obligatory) shading and it just looks too childish and toy-like, as if it were the latest spaceship for the G.I.Joe troops. <\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/packard_bell_detail.gif\" alt=\"Packard Bell Logo, Detail\" \/><\/p>\n<p>The typography is actually not bad at all, with some looser tracking it would have probably looked better and it could have been tweaked a little like the previous logo and have just the wordmark by itself without the ominous PB looming over it. It&#8217;s hard to take a company serious when they attempt to put so much spin on a brand personality they do not actually own. Whether you look at the logo or the language it&#8217;s all just a big pose at best.<\/p>\n<p><span class=\"small\"><strong>Thanks to <a href=\"http:\/\/www.lemento.com\" target=\"_blank\" rel=\"noopener noreferrer\">Tom Vanderbauwhede<\/a> for the tip.<\/strong><\/span><\/p>","protected":false},"excerpt":{"rendered":"<img src=\"https:\/\/www.underconsideration.com\/brandnew\/images\/excerpt_empty.gif\" alt=\"Excerpt Empty\" \/>","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[9,51,26],"tags":[],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/819"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=819"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/819\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=819"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=819"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=819"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}