{"id":8770,"date":"2020-05-26T03:12:27","date_gmt":"2020-05-26T08:12:27","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/how_we_doin.php"},"modified":"2020-05-26T03:12:27","modified_gmt":"2020-05-26T08:12:27","slug":"how_we_doin","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/how_we_doin.php","title":{"rendered":"State of the Un(derConsiderat)ion"},"content":{"rendered":"<p>I have rewritten this opening paragraph about six times trying to be witty or deep or allegorical and all those versions felt like I was trying too hard, so I&#8217;ll just write what I <em>really<\/em> want to write: the last three months have been frustrating, annoying, depressing, and defeating with the next three months gearing up to be equally frustrating, annoying, depressing, and defeating. But even that is sugar-coating it, so I&#8217;ll say what I really want to say: this fucking sucks. <\/p>\n<!--more--><p>As most of you know, Brand New is part of UnderConsideration which is run 100% by two human beings, me and my business partner and wife, Bryony. We have been working from home and independently since 2007 so the Working From Home part has not been a shock. We were as prepared as possible to deal with this in isolation because isolation has been our modus operandi all along. <\/p>\n<p>One of the reasons we originally started working from home was so that we could be with our kids as much as possible &#8212; we have two daughters, ages 10 and 13 &#8212; but, man, we never expected to be with them 100% of the time. For my wife in particular, it&#8217;s a big return to the early days of motherhood where she was 85% mom, 15% principal of UnderConsideration and it took her a good 5 to 7 years to become a full-ish-time working designer again, hitting her stride in the past 3 to 5 years, only to come back to it full circle. Don&#8217;t get me wrong, she LOVES our kids &#8212; as do I (for the most part&#8230; kidding&#8230; sort of&#8230; okay, I&#8217;ll stop) &#8212; but she also LOVES working and had finally found the right balance, which has been a tough thing to let go of. Thirteen years ago when we had our first kid and two months ago when it was clear things were going to get weird we made the joint decision that I would\/will focus on the business and she would\/will focus on the kids. It worked for us once, so we are hoping it will work again.<\/p>\n<p>Having the kids at home full time has been hugely distracting though. It&#8217;s very hard to do any deep work with them around, which makes this moment in life harder, given that our whole 2020 business plan went up in flames in a matter of weeks and trying to figure out what to do and how to do it is infinitely more difficult without the solitude and quiet me and Bryony had grown used to for 8 hours a day while the kids were at school. <\/p>\n<p>It may seem like we are fine because Brand New, the blog, on the surface, has not been affected: I have posted pretty much every day since the outbreak began and, other than a few references to the situation in some posts, I have not addressed it head-on, in part because COVID-19 doesn&#8217;t have a direct effect on this blog &#8212; at least not yet&#8230; I have the feeling that anywhere between 3 and 6 months from now I will have a shortage of content because I&#8217;m not sure how much identity work has been produced this year and when any little of it will launch &#8212; so I haven&#8217;t had to send out an email to everybody outlining how I&#8217;m sanitizing my keyboard every hour because, well, I&#8217;m not, and if I cough into my keyboard all day long it doesn&#8217;t affect you in any way.<\/p>\n<p>So, while, yes, Brand New is fine, UnderConsideration is not exactly fine given that our business plan for 2020 was events &#8212; you know, those things where we all gathered knee-to-knee, elbow-to-elbow in dark, closed-off spaces with recirculated air for spans of 10 to 12 hours? Yeah, those. Lots and lots of in-person events. Nine to be specific: eight First Rounds and the one Brand New Conference. After the growing success of First Round in 2018 and 2019, we went all in with it for 2020, planning to do three of them in the U.S. and five in Europe. It took us a good six months to set up the European events &#8212; from establishing financial entities in each country, to contracting venues long-distance, to selecting, inviting, and coordinating 60 speakers &#8212; and we were so ready to go. That was mid February. By the end of March we had postponed the Europe events to 2021, the May event in New York to September 2020 (which will probably be moved to 2021 as well), and, the biggest blow, postponing the Brand New Conference to 2021. All of a sudden, all the income projections we had, disappeared. That sucked but what sucked the most was the feeling of having to surrender: that there was literally nothing we could do to produce those events and, sure, the income is nice, but &#8212; corny warning &#8212; bringing those events to life for our audience is why we do it.<\/p>\n<p>Now, we are not fishing for sympathy but because part of our persona as UnderConsideration has always been that we have our act together I feel it&#8217;s as important to project strength, bravado, and confidence as it is to reveal vulnerability, fear, and uncertainty so that anyone else who feels any of the latter knows that you are not alone especially when, as a society, there is a constant pressure for all of us to show that we are succeeding. And right now we are not. And it fucking sucks. We are competitive, we like to win, and, technically speaking, these last two months knocked us down to the mat. We lost this round; no question about it.<\/p>\n<p>To bring back some positivity: this situation reminds us of the 2008 &#8211; 09 recession and how our lack of clients and prospects at the time (which sucked almost as much as this does now) forced us to think of potential solutions. One of them was the self-publishing of <a href=\"https:\/\/www.underconsideration.com\/flaunt\/\" target=\"_blank\" rel=\"noopener noreferrer\">Flaunt<\/a> in 2009 and the other was launching the Brand New Conference in 2010. Without that recession, those two things may never have existed. Once again we are being forced to think creatively, under stress, about how to generate income. While it&#8217;s not necessarily fun, a challenge is always welcome. We have a couple of ideas already but it will take months before those pay off &#8212; IF they pay off. For ten years we have turned client work away not because we are snobs but because we didn&#8217;t have time to take on those projects properly so now that&#8217;s something we are starting to pursue again, which won&#8217;t be easy as we have to, like, generate business and network and sell, none of which is our strength. We have the good fortune of being able to sustain a period of no income for a number of months which buys us some time to figure out a new business model and that&#8217;s where we are at the moment: concerned and a little afraid but optimistic and&#8230; a little afraid.<\/p>\n<p>For now, we will continue publishing Brand New, which has always been an infinitely joyful way of staying connected with the industry (and with all of y&#8217;all), especially now from the confines of the small city we live in in the Midwest. Maintaining First Round and the Brand New Conference alive will be our number one priority and we hope we can resume those at 100% in 2021 but will adjust as needed. We we will be trying a number of new things in the coming months, some with you as our audience in mind, some with clients in mind. And, finally, as citizens of the world, we will continue washing our hands, wearing masks in public, staying home as much as possible, supporting small businesses, and making the best of this situation as Summer rolls in, which is going to be long and hot and&#8230; long.<\/p>\n<p class=\"end\">I hope you are all safe and that something in this lengthy, non-logo-related post will serve as consolation, inspiration, or at the very least, confirmation that we are all trying to make the best of this situation &#8212; if not downright survive it. Overall, as always, thank you for reading.<\/p>","protected":false},"excerpt":{"rendered":"I have rewritten this opening paragraph about six times trying to be witty or deep or allegorical and all those versions felt like I was trying too hard, so I&apos;ll just write what I really want to write: the last&#8230;","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[23],"tags":[1235],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/8770"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=8770"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/8770\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=8770"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=8770"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=8770"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}