{"id":898,"date":"2009-08-05T17:07:49","date_gmt":"2009-08-05T22:07:49","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/coca-cola_vs_pepsi_revised_edition.php"},"modified":"2009-08-05T17:07:49","modified_gmt":"2009-08-05T22:07:49","slug":"coca_cola_vs_pepsi_revised_edition","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/coca_cola_vs_pepsi_revised_edition.php","title":{"rendered":"Coca-Cola vs. Pepsi, Revised Edition"},"content":{"rendered":"<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/inbrief_coca-cola_pepsi.jpg\" alt=\"Coca-Cola Logo\" \/>\n<p>In the last couple of weeks, <a href=\"http:\/\/img507.imageshack.us\/img507\/8676\/4586.jpg\" target=\"_blank\" rel=\"noopener noreferrer\">a JPG<\/a> has been making the internet rounds and, in the process, has gathered more than 6,500 Diggs (not that that is any measure of successful success, but still&hellip;) and has been mentioned in dozens of design and culture blogs, including many which I frequent and respect. The problem is that the JPG is wrong and disingenuous. It comparatively illustrates the evolution of the Pepsi and Coca-Cola logos from their beginnings in the late nineteenth century to their current state at the end of the 2000s. The comparison chart mocks the ever-changing personality of the Pepsi logo in contrast to Coca-Cola&#8217;s stoic script logo, unaffected by the effects of time. The philosophical point it makes is indeed funny and, for the most part, accurate: Coca-Cola has long been the steady brand that triumphs over Pepsi as the latter attempts to gain ground with brand gimmicks and changes. And I will be the first to admit that the Coca-Cola logo and its consistency over the years is far more supreme than Pepsi, but every time I saw this JPG come up in more and more web sites and blogs I couldn&#8217;t help but cringe at the inaccuracy and deception it engenders.<\/p><!--more--><p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/coke_pepsi_chart_fail.jpg\" alt=\"Coca-Cola vs. Pepsi Chart Fail\" \/><\/p>\n<div class=\"caption\">Pepsi vs. Coca-Cola Logo Evolution chart with a fat X from Brand New.<\/div>\n<p>True, no one will die and the lasting effects of this JPG mean nothing, really. But I felt a burden of duty to correct a few things. The biggest problem is that the chart puts the same logo in 1885 as it does in 2008. This is not only wrong but idiotic. Technically, the Coca-Cola logo as it exists today can not be replicated with the tools of 1887 which, by the way, is the year the script logo was introduced. Not 1885. Coca-Cola was first served in 1886 and even then, the first official logo of Coca-Cola was not the script logo. It first appeared in the <em>Atlanta Journal Constitution<\/em> in 1886 as both a slab serif and chunky sans serif &mdash; it wasn&#8217;t until mid-1887 that Frank Robinson, Coca-Cola&#8217;s bookkeeper, drew the first traces of the Spencerian script logo that we all know.<\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/coke_first_logo.jpg\" alt=\"Coca-Cola First Logo\" \/><\/p>\n<div class=\"caption\">First Coca-Cola logo appeared in the <em>Atlanta Journal Constitution<\/em> on Saturday May 23 1886.<\/div>\n<p>The chart, for comic and poignant effect, then leaves a 120-year gap between the first and last logos. It makes for a great viral JPG, but not for telling the real story. For the first ten to twenty years you could probably find a dozen different executions of the Coca-Cola script as the logo was probably drawn over and over for different applications. It isn&#8217;t until the 1930s and 1940s that a clear interpretation of the logo appears and is used consistently. During the late 1950s and early 1960s the script logo is placed within a shape, referred to as the &#8220;fishtail&#8221; logo, which is as off-brand as anything that Coca-Cola has ever done.<\/p>\n<p>The chart also fails to mention the introduction of the wave, a ubiquitous visual today, that was first implemented in the 1960s when <a href=\"http:\/\/cases.lippincottmercer.com\/cgi-bin\/WebObjects\/LMCases.woa\/wa\/viewcase?Coca-Cola\" target=\"_blank\" rel=\"noopener noreferrer\">Lippincott Mercer was in charge<\/a> of making the Coca-Cola identity more consistent. More than any Pepsi blunder, the chart ignores the introduction of &#8220;New Coke&#8221; in 1985 with a new formula marketing and set of logos &mdash; that completely ignored the script logo &mdash; that left a bad taste in their consumers&#8217; mouths. Around the same time, in 1986, <a href=\"http:\/\/www.landor.com\/index.cfm?do=aboutus.cocacolacase&#038;bhcp=1\" target=\"_blank\" rel=\"noopener noreferrer\">Landor began rolling<\/a> out an even more developed brand identity that modified the wave among other subtle changes.<\/p>\n<p>Missing from the chart in the Coca-Cola evolution is the penchant for Coca-Cola to use the shape of its bottle as an icon, acting on and off as the logo or complementary logo or subsidized logo of the main script logo, sometimes to a confusing fault. Today&#8217;s Coca-Cola logo is, of course, amazingly similar to what it was 124 years ago but it&#8217;s not quite fair to idolize them for a flawless consistency that they haven&#8217;t actually earned. <\/p>\n<p>Once more, I will say that the Coca-Cola evolution is admirable and few companies &mdash; probably just GE &mdash; can claim to have extended their identity heritage across three centuries, but Coca-Cola isn&#8217;t perfect and as much as I despise the new Pepsi identity &mdash; which in no way am I trying to defend &mdash; I believe a fair comparison is in order. <\/p>\n<p>So, here is the new chart. It&#8217;s not ideal, since I didn&#8217;t have a document as clean and specific as <a href=\"http:\/\/pepsiusa.com\/downloads\/PepsiLegacy_Book.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">this one<\/a> for Pepsi (scroll to last page of PDF) and I had to cobble the logos from different sources. The reds are all over the place and some are in black and white.<\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/coke_pepsi_chart_revised.jpg\" alt=\"Coca-Cola First Logo\" \/><\/p>","protected":false},"excerpt":{"rendered":"<img src=\"https:\/\/www.underconsideration.com\/brandnew\/images\/excerpt_empty.gif\" alt=\"Excerpt Empty\" \/>","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[26],"tags":[],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/898"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=898"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/898\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=898"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=898"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=898"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}