{"id":9021,"date":"2017-02-06T14:48:03","date_gmt":"2017-02-06T20:48:03","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/cookie_problem.php"},"modified":"2017-02-06T14:48:03","modified_gmt":"2017-02-06T20:48:03","slug":"cookie_problem","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/cookie_problem.php","title":{"rendered":"Cookie Problem Fixed"},"content":{"rendered":"<p>If you have ever tried to visit Brand New and gotten instead a status page that reads <strong>400 Bad Request<\/strong> and it does not allow you to access the site, the problem has been solved! If you are affected by this, the short of it is that you need to clear your cache, specifically the cookies from your cache, and even more specifically the underconsideration.com cookies from your cache &#8212; if you know how to do the latter, this is the ideal solution as you won&#8217;t lose cookies from other sites. After you clear your cache, you will not be affected by this again (unlike before, where the problem would return). Now, if you are interested in the long of it, read on&#8230;<\/p>\n<p>It&#8217;s been a problem plaguing a small percentage of users for two or three years and only this past week I was able to understand what the problem was. Well, I knew the problem had to do with the cookies &#8212; cookies placed by the polls. But I don&#8217;t know much if anything about cookies. After years of telling people to empty their cache but not able to offer a long-term solution or proper explanation and with the looming redesign of Brand New I knew I had to get to the bottom of it. I usually don&#8217;t fill the polls myself because I already wrote a bunch of paragraphs with my opinion so there is no satisfaction in clicking on the polls. So I started clicking on the polls to see if I could replicate the problem. After a couple of weeks I didn&#8217;t have any issues so I looked into analyzing the cookies through Google Chrome that allows me to look at each specific cookie&#8230; and there it was. I could see a bunch of cookies, one for each question of each poll&#8230; so, after a week I had about 30 cookies. I thought &#8220;that can&#8217;t be healthy&#8221;. I clicked on one of the cookies and all the way at the bottom of its data I discovered what the problem was: each cookie was set to expire ONE YEAR after it had been placed. So, over time, the cookies accrue in your cache en masse and they eventually make the site inaccessible in some browsers. FYI: the cookies are placed so that you can vote on a poll only once and not get all vindictive or take advantage of the polls to make someone look extra bad or extra good. So, after figuring out where in the hell the expiration for the cookies gets coded, I managed to change it, and now cookies expire after 24 hours, so you have room for a fresh batch each day!<\/p>","protected":false},"excerpt":{"rendered":"If you have ever tried to visit Brand New and gotten instead a status page that reads 400 Bad Request and it does not allow you to access the site, the problem has been solved! If you are affected by&#8230;","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[23],"tags":[],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/9021"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=9021"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/9021\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=9021"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=9021"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=9021"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}