{"id":9387,"date":"2020-08-17T08:47:26","date_gmt":"2020-08-17T08:47:26","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/?p=9387"},"modified":"2020-08-17T10:21:10","modified_gmt":"2020-08-17T10:21:10","slug":"brand_new_will_shift_to_subscription_model","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/brand_new_will_shift_to_subscription_model.php","title":{"rendered":"Brand New will Shift to Subscription Model"},"content":{"rendered":"<p>After nearly 14 years of making Brand New free and open to everyone, the time has come to move into a paid subscription model. This was not a decision we took lightly and I will gladly expand on why we made it &#8212; in detail. This is a long post but I have added too-long-didn&#8217;t-read summaries at the end of each point. (The subscription cost and benefits are outlined at the end.) <\/p>\r\n<!--more-->\r\n<p><strong>Note:<\/strong> Given this news, I will not be posting regular content today (only) so as not to take away attention from that work. Back with regular posts tomorrow.<\/p>\r\n<style>\r\n\r\nh1.news_subscribe {\r\n    background-color: rgba(0,0,0,.85);\r\n    display: inline-block;\r\n    padding: 20px 25px;\r\n    color: rgba(255,255,255,.9);\r\n    margin: 6px 0 -10px 0;\r\n}\r\n\r\nh1.news_subscribe.noh6 {\r\n    margin: 6px 0 20px 0;\r\n}\r\n\r\n<\/style>\r\n\r\n<h1 class=\"news_subscribe\">The Why<\/h1>\r\n\r\n<h6>1. Survival<\/h6>\r\n\r\n<p>This is the number one reason we are doing this. Simply put: if us and you want to see Brand New continue publishing &#8212; and I would like to imagine that you do &#8212; we have to be able to directly monetize the blog in order to justify the immense time commitment it requires.<\/p>\r\n\r\n<p>Time spent on the blog is time that can not be spent on seeking\/securing clients and producing client work which, at this moment, is the only industry-related skill we (UnderConsideration) can use to generate income (more on that in #5). I would say 50% of our available weekly hours are spent on producing the content of this blog &#8212; including the podcast and the weekly newsletter. As most of you know, designing takes time and simply don&#8217;t have the necessary hours available to do it right in the short- or medium-term.<\/p>\r\n\r\n<p><strong>tl;dr<\/strong> <em>for Brand New to continue it needs to be self-sufficient.<\/em><\/p>\r\n\r\n<h6>2. Our primary source of monetization &#8212; events &#8212; may disappear<\/h6>\r\n\r\n<p>For the past ten years, when anyone has asked us about going into a subscription model, we have proudly said that it&#8217;s not something we need, have, or want to do because the Brand New Conference has been a way of monetizing the blog since the audience for that conference lives here so the effort and time spent on the blog pays off in the form of conference attendance. In the past two years, this nice feeling of being able to keep Brand New free was enhanced by the introduction of First Round, which gave us another source of income. This was going so well that, as some of you know, our business plan for 2020 revolved around nine in-person events which are not happening anymore and, to be honest, for the first time in months we are questioning if they will happen at all&#8230; ever again.<\/p>\r\n\r\n<p>We still have a sliver of hope &#8212; because there is literally nothing we love to do more &#8212; that we will be able to do our 2020 events in 2021 and that we will be able to get back on track with in-person events as our main source of income but, from the tone of this post, you might be able to gather that we are not fully optimistic of that.<\/p>\r\n\r\n<p>This ties in heavily with reason number one: In the worst-case-scenario that we have to cancel the 2020 postponed events in 2021 we could literally be bankrupted. It may sound dramatic but it&#8217;s the reality. We have non-refundable security deposits with 7 different venues, non-refundable room blocks with two hotels, and over 400 registrations sold and paid for that would need to be refunded. If those events are cancelled we are talking about approximately, and this is not an exaggeration, $250,000 &#8212; and there is nothing in the pipeline to make up for it.<\/p>\r\n\r\n<p><strong>tl;dr<\/strong> <em>without in-person events in the future, which is an increasing reality, our income drops to 10 &#8211; 15% and cancelling the 2021 events altogether could kill our business.<\/em><\/p>\r\n\r\n<h6>3. Online events<\/h6>\r\n\r\n<p>We have thought long and hard about this and there is no way we can match, let alone replicate the experience, quality, and\/or value of our in-person events online. More importantly, there is no joy for us in doing it this way and without that joy the product itself suffers and we simply do not want to put a product out there that isn&#8217;t up to our AND YOUR standards.<\/p>\r\n\r\n<p><strong>tl;dr<\/strong> <em>this is simply not something we are interested in pursuing as the experience and quality of online events is simply&#8230; not great.<\/em><\/p>\r\n\r\n<h6>4. The Podcast<\/h6>\r\n\r\n<p>Introducing the podcast has been a great addition content-wise and we thought that if enough people subscribed it would be enough to monetize the blog in the interim. Subscription rates are about 15% of what we estimated. Perhaps we had ambitious goals. To be transparent: our goal was 2,000 subscribers and while we didn&#8217;t expect to reach that goal immediately, the current 300+ subscriptions are a far cry from it. We are really enjoying doing the podcast so we don&#8217;t want to abandon it but it&#8217;s not the silver bullet that we thought could save 2020. Also, it takes a surprising amount of hours to put together each episode. We didn&#8217;t expect it to be a walk in the park but we didn&#8217;t realize how much time it would take, so, unwittingly, we have added yet more hours of workload that are not generating a matching return. In this new subscription model, everyone will have access to the podcast at no additional cost and we will move into a bi-weekly schedule.<\/p>\r\n\r\n<p>(Current annual subscribers of the podcast who signed up at the $50 rate: your subscription will be honored in the form of three years in this new model. Current monthly subscribers will get the first month of Brand New free. Instructions to come by email this week or next.)<\/p>\r\n\r\n<p><strong>tl;dr<\/strong> <em>takes a really long time to produce and has not yielded enough subscriptions &#8212; it&#8217;s great content so we will open its access and fold it into the subscription cost.<\/em><\/p>\r\n\r\n<h6>5. Client work<\/h6>\r\n\r\n<p>This is indeed our best option to match the income generated from the events BUT&#8230; deep breath&#8230; given our personal situation of UnderConsideration being two of us, who are married to each other, and have two kids (5th and 7th grades) who may not return to in-person learning at all this academic year it means that many, MANY hours of our day have to be devoted to them. As we explained <a href=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/how_we_doin.php\" target=\"_blank\" rel=\"noopener noreferrer\">in our state of the union post in May<\/a>, Bryony has become the more full-time parent and me the more full-time employee, which means I have to do the blog, lead the podcast production, AND do most of the client work. This is not a cry for sympathy or a woe-is-me-for-my-white-collar-job-and-first-world-problems but it&#8217;s simply not possible to do enough client work within the limited amount of time to generate the income needed &#8212; and worse, the quality of work and of content we want is much lower because everything is being done in a rush. Even if me and Bryony split our responsibilities 50\/50 something would have to give, and, unfortunately that something would have to be the blog and we are not ready, in any way, to give that up.<\/p>\r\n\r\n<p><strong>tl;dr<\/strong> <em>not enough time and\/or bandwidth to do it properly in addition to running the blog.<\/em><\/p>\r\n\r\n<h6>6. Advertising<\/h6>\r\n\r\n<p>This has been completely dead since at least 2015. We did a huge push in 2019 to get new advertisers and had zero results. The alternative is to run Google Ads but, at least to me, there is nothing worse on the internet than being sold to on every new website you visit the last thing you searched for 5 minutes ago and there is no way we are bringing that experience into Brand New.<\/p>\r\n\r\n<p><strong>tl;dr<\/strong> <em>aside from Google ads &#8212; which are irrelevant to our content and readers &#8212; there is zero interest from relevant companies.<\/em><\/p>\r\n\r\n<h6>7. Donation-model<\/h6>\r\n\r\n<p>We considered this and there is the potential of that we would be amazed by your generosity but, at best, donations solve our problem this year and we are left wondering what happens the year after that and the year after that. At worst, we do not get enough donations and we need to keep asking you all to donate while adding hours of effort into doing those asks on a consistent basis. At this point, our goal is to build a consistent, long-term solution that not only keeps Brand New going but gives us the foundation to keep building on it.<\/p>\r\n\r\n<p><strong>tl;dr<\/strong> <em>it&#8217;s a short-term solution &#8212; without a guarantee &#8212; that requires constant attention.<\/em><\/p>\r\n\r\n<p>&ndash; &ndash; &ndash;<\/p>\r\n\r\n<p>So, those are the reasons and the alternative routes we could take to NOT have to shift into a subscription model. We hope you appreciate the thought and consideration that went into these rationales and that the decision was made with the sole interest of keeping Brand New going.<\/p>\r\n\r\n<h1 class=\"news_subscribe\">The How<\/h1>\r\n\r\n<h6>1. Cost<\/h6>\r\n\r\n<p>$2 a month or $20 a year.<\/p>\r\n\r\n<h6>2. Access to&#8230;<\/h6>\r\n\r\n<ul>\r\n<li>The content of all individual posts on the blog beyond the before\/after header image.<\/li>\r\n<li>Polls and comments.<\/li>\r\n<li>The Follow-up podcast.<\/li>\r\n<li>The weekly newsletter.<\/li>\r\n<\/ul>\r\n\r\n<p>To keep things simple, it&#8217;s an all-or-nothing deal instead of itemized options.<\/p>\r\n\r\n<p>When you think about the cost, keep in mind that for $2 a month, you are getting access to the 5 posts of each day (1 Reviewed, 1 Noted, 1 Linked, 2 Spotted), which means it&#8217;s about 20 posts each week &#8212; that is <em>1 cent<\/em> per post. And that doesn&#8217;t take into account the podcast or the newsletter. At $20 a year, each post is less than 0.01 dollars.<\/p>\r\n\r\n<h6>3. Future improvements<\/h6>\r\n\r\n<p>We have a number of ideas we are looking to implement on the blog and in the newsletter to give you even more value for your subscription and expand on the content. The plan is to implement them over the next 3 to 4 months as opposed to everything is new the day the subscription model starts.<\/p>\r\n\r\n<p>To start with, we have finally ported over all the content from the previous Content Management System, MovableType, to WordPress, which is something we should have done in the last redesign in 2017 but, at the time, I didn&#8217;t have enough experience in WordPress. This move gives us a lot of flexibility to access the 14 years of content in new and exciting ways.<\/p>\r\n\r\n<p>With some working capital there is also the option of having contributing writers for those weeks where we take a vacation and everyone asks how come there are no contributing writers to fill in for me AND if you are paying for content, you should get content &#8212; previously I didn&#8217;t feel guilty for taking a break but now I would.<\/p>\r\n\r\n<h6>Free access<\/h6>\r\n\r\n<p>For anyone that can simply and honestly not <em>afford<\/em>* the subscription cost we will happily provide a free subscription. No questions asked. No reasons required. You tell us you can&#8217;t afford it, we will honor your request. Please note, this is not a blanket invitation to students &#8212; many of you can skip one Starbucks drink a month to afford two months of Brand New.<\/p>\r\n\r\n<p>* &#8220;Afford&#8221; being key. &#8220;Not wanting to&#8221; is not a valid reason if you can afford it, whether you are a professional or student.<\/p>\r\n\r\n<h1 class=\"news_subscribe noh6\">The When<\/h1>\r\n\r\n<p>August 24, 2020.<\/p>\r\n\r\n<p>If you wanted to, <a href=\"https:\/\/www.underconsideration.com\/brandnew\/subscribe\">you can begin your subscription now<\/a> but otherwise, all content &#8212; except for The Follow-up podcast &#8212; will remain accessible for now. Next Monday you will be getting a prompt to subscribe to access the content.<\/p>\r\n\r\n<h1 class=\"news_subscribe noh6\">The final word<\/h1>\r\n\r\n<p>We have kept the price low so that as many of you may decide to stay with Brand New in its new subscription model. Comparable to other creative industry web publications we are a fraction of the cost and that&#8217;s on purpose &#8212; not to undermine any of them but to make the barrier of entry as minimal as possible and in line with our event pricing, which is often half or a quarter of the cost of other design conferences in the U.S..<\/p>\r\n\r\n<p>We hope that after 14 years of publishing Brand New you trust us with $20 or $24 out of your <em>annual<\/em> budget to bring you content that is of value to you and keep this blog going for at least another 14 years. Whether you&#8217;ve been reading for all those 14 years or just 14 months, 14 weeks, or 14 days, we thank you for having helped turn this weird, niche blog into something that we are so proud to produce for so many people around the world.<\/p>\r\n\r\n<p class=\"end\">Your support now, in this new subscription model, would mean a lot not just to us but to everyone that reads Brand New.<\/p>\r\n\r\n<p>&nbsp;<\/p>","protected":false},"excerpt":{"rendered":"<p>After nearly 14 years of making Brand New free and open to everyone, the time has come to move into a paid subscription model. This was not a decision we took lightly and I will gladly expand on why we made it &#8212; in detail. This is a long post but I have added too-long-didn&#8217;t-read summaries at the end of each point. (The subscription cost and benefits are outlined at the end.) <\/p>","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[8],"tags":[43],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/9387"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=9387"}],"version-history":[{"count":14,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/9387\/revisions"}],"predecessor-version":[{"id":9402,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/9387\/revisions\/9402"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=9387"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=9387"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=9387"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}