{"id":989,"date":"2009-12-11T08:58:52","date_gmt":"2009-12-11T14:58:52","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/archives\/have_mercy_on_my_logo.php"},"modified":"2009-12-11T08:58:52","modified_gmt":"2009-12-11T14:58:52","slug":"have_mercy_on_my_logo","status":"publish","type":"post","link":"https:\/\/www.underconsideration.com\/brandnew\/archives\/have_mercy_on_my_logo.php","title":{"rendered":"Have Mercy on My Logo"},"content":{"rendered":"<img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/mercy_corps_header.jpg\" alt=\"Mercy Corps Logo, In the Field\" \/>\n<p><em><strong>Ed.&#8217;s Note:<\/strong> This post strays from our typical format in various ways: It is not a new identity, it is not a before\/after comparison, it is not an In Brief, and it is written by the person that designed the identity (can you imagine if we let everyone critique their own work?!). Nonetheless, this is an engaging story to post with a good lesson for everyone to learn. At least I enjoyed it and I&#8217;m happy to make an exception to the rules. End of note.<\/em><\/p>\n<p>A typical identity project involves plenty of personal creative investment, hours upon hours devoted to rounds of sketching, revisions, and the pain-staking final tweaks to create a singular, perfect end result. Once the identity is complete and leaves our hands, though, we can&#8217;t protect the precious qualities of what we delivered, and it&#8217;s at the hands of clients to see if it remains in its intended form as time goes on. Yet, during a routine check-up call &mdash; something I do from time to time with previous clients &mdash; one of my logos definitely strayed from any branding guidelines, but, surprisingly, done so to the betterment and even salvation of populations living continents away.<\/p><!--more--><p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/mercy_corps_logo_detail.gif\" alt=\"Mercy Corps Logo, In the Field\" \/>\n<p>During one such call, I spoke with Jennifer Dillan, Senior Manager of Creative Services at <a href=\"http:\/\/www.mercycorps.org\/\" target=\"_blank\" rel=\"noopener noreferrer\">Mercy Corps<\/a>, the aid organization for which we designed a new identity several years ago. &#8220;How is the brand identity going?&#8221; I asked, &#8220;Is the logo working in the field?&#8221; To which she answered, &#8220;Your logo saves lives!&#8221; That is by far the most unexpected and most profound response I have ever heard. She elaborated about how important it was for the victims to recognize the much-desired help and to differentiate it from not-so-well meaning people and the &#8220;enemy.&#8221; Just like the Red Cross is instantly recognizable, so too does Mercy Corps have to signal their brand on vehicles of any kind, on tents and primitive structures, on clothing, flags and banners, on wells and supplies, packages, and signs.<\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/mercy_corps_01.jpg\" alt=\"Mercy Corps Logo, In the Field\" \/>\n<blockquote>&#8220;Mercy Corps helps people in the world&#8217;s toughest places turn the crises of natural disaster, poverty and conflict into opportunities for progress. Driven by local needs and market conditions, their programs provide communities with the tools and support they need to transform their own lives. A team of 3,700 professionals is improving the lives of 16.7 million people in more than 40 countries.&#8221;<\/blockquote>\n<p>This is how Mercy Corps talks humbly about itself. In other words, floods, earthquakes, tsunamis, devastated areas by war or weather, draughts, famine, you name it, Mercy Corps is there, helping people to help themselves. Their stories are awesome and inspiring.<\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/mercy_corps_02.jpg\" alt=\"Mercy Corps Logo, In the Field\" \/>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/mercy_corps_03.jpg\" alt=\"Mercy Corps Logo, In the Field\" \/>\n<p>The logo we created for Mercy Corps is a brush-painted symbol alluding to a jubilant person while at the same time representing a growing plant or flower. A new brand strategy and mission statement was developed by Foote Cone &amp; Belding, culminating in the tagline: &#8220;Be the Change,&#8221; taken from a quote by Gandhi: &#8220;You must be the change you wish to see in the world.&#8221; The symbol was designed to be somewhat crude and hand-made in order not to look corporate, slick, or complex, but we also realized early on that it would have to be reproduced with the simplest tools and methods possible, and applied on any kind of substrate or surface. Therefore we did only prepare the most basic final art and specifications.<\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/mercy_corps_05.jpg\" alt=\"Mercy Corps Logo, In the Field\" \/>\n<p>As we often warn people in graphic standards guidelines in order to protect our precious logos from being bastardized with sentences like: &#8220;Do not reset, redraw, distort in any way &hellip;always use original art from master files&hellip;Do not reproduce from photocopies, etc.&#8221; Well, the good people of Mercy Corps violate all of these, and, if all you have is a brush and some black goo and no way to access or utilize digital files, you may be forced to reconstruct it based on someone&#8217;s business card, crude photocopy, or from memory. <\/p>\n<p><img src=\"https:\/\/www.underconsideration.com\/brandnew\/archives\/mercy_corps_04.jpg\" alt=\"Mercy Corps Logo, In the Field\" \/>\n<p>I had to laugh when I saw some of the pictures from the &#8220;field.&#8221; It made me in a strange way happy to see obvious non-designers succeeding in copying the logo, in a different scale, on a piece of wood, cardboard, cloths or stone. Needless to say, it&#8217;s more important to be out there, in a vaguely recognizable way and saving lives, than being &#8220;correct.&#8221;<\/p>\n<div class=\"bottom\">Steff Geissbuhler is a founding partner of <a href=\"http:\/\/www.cgpartnersllc.com\" target=\"_blank\" rel=\"noopener noreferrer\">C&amp;G Partners<\/a> in New York City. He has designed identity systems for NBC, Merck, Time Warner Cable, Telemundo, Voice of America, Toledo Museum of Art, National Parks of New York Harbor, Crane &#038; Co., Calamos Investments, Conrad Hotels and Morgan Stanley Smith Barney. Prior to forming C&#038;G Partners, he was a partner at Chermayeff &#038; Geismar Inc. for 30 years.<\/div>","protected":false},"excerpt":{"rendered":"<img src=\"https:\/\/www.underconsideration.com\/brandnew\/images\/excerpt_empty.gif\" alt=\"Excerpt Empty\" \/>","protected":false},"author":5,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"categories":[79,26],"tags":[],"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/989"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=989"}],"version-history":[{"count":0,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/posts\/989\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=989"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/categories?post=989"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/tags?post=989"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}