{"id":145,"date":"2020-08-06T09:35:31","date_gmt":"2020-08-06T09:35:31","guid":{"rendered":"https:\/\/www.underconsideration.com\/brandnew\/wp\/?page_id=145"},"modified":"2020-08-06T09:39:29","modified_gmt":"2020-08-06T09:39:29","slug":"submit_tips","status":"publish","type":"page","link":"https:\/\/www.underconsideration.com\/brandnew\/submit_tips","title":{"rendered":"Submit Tips\/Work"},"content":{"rendered":"<p><strong>We encourage, celebrate, and applaud the submission of tips and projects. We have a somewhat odd, non-traditional set of criteria for what kind of projects we end up publishing, so reading the info below is helpful.<\/strong><\/p>\r\n\r\n<h6>Warning: Don&#8217;t Expect a Reply<\/h6>\r\n<p>Whether you are submitting a tip or a project of your own, we are most likely NOT going to answer your email. We are not being jerks. We simply have found it impossible to reply to the 15 or 20 daily emails we receive with tips and project submissions. Which is undeniably great because those emails become the main source of our content. But let&#8217;s all agree that unless you are asking a specific question or have some concerns or feedback we will not reply. Consider this paragraph our eternal reply button extending our gratitude!<\/p>\r\n\r\n<h6>Submitting Tips<\/h6>\r\n<p><a href=\"mailto:brandnew@underconsideration.com\">Email us<\/a> with your tip, any tip&#8230; the more we have, the more we can draw from. Ideal tip has the name of the company, product, or service in the subject and one or two links in the message that point us to a press release or announcement page. You can also write saying &#8220;I was watching TV and saw a new logo for X&#8221; and we&#8217;ll look into it. If you feel like writing a quick description of who or what the client is, that&#8217;s great but not required.<\/p>\r\n\r\n<p>We thank the tipster in our posts &#8212; when we receive multiple tips on the same one, we will thank the first one that came in &#8212; to always keep acknowledging the importance of the tips.<\/p>\r\n\r\n<p>Some people ask that their name not be included &#8212; usually for conflicts of interest &#8212; and that&#8217;s fine; we can accommodate the request.<\/p>\r\n\r\n<h6>Submitting Work<\/h6>\r\n<p>This area is more fraught with hurt feelings and a sense that we are snobs. To a degree, yes, we can be snobs, but mostly it&#8217;s based on ten years of seeing what kind of projects have the widest range of interest for a blog that attracts a large, global audience. See the criteria below for the kind of work we post. If you feel your project applies email us with one or two preview images, a one- or two-sentence description, and (if available) a link to see the full case study or a link to download the full set of images. If we think it&#8217;s a good fit for the blog we&#8217;ll contact you for more information\/images if they are not available already on your site.<\/p>\r\n\r\n<h6>Criteria for Publication<\/h6>\r\n\r\n<p>A key aspect for inclusion are projects that engender some kind of investment because the &#8220;clients&#8221; are either well-known or of a nominally large size that they have an impact on the world or that they represent something we are familiar with or can establish a connection with. For example, we would not post about a single hamburger joint in Austin, TX,* because a large portion of our readership would not be invested. We would definitely write about Burger King because everyone can relate. For the clients in between &#8212; the local or regional burger chains &#8212; that depends on the quality or interesting-ness of the work and whether it gets a full Review, or is Noted, Spotted, or not included at all. (See the <a href=\"about.php\">About page<\/a> for descriptions of each editorial category.) A simple formula for what gets on Brand New would be:<\/p>\r\n\r\n<ul>\r\n<li>Client is Big + Work is Great, Fine, or Bad: 100% chance of getting in.<\/li>\r\n<li>Client is Medium + Work is Great: 75% chance.<\/li>\r\n<li>Client is Medium + Work is Fine: 50% chance.<\/li>\r\n<li>Client is Medium + Work is Bad: 60% chance.<\/li>\r\n<li>Client is Small + Work is Great: 75% chance.<\/li>\r\n<li>Client is Small + Work is Fine: 5% chance.<\/li>\r\n<li>Client is Small + Work is Bad: 25% chance.<\/li>\r\n<\/ul>\r\n\r\n<p>To expand on the above&#8230;<\/p>\r\n\r\n<h6><span style=\"font-weight:300\">Criteria: Client is Big (Mainstream)<\/span><\/h6>\r\n<p>One of the first things we try to look at is if the product, service or corporation is relevant to a large number of people. Is it well known? Does it have history? Why should we care? If it&#8217;s a well known brand, chances are we will put it up. Regardless of whether it&#8217;s good or bad.<\/p>\r\n\r\n<h6><span style=\"font-weight:300\">Criteria: Client is Medium (not so Mainstream)<\/span><\/h6>\r\n<p>For every major brand, there are a handful of lesser known clients that we have posted. Whether they are corporations that we may have never heard of but that have 10,000 employees worldwide or whether it&#8217;s a product only sold regionally, we will review it if it&#8217;s an interesting story and there is something to learn from it.<\/p>\r\n\r\n<h6><span style=\"font-weight:300\">Criteria: Client is Small (not Mainstream at all)<\/span><\/h6>\r\n<p>If we have never ever heard of the company, product, or service and further Google-ing reveals that it is small or very local, we will not post it. There is nothing wrong with that kind of work and we do it ourselves all the time but, as far as Brand New content, it doesn&#8217;t work. It has to be a <em>very<\/em> compelling design story for us to post something very small.*<\/p>\r\n\r\n<h6><span style=\"font-weight:300\">Criteria: Work is Great, Fine, or Bad<\/span><\/h6>\r\n<p>Yes, this is subjective. VERY subjective. All we can say is &#8220;we know it when we see it&#8221;.*<\/p>\r\n\r\n<h6><span style=\"font-weight:300\">Criteria: International<\/span><\/h6>\r\n<p>Most of the identities we review are American. That&#8217;s because, the majority of our readers are in the U.S., but we have an increasingly international audience and we really enjoy posting work from around the world. If you are tipping us from afar, please let us know what kind of relevance any given identity would have in your motherland, so that we can have a better understanding of it.<\/p>\r\n\r\n<h6><span style=\"font-weight:300\">Criteria: Timeliness<\/span><\/h6>\r\n<p>We have broken this rule a few times, but anything that is more than three to six months old will not be posted.*<\/p>\r\n\r\n<h6><span style=\"font-weight:300\">* The Exception: Friday Likes<\/span><\/h6>\r\n<p>Each Friday we select three projects in a long-standing series called <a href=\"archives\/type\/friday-likes\/\">Friday Likes<\/a>. These tend to be for small clients, one-time events, single products&#8230; things that typically don&#8217;t fit the criteria. The main consideration for these is that design has to be absolutely great, or wild, or unique, or beautifully produced. This is one category where selections are made on pure subjective snobbery.<\/p>\r\n\r\n<h6>Summing up<\/h6>\r\n<p>The identities we review must be interesting and relevant, something that we care to see discussed whether it&#8217;s because we are familiar with the brand or because we are interested in the visual result. There is no real formula for selecting and, at the end of the day, it all comes down to our whims.<\/p> ","protected":false},"excerpt":{"rendered":"<p><strong>We encourage, celebrate, and applaud the submission of tips and projects. We have a somewhat odd, non-traditional set of criteria for what kind of projects we end up publishing, so reading the info below is helpful.<\/strong><\/p>","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"episode_type":"","audio_file":"","duration":"","filesize":"","date_recorded":"","explicit":"","block":"","filesize_raw":""},"_links":{"self":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/pages\/145"}],"collection":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/comments?post=145"}],"version-history":[{"count":3,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/pages\/145\/revisions"}],"predecessor-version":[{"id":152,"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/pages\/145\/revisions\/152"}],"wp:attachment":[{"href":"https:\/\/www.underconsideration.com\/brandnew\/wp-json\/wp\/v2\/media?parent=145"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}